{
  "info": {
    "author": "Florian Diesch",
    "author_email": "devel@florian-diesch.de",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 3 - Alpha",
      "Environment :: X11 Applications :: Gnome",
      "Intended Audience :: End Users/Desktop",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Natural Language :: English",
      "Natural Language :: German",
      "Operating System :: POSIX :: Linux",
      "Programming Language :: Python",
      "Topic :: Desktop Environment :: File Managers",
      "Topic :: Desktop Environment :: Gnome",
      "Topic :: Utilities"
    ],
    "description": ".. -*- coding: utf-8 -*-\n\n==================\n What is Arronax?\n==================\n\nArronax is a program to create and modify starters (technically:\n.desktop files) for applications and locations (URLs).\n\nArronax can be used as a standalone application or as a plugin for\nNautilus, the default file manager of the Gnome and Unity desktop\nenvironments.  \n\nArronax as Nautilus extension\n=============================\n\nAs Nautilus plugin Arronax adds a menu item “Create starter for this\nfile” or “Create a starter for this program” to the context menu\n(that’s the menu you get when you right-click a file in the file\nmanager). If the file is a application starter you get an item “Modify\nthis starter” instead.\n\nIf you have icons on your desktop enabled Arronax adds a menu item\n“Create starter” to your desktop’s context menu.  \n\nArronax as standalone application\n=================================\n\nArronax as standalone application can be started just like any other\napplication using the application menu or application search function\nof your desktop environment.  \n\nDrag & Drop\n===========\n\nArronax supports Drag&Drop:\n\n* You can drag an icon for example from the Unity Dash or the Gnome\n  Classic application menu and drop it on an open Arronax\n  window. Don’t drop it on one of the input fields in the Arronax\n  window but on the free space beneath the icon.\n\n* You can drag files from the file manager and other applications and\n  drop them on the input area in the “MIME types” tab to add the\n  corresponding MIME types to the list. This will add every MIME type\n  only once, even if you add multiple files with the same MIME type.\n\n* You can drag image files from the file manager or other applications\n  and drop them on the icon selector at the left of the Arronax window\n  to use that image as icon for the starter. It is up to you tom take\n  care that the image has the right size.\n\n* You can drag a file or folder from the file manager or a URL from\n  your web browser and drop it on the “Command”, “Start in Folder” or\n  “File or URL” input area to use the corresponding file path.\n\n\n========\n Status\n========\n\n\nAs far as I know there aren’t any serious bugs in Arronax.\n\nIf you find a bug in Arronax please report it at the bugtracker at\nLaunchpad so that I can fix it. Thank you.  \n\n\n==============\n Requirements \n==============\n\nArronax is beeing developed and tested on Ubuntu 12.04.3 “Precise Pangolin” and Ubuntu 14.04 “Trusty Tahr”.\n\nArronax needs:\n\n* Gnome 3.4 or later\n* Python 2.7\n* PyGObject\n* distribute\n* Nautilus-Python 1.1 or later\n\nIf you install the .deb package this packages will be automatically\ninstalled if needed.  \n\nEnable icons on your desktop\n============================\n\nWith Gnome Nautilus is by default configured not to show icons on your\ndesktop. You can change that by opening a Terminal, type::\n\n    gsettings set org.gnome.desktop.background show-desktop-icons true\n\n\n=======================\n Where can you get it?\n=======================\n\nArronax is available from\n\n    http://www.florian-diesch.de/software/arronax/\n\n\n=========\n License\n=========\n\nYou can use Arronax under the conditions of GPL v3 or later.\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or (at\nyour option) any later version.\n\nThis program is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program. If not, see http://www.gnu.org/licenses/",
    "docs_url": null,
    "download_url": "http://www.florian-diesch.de/software/arronax/",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "http://www.florian-diesch.de/software/arronax/",
    "keywords": "Nautilus,extension,plugin,starter,desktop",
    "license": "GPLv3",
    "maintainer": null,
    "maintainer_email": null,
    "name": "arronax",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/arronax/",
    "release_url": "https://pypi.org/project/arronax/0.06/",
    "requires_python": null,
    "summary": "Create and modify application, file and URI starters.",
    "version": "0.06"
  },
  "releases": {
    "0.01": [],
    "0.02": [],
    "0.03": [],
    "0.04": [],
    "0.05": [],
    "0.06": []
  },
  "urls": []
}