{
  "info": {
    "author": "Tom Lazar",
    "author_email": "tom@tomster.org",
    "bugtrack_url": null,
    "classifiers": [
      "Framework :: Pylons",
      "License :: OSI Approved :: BSD License",
      "Programming Language :: Python",
      "Topic :: Internet :: WWW/HTTP",
      "Topic :: Internet :: WWW/HTTP :: WSGI :: Application"
    ],
    "description": "Overview\n--------\n\n``briefkasten`` is a reasonably secure web application for submitting content anonymously. It allows to upload attachments which are then sanitized of a number of meta-data which could compromise the submitters identity. Next, the sanitized files are encrypted via GPG and sent via email to a pre-configured list of recipients. The original (potentially 'dirty') files are then deleted from the file system of the server. Thus, neither should admins with access to the server be able to access any submissions, nor should any of the recipients have access to the unsanitized raw material.\n\nUpon successful upload the submitter receives a unique URL with a token that he or she can use to access any replies the recipients may post. That reply is the only data persisted on the server.\n\nThe current implementation should be ready for general use on a functional level, so in theory anybody should be able to host their own secure ``briefkasten`` with minimal setup pain.\n\nA future release may contain more configurable options, but for now the main goal of publishing the code is transparency with re-usability coming in second.\n\nInstallation\n------------\n\nRequirements\n============\n\nThe web application requires Python 2.7, the sanitizing scripts depend on a number of helper packages (such as GnuPG etc.) which are currently not yet documented.\n\nBootstrapping\n=============\n\nChange into the application directory and run::\n\n  $ cd application\n  $ make\n\n**Note:** you can optionally provide a custom path to your python, i.e. ``make python=/opt/local/bin/python2.7``.\n\nThen you can start the web application like so::\n\n  $ bin/pserve briefkasten.ini\n\nand visit `<http://localhost:6543/submit>`_\n\n\nCustomization\n-------------\n\nThe briefkasten application deliberately only serves a very minimalistic markup by default. While you could go ahead and fork the project and modifiy the templates directly, that is not encouraged. Instead we provide a generic 'theming' approach using `Diazo <http://docs.diazo.org/en/latest/index.html>`_, where you simply add static HTML and CSS files which are then applied at runtime to the application's markup.\n\nThis means you neither have to learn how the application works in detail nor do you risk accidentally breaking its functionality.\n\nChanging the default look\n=========================\n\nTo change the default look you need to do four things:\n\n * create a theme directory\n * add the path to the buildout configuration file\n * re-run buildout\n * restart the application\n\nA theme directory must conform to the following structure::\n\n    rules.xml\n    theme.html\n    assets/\n\n``rules.xml`` must be a valid diazo rule, which needs to point to (at least) one html template (i.e. ``theme.html``). Any files located inside the ``assets/`` directory can be referenced from the theme, so you can add any images, CSS, JS and whatnot there. It's best to reference those assets with relative paths, that way you can develop the theme simply by opening the theme HTML file in a browser.\n\nFor further information on how to create additional rules see the `official Diazo documentation <http://docs.diazo.org/en/latest/basic.html>`_.\n\nTo use the theme, point the buildout to it. The easiest way is to replace the ``buildout.cfg`` symlink that the Makefile created with an actual file containing the following stub::\n\n    [buildout]\n    extends = development.cfg\n\n    [config]\n    fs_theme_path = XXXX\n\nWhere ``XXXX`` is the absolute path to the theme you created. Note that you can use the following syntax to refer to a location relative to the project file path::\n\n    [config]\n    fs_theme_path = ${buildout:directory}/themes/mycustomtheme\n\nOnce you've done this, you need to re-run buildout like so::\n\n    bin/buildout -No\n\n(The ``-No`` flags force buildout to run in offline mode, thus speeding the process up significantly, since we're only regenerating the configuration)\n\nYou then need to restart the application, i.e. by hitting ``CTRL-c`` in the foreground process and re-running ``bin/pserve briefkasten.ini``.\n\nOnce you've performed these steps you can keep the server running while you're developing the theme, because in debug mode changes to the theme and the rules are picked up instantly without requiring a restart.\n\nDevelopment\n-----------\n\nThe 'briefkasten' web application is developed in Python 2.7 as a `pyramid <http://docs.pylonsproject.org/en/latest/docs/pyramid.html/>`_ application and set up via `buildout <http://pypi.python.org/pypi/zc.buildout/>`_.\n\nTesting\n=======\n\nTests are run using `pytest <http://pytest.org/latest/>`_ like so::\n\n    $ bin/test\n\nThis outputs a textbased coverage report. If that should drop below 100% you can run::\n\n    $ bin/test-coverage\n\nThis generates a pretty report in `htmlcov/index.html` where you can browse the code and see which lines are not covered.\n\nMonitoring\n==========\n\nSince the whole system is configured by design not to log anything in order to protect the identity of submitters in case of a break-in, it is pretty much impossible to perform any post-mortem anyalysis when something has gone wrong. At the same time it is vital that you can be sure that the system is up and running at all times. Even if the web application is running and submitters can post data (and even receive a token as confirmation) any other part of the chain (sanitizing, encrypting and sending of the submitted material) could be broken without anybody noticing it. To this end, we've included a dedicated **watchdog** application which performs regular **end to end** tests of a ``briefkasten`` instance.\n\nIdeally, the watchdog is installed on another machine, preferably on another network (afterall, that's where your users will be coming from, too).\n\nTo install it, use a checkout of this project but use the ``watchdog.cfg`` configuration for running buildout, like so::\n\n    $ bootstrap -c watchdog.cfg\n    $ bin/buildout -c watchdog.cfg\n\n    ..TODO: provide a ``make watchdog`` target.\n\nThis will install an executable in ``bin/watchdog`` which is designed to be called without parameters, i.e. from a ``crontab`` entry.\n\nIt expects its configuration in ``etc/watchdog.ini`` with the following values::\n\n    app_url = # full URL to the submit form, i.e. ``https://ssl.zeit.de/briefkasten/submit``\n    test_token = # a unique string that will trigger the test submission when the watchdog submits a POST\n    max_process_secs = # time in seconds which it allows a submission to take to complete before it deems it failed.\n    imap_recipient = # email address to which the test submission should be sent to\n    imap_host =\n    imap_user =\n    imap_passwd =\n    notify_email = one or more (one per line) email recipients that should receive notification if something went wrong.\n    # smtp settings for pyramid_mailer, see\n    # http://docs.pylonsproject.org/projects/pyramid_mailer/en/latest/\n    smtp_host = localhost\n    smtp_port = 25\n    smtp_username = blubber\n    smtp_password = fooberific\n    smtp_tls = true\n\nWhen run, the script will:\n\n * log into the IMAP account and retrieve any new emails that look like a ``briefkasten`` submission, noting their token in a timestamped list of actually received notifications.\n * it then compares this list with the ones it expects a submission for. any tokens found are removed.\n * any tokens remaining with a time stamp older than the maximum allowed processing time trigger a notification email.\n * next, it performs a test submission at the given url. It sends the preconfigured token using a ``X-Briefkasten-Testing-Token`` header in the request.\n * it then parses the response and stores the token received in the list for which it expects a submission.\n * If anything went wrong during that process it sends out the notification(s) and terminates.\n\nNote, that unlike the application itself, the watchdog does keep detailed logs of all the steps described above, allowing some minimal post-mortem analysis without compromising actual 'real world' submissions.\n\nInternationalization\n====================\n\nAll user facing text of the `briefkasen` application are translated using a ``gettext`` messsage catalog. To customize and update these messages you must:\n\n * install the required tools\n * update the catalog file\n * compile the catalog\n\nInstalling the required tools\n*****************************\n\nIt's recommended to use virtualenv::\n\n    virtualenv-2.7 .\n    source bin/activate\n    pip install lingua Babel\n\nTo find untranslated text and create entries for them, do this::\n\n     python setup.py extract_messages update_catalog\n\nThen you can edit the message catalog in ``briefkasten/locale/XX/LCMESSAGES/briefkasten.po``\n\nFinally::\n\n python setup.py compile_catalog\n\nAfter restarting the application, the new translations will be active.\n\nFor more details check these links:\n\n * `pyramid.i18n <http://docs.pylonsproject.org/projects/pyramid/en/1.3-branch/narr/i18n.html>`_\n * `Chameleon <http://chameleon.repoze.org/docs/latest/i18n.html>`_\n * `Babel <http://babel.edgewall.org/wiki/Documentation/0.9/index.html>`_ \n\n\nThe life cycle of a submission\n******************************\n\nUsers entrusting us with sensitive data is the key concern of the software and when and getting it straight where this data is stored for how long in what form is crucial.\n\nThe stages are numbered with a three digit integer code, allowing to group and sort them.\n\nStatus codes beginning with `0` mean that the submission is still being handled by the web application (and implies that it is still unencrypted)\n\nThe life of a submission begins with the POST of the client browser succeeding.\nAny attachments are first stored in memory before writing them to disk into a dedicated dropbox directory.\nAt this point the submission has the status `010 received` and is readable in plaintext by any attacker who gains access to the application jail.\n\nNext, the web application hands off the submission to an external processing script, which immediately either errors out or acknowledges the receipt of the drop directory.\n\nThe error case at this stage means that the cleansing setup is seriously broken and the web application will take it upon itself to delete the attachments immediately to avoid exposing them in plaintext unduly.\n(TODO: a cronjob on the jailhost should additionally monitor for dropboxes in the 'submitted' or 'submitted failed' state for longer than a given threshold)\n\nIf the submission was successful (the process script returns `0` as exit code) the dropbox is considered to be `020 submitted`.\n\nOnce submitted, the cleanser performs basic sanity checking. If that fails for whatever reason it will set the status to `500 cleanser init failure`. Since it's basically being able to accept the attachments it will delete the attachment itself (TODO: confirm with @erdgeist)\n\nIf the process script determines that the cleansing setup is intact (whether locally or via one or more cleanser jails) it will set the status to `100 processing`.\nThe submission still resides in plaintext inside the application jail.\n\nThe process will now initiate the cleansing, either locally or by submitting it to a cleanser jail. Either way, once the submission is sucessful, the status will change to `200 quarantined`, and the submission is (finally) no longer readable inside the application jail.\n\nIf submission has failed the status will be set to `501 cleanser submission failure` and the attachments will be deleted.\n\nNow we are left with three possible outcomes: success, failure during cleansing or timeout:\n\n- `510 cleanser processing failure`\n- `520 cleanser timeout failure`\n- `900 success`\n\nIn all cases except `900` the attachments will have been deleted from the fileystem of the briefkasten host.\n\n\nFurther Documentation\n*********************\n\n\nTODO\n====\n\ngeneral bugs\n------------\n\nX fix claim mechanism\n\nX investigate 'heisenbug'\n\n- update docs re: `source bin/activate`\n\nx ensure appserver is running after config changes\n\nX ensure testing secret is present in themed forms\n\nx use private devpi with git-setuptools-version\n\n\n\nfeature: refactor process workflow\n----------------------------------\n\n- break into wrapping `process` call which will catch any exceptions and set the status accordingly\n  and will also be responsible for calling cleanup\n\n- `Dropbox.process` is\n\n  x the only entry point into and encapsulates the entire cleansing process\n\n  x a long-running, synchronous call that always succeeds (to the caller)\n\n  x but catches underlying failures and updates the status of the dropbox accordingly\n\n  x always calls cleanup\n\n  x separate 'private' tasks:\n\n  x if we have attachments:\n\n    x create uncleansed, encrypted fallback copy of attachments\n      - failures:\n        - no valid keys\n\n    x clean attachments (this also encrypts them)\n      - failures:\n        x no cleansers configured\n        x no cleansers available\n        - time-out\n\n    x archive clean attachments if cleaning was successful and size is over limit\n\n    - archive uncleaned attachments if cleaning failed\n      (re-uses the initially created encrypted backup before that is wiped during cleanup)\n\n    x notify editors via email\n\n      x (include cleaned attachments if cleaning was sucessful and size below limit)\n      x otherwise include link to share\n\n\nfeature: large attachments support\n----------------------------------\n\n x calculate total size of attachments\n\n x add configurable threshold value (support MB/GB via humanfriendly)\n\n x configure cleansed/uncleansed file system paths\n\n x configure formatstrings to render them as shares\n\n\nfeature: asynchronous workers\n-----------------------------\n\nx separate worker process (either using celery, or a custom worker)\n\nx runs in separate jail with mapped dropbox container file system\n\nx reads identical confguration on init\n\nx watches for appearance of new dropboxes and reacts to according to their status\n\nx keep dropbox specific settings in settings.json file inside container directory, only keep pyramid specific settings in .ini file (including path to dropbox container)\n\nTODOS:\n\n x create `worker` entry point\n\n x create supervisord config for worker\n\n x create configuration reader (hardcode python dict for now)\n\n x factor rendering of email text out of pyramid view into separate dropbox subtask\n\n\nfeature: re-activate watchdog feature\n-------------------------------------\n\n x set recipients to configured watchdog address instead of editors\n\n - integrate watchdog setup into makefile and base.conf\n\n - configure watchdog without buildout and from ploy.conf values\n\n\nfeature: local janitor (in python)\n----------------------------------\n\n - create cronjob (in worker jail)\n\n - write tests for erdgeist's python code :)\n",
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/ZeitOnline/briefkasten",
    "keywords": null,
    "license": "UNKNOWN",
    "maintainer": null,
    "maintainer_email": null,
    "name": "briefkasten",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/briefkasten/",
    "release_url": "https://pypi.org/project/briefkasten/0.2.15/",
    "requires_python": null,
    "summary": "a reasonably secure web application for submitting content anonymously",
    "version": "0.2.15"
  },
  "releases": {
    "0.1.10.dev0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "70df3b4012f860cf209b91177ebd5365",
          "sha256": "abe864e4c201b8fcefb1f38398e791fd835bd011c2f17660f0ecacfa98570006"
        },
        "downloads": 813,
        "filename": "briefkasten-0.1.10.dev0.zip",
        "has_sig": false,
        "md5_digest": "70df3b4012f860cf209b91177ebd5365",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 81061,
        "upload_time": "2015-10-22T13:14:18",
        "url": "https://files.pythonhosted.org/packages/bb/f7/2f46984cc7b7887bf2b5675908fea56a1da2796dc896e45d3abd1b5fddcd/briefkasten-0.1.10.dev0.zip"
      }
    ],
    "0.2.0.dev0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "89931228f69df7f0c31038fc51541e30",
          "sha256": "17d3fdcf5313a0a822cdf264a705d0d799df152e9a09688be3781e5b0ec620b6"
        },
        "downloads": 630,
        "filename": "briefkasten-0.2.0.dev0.zip",
        "has_sig": false,
        "md5_digest": "89931228f69df7f0c31038fc51541e30",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 79462,
        "upload_time": "2015-11-17T15:28:57",
        "url": "https://files.pythonhosted.org/packages/2e/ea/df7376c1eb27691a85132ec33050f3af0616c838f17c50ba0b30cdb5a55d/briefkasten-0.2.0.dev0.zip"
      }
    ],
    "0.2.0.dev1": [],
    "0.2.0.dev2": [
      {
        "comment_text": "",
        "digests": {
          "md5": "e6289fe510114963b115e31a38dd022f",
          "sha256": "dfaf0b97ea9510669de791fddde46aaa8673cef3dedf21c8d71ea412411680cc"
        },
        "downloads": 383,
        "filename": "briefkasten-0.2.0.dev2.zip",
        "has_sig": false,
        "md5_digest": "e6289fe510114963b115e31a38dd022f",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 269942,
        "upload_time": "2016-01-08T16:05:11",
        "url": "https://files.pythonhosted.org/packages/1b/2a/8eabf30bd1731e179273a2666f0f27fab6b929802c2dfebfe04fab88a7ec/briefkasten-0.2.0.dev2.zip"
      }
    ],
    "0.2.0.dev3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "618b1dafae9a9a54d356a17050a6f15d",
          "sha256": "add59d998e2e00b18060ae8a264685461636913c14ee4d461b48bde3312e592c"
        },
        "downloads": 444,
        "filename": "briefkasten-0.2.0.dev3.zip",
        "has_sig": false,
        "md5_digest": "618b1dafae9a9a54d356a17050a6f15d",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 275383,
        "upload_time": "2016-01-09T22:23:52",
        "url": "https://files.pythonhosted.org/packages/a9/c5/7252b7a1106afe076d25ad6ed1e049f0e835ed7aa314a02c848db2b6523b/briefkasten-0.2.0.dev3.zip"
      }
    ],
    "0.2.10": [
      {
        "comment_text": "",
        "digests": {
          "md5": "54120f7614123307514786c7e117045a",
          "sha256": "43fb168cb081bc4b9f5347ac2819dd5a1de9a3d8f12babf29d3ce6ad866fa1ee"
        },
        "downloads": 182,
        "filename": "briefkasten-0.2.10.zip",
        "has_sig": false,
        "md5_digest": "54120f7614123307514786c7e117045a",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 284375,
        "upload_time": "2016-03-07T16:40:24",
        "url": "https://files.pythonhosted.org/packages/d0/24/f639c508fff9e83b99df1c860e7bb00c09e2e91ac8b5b9899274b2b7f4df/briefkasten-0.2.10.zip"
      }
    ],
    "0.2.11": [
      {
        "comment_text": "",
        "digests": {
          "md5": "5e3c7d8091d845e4e0587035e1950cf4",
          "sha256": "19c34e3bb259b1f70a7c94493f0baf35cec2bf7498a8b219c005c4ea4c3ec40c"
        },
        "downloads": 188,
        "filename": "briefkasten-0.2.11.zip",
        "has_sig": false,
        "md5_digest": "5e3c7d8091d845e4e0587035e1950cf4",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283479,
        "upload_time": "2016-06-13T15:00:04",
        "url": "https://files.pythonhosted.org/packages/ff/a9/20e7285ffd74af2a85c3079447c1794f954c2275427747ef9fafab9c0989/briefkasten-0.2.11.zip"
      }
    ],
    "0.2.12": [
      {
        "comment_text": "",
        "digests": {
          "md5": "4fa1f9a9ebdd6a701f3695084fa7a171",
          "sha256": "d66f85acf0cead50ada59227b28a82646b9faba35f9261d855ca95def960ee0a"
        },
        "downloads": 169,
        "filename": "briefkasten-0.2.12.zip",
        "has_sig": false,
        "md5_digest": "4fa1f9a9ebdd6a701f3695084fa7a171",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283665,
        "upload_time": "2016-06-14T09:20:46",
        "url": "https://files.pythonhosted.org/packages/8b/25/5ee42a8228aa78a47a3008882db9c8b0285dc570b92ce5175465a92f9016/briefkasten-0.2.12.zip"
      }
    ],
    "0.2.13": [
      {
        "comment_text": "",
        "digests": {
          "md5": "763cc8db1886bab946b64bc2f667d2bc",
          "sha256": "9c7b461690ef55f2bde9e4c48c54db827720c4e05c169dd5317be7dfb0578d15"
        },
        "downloads": 168,
        "filename": "briefkasten-0.2.13.zip",
        "has_sig": false,
        "md5_digest": "763cc8db1886bab946b64bc2f667d2bc",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283666,
        "upload_time": "2016-06-14T12:55:39",
        "url": "https://files.pythonhosted.org/packages/47/cd/e2deb475b01132626bc7432a3c93e7724b97ce78c29464c61ddc027f1b1c/briefkasten-0.2.13.zip"
      }
    ],
    "0.2.14": [
      {
        "comment_text": "",
        "digests": {
          "md5": "f88353f86c91cdffc3c8afd6fa55a5e0",
          "sha256": "4bca38bf418ac8aad9062f03850bdc3f02bf4b649beeae6f74c07ba61da5e138"
        },
        "downloads": 180,
        "filename": "briefkasten-0.2.14.zip",
        "has_sig": false,
        "md5_digest": "f88353f86c91cdffc3c8afd6fa55a5e0",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283712,
        "upload_time": "2016-06-15T11:56:34",
        "url": "https://files.pythonhosted.org/packages/60/03/cec4afaa0196e572fd04cca7568741a4d623c85d44672fc0f3fcbe78b4b6/briefkasten-0.2.14.zip"
      }
    ],
    "0.2.15": [
      {
        "comment_text": "",
        "digests": {
          "md5": "0394c5574d8724b8230efeef0bf68af3",
          "sha256": "0c6991dbd59224dc8fc20a1a1059d5747b9ff5f31c8b26f4d62cfe439cdd6bc8"
        },
        "downloads": 226,
        "filename": "briefkasten-0.2.15.zip",
        "has_sig": false,
        "md5_digest": "0394c5574d8724b8230efeef0bf68af3",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 331540,
        "upload_time": "2016-09-01T14:57:01",
        "url": "https://files.pythonhosted.org/packages/dd/f1/3cd28959b14e24119a8455a4d5eb6c6dcd1cdc4f9f645a8df221082ed8cc/briefkasten-0.2.15.zip"
      }
    ],
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "7e57c16f20168f0c07e7aed30bec2cc2",
          "sha256": "552fe0bc5f0f08828af4ae67f9f48546f600d4bb56e26b5aeab12ec9e840de15"
        },
        "downloads": 318,
        "filename": "briefkasten-0.2.3.zip",
        "has_sig": false,
        "md5_digest": "7e57c16f20168f0c07e7aed30bec2cc2",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 278878,
        "upload_time": "2016-01-25T01:51:22",
        "url": "https://files.pythonhosted.org/packages/2a/11/aa03b511dbe49c328c78465bb124884ae780336bbc41e61311bf06356a58/briefkasten-0.2.3.zip"
      }
    ],
    "0.2.4": [
      {
        "comment_text": "",
        "digests": {
          "md5": "0c34e65d65ce061a4421168c29d4de3e",
          "sha256": "735199de0b3955e4511eaec6cb2b7a58ae89ccba1170370d94fbf2f9c386e384"
        },
        "downloads": 287,
        "filename": "briefkasten-0.2.4.zip",
        "has_sig": false,
        "md5_digest": "0c34e65d65ce061a4421168c29d4de3e",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 280668,
        "upload_time": "2016-01-29T13:53:02",
        "url": "https://files.pythonhosted.org/packages/15/f3/b5a7e8e53d24349ea8755584a97339d2e79a1896eca0b2152f8b254fb8a1/briefkasten-0.2.4.zip"
      }
    ],
    "0.2.5": [
      {
        "comment_text": "",
        "digests": {
          "md5": "5953284e482cb65572f465f5c495227f",
          "sha256": "4078838f99db2f38a493cac526bae5357d2b8e23a443c3b79c9f466f7f3589d3"
        },
        "downloads": 172,
        "filename": "briefkasten-0.2.5.zip",
        "has_sig": false,
        "md5_digest": "5953284e482cb65572f465f5c495227f",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 282127,
        "upload_time": "2016-02-10T16:32:29",
        "url": "https://files.pythonhosted.org/packages/33/63/503e9734866de513719df0e3c058d50ec41ff57240ba5705fab5fd42020b/briefkasten-0.2.5.zip"
      }
    ],
    "0.2.7": [
      {
        "comment_text": "",
        "digests": {
          "md5": "a7e9e029d202f19806244620a3dc6db6",
          "sha256": "082f1f285bbbe27392c5a851366f6d1dba645e33861b4b5babc88c82392738fe"
        },
        "downloads": 158,
        "filename": "briefkasten-0.2.7.zip",
        "has_sig": false,
        "md5_digest": "a7e9e029d202f19806244620a3dc6db6",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283890,
        "upload_time": "2016-02-18T15:56:39",
        "url": "https://files.pythonhosted.org/packages/bf/2e/6c933065b80baac5ef0ee2eaa838d3b3dd81de67a04779f89f4f520ee1e7/briefkasten-0.2.7.zip"
      }
    ],
    "0.2.8": [
      {
        "comment_text": "",
        "digests": {
          "md5": "f8227b6300623311cd34a458760aa4b5",
          "sha256": "3b5efae5204499642f36ac25e9bb1e2d10d0ec365da063c671cc4057bcd5e13b"
        },
        "downloads": 176,
        "filename": "briefkasten-0.2.8.zip",
        "has_sig": false,
        "md5_digest": "f8227b6300623311cd34a458760aa4b5",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283938,
        "upload_time": "2016-02-24T10:58:02",
        "url": "https://files.pythonhosted.org/packages/5b/69/e044057ecdec6e40baa5055b9b7bcfefb9c84838f744d1a067046e512a58/briefkasten-0.2.8.zip"
      }
    ],
    "0.2.9": [
      {
        "comment_text": "",
        "digests": {
          "md5": "a670a00631d5618415f76d17e1d10104",
          "sha256": "b5540f506c615d7269064bc56739d39659e89c22aa2bb6b266b681055b42de18"
        },
        "downloads": 159,
        "filename": "briefkasten-0.2.9.zip",
        "has_sig": false,
        "md5_digest": "a670a00631d5618415f76d17e1d10104",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 283939,
        "upload_time": "2016-02-29T14:59:36",
        "url": "https://files.pythonhosted.org/packages/31/87/2a0f618bf8ca3c263b1019a59eacfa3634a2aad1ef48e477de614362324b/briefkasten-0.2.9.zip"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "0394c5574d8724b8230efeef0bf68af3",
        "sha256": "0c6991dbd59224dc8fc20a1a1059d5747b9ff5f31c8b26f4d62cfe439cdd6bc8"
      },
      "downloads": 226,
      "filename": "briefkasten-0.2.15.zip",
      "has_sig": false,
      "md5_digest": "0394c5574d8724b8230efeef0bf68af3",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 331540,
      "upload_time": "2016-09-01T14:57:01",
      "url": "https://files.pythonhosted.org/packages/dd/f1/3cd28959b14e24119a8455a4d5eb6c6dcd1cdc4f9f645a8df221082ed8cc/briefkasten-0.2.15.zip"
    }
  ]
}