{
  "info": {
    "author": "Joniuz",
    "author_email": "",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "Clash Royale Hack - Free Gems Generator For Android and iOS [Cheat Tool 2018 - No Survey]\n---\n\nClash Royale Hack Free Gems Generator is an online gems generator that was release by our team this week. Go now to our CLASH ROYALE HACK TOOL  to start generate free unlimited gems to your account. Our clash royale gems generator work very well in Android, iOS and Windows devices phones. Did you ever asked how big players grow so fast? Than you have the answer here: they all use our clash of clans hack and they generate every day unlimited free gems. We decided to make this clash of clans cheat to save your money, to not buy gems anymore. What are you waiting for? Start using our clash of clans free gems hack right now! \nFollow all the instructions from our website if you want to work perfectly!\n\n\nAccess the generator by clicking here --->   https://goo.gl/23CKh9\n\n\nClash Royale Gem Hack - Clash Royale Gem ... Clash Royale Gem Hack [2018 WORKING] 2018 Unlimited Free Resources and Coins ... Clash Royale Gem Hack [2018 WORKING] 2018 Unlimited Free Telecharger [ Unlimited ...Clash Royale Gem hack Android iOS no root... {Online} Clash Royale Gem hack Resources free 898989 ... Clash Royale Gem hack,Cheats tips and tricks Clash Royale Gem Unlimited Resources Resources Coins Cheats .. Clash Royale Gem Apk v1.4.0 Mod ( Unlimited Resources/Coins ...Clash Royale Gem Hack [2018 WORKING] 2018 Unlimited Free Tool [2018 WORKING] - apps Cheats Clash Royale Gem Mod Apk (Endless Resources+Coins) Clash Royale Gem Hack Resources Coins Cheats [Online 2018 ... Clash Royale Gem MOD APK ( Unlimited Resources, Coins ... Clash Royale Gem Hack [2018 WORKING] 2018 Unlimited Free key\n\n\nClash Royale Hack - Free Gems Generator For Android and iOS [Cheat Tool 2018 - No Survey]\n\n- Unlimited Resources, Unlimited Coins.\n- Gain an advantage within the app.\n- Regular script updates.\n- Tested and undetectable.\n- No download needed.\n- 24/7 online access.\n\nClash Royale Gem Hack Features and Information:\n\n!? Resources Online-Generator [2018 WORKING] !? Coins Online-Generator [2018 WORKING] !? Easy to use friendly interface !? Automatic updates to ensure the hack is working. !? Tested by many people. And a lot of creators of hacks. !? No root or jailbreak required. !? Undetectable: Anti-Ban system and Proxy for safety !? Works on Android phones and tablets, and on iOS Devices including iPhone, iPad, iPad Mini, and iPod Touch.\n\nClash Royale Gem hack,Cheats tips and tricks\n\nThis app is actually amazing! Our programmers they started out their work on the mobile devices to help eCoinsand understand the needs of the users. It truly is an incredible event, we could self-confident that the overall app cheat you will land to your flavor. Check the Clash Royale Gem hack and revel in the app at the best level now! Our online Tool [2018 WORKING] works together with Android and iOS devices. You don\"t have to have root or jailbreak to use our Online-Generator [2018 WORKING].\n\nExtra Tags:\n\nclash royale cheat, clash royale hack, clash royale gems, clash royale free gems, clash royale hack ios, clash royale hack android, clash royale generator, clash royale cheats, clash royale cheat codes, clash royale cheaters, clash royale cheat apk, clash royale chest tracker, clash royale hack app, clash royale hack chest, clash royale hack game, clash royale hack legendary, clash royale hack version, clash royale hack download, clash royale hack 2018, clash royale hack gems, Clash Royale Gem android, Clash Royale Gem iphone, Clash Royale Gem ios, Clash Royale Gem android hack, Clash Royale Gem ios hack, Clash Royale Gem iphone hack, Clash Royale Gem free android hack, Clash Royale Gem free ios hack, Clash Royale Gem free iphone hack, Clash Royale Gem android hack download, Clash Royale Gem iphone hack download, Clash Royale Gem ios hack download, Clash Royale Gem apk, Clash Royale Gem apk hack, Clash Royale Gem ipa hack, Clash Royale Gem apk hack download, Clash Royale Gem ipa, Clash Royale Gem apk hack download, Clash Royale Gem android cheat, Clash Royale Gem ios cheat, Clash Royale Gem Codes, Clash Royale Gem iphone cheat\n\nThis entry was posted in Clash Royale Gem Cheats and tagged in download Clash Royale Gem hack, free Clash Royale Gem download, free Clash Royale Gem hack, how to hack Clash Royale Gem, new Clash Royale Gem Cheats, new Clash Royale Gem hack, online hack for Clash Royale Gem, Clash Royale Gem, Clash Royale Gem 2018 Cheats, Clash Royale Gem bot, Clash Royale Gem cheat, Clash Royale Gem cheat engine, Clash Royale Gem cheat Tool [2018 WORKING], Clash Royale Gem Cheats, Clash Royale Gem free download, Clash Royale Gem free hack, Clash Royale Gem free hacking, Clash Royale Gem hack, Clash Royale Gem hack 2018, Clash Royale Gem hack no survey, Clash Royale Gem hack Tool [2018 WORKING], Clash Royale Gem hacks, Clash Royale Gem how to hack, Clash Royale Gem iphone hack, Clash Royale Gem Online-Generator [2018 WORKING], Clash Royale Gem online hack\n\nClash Royale Gem Hack Features and Information:\n\nHello everyone, we just released new Clash Royale Gem Hack which will give you Unlimited Resources. You dont need to download anything since this is an online version, so all you have to do is click Online Hack button and your Clash Royale Gem Hack is ready to use! Clash Royale Gem Cheats are 100% safe. We made sure that Cheats for Clash Royale Gem work great on all Android and iOS devices. Also, its important to mention that you dont need to root your Android device or jailbreak your iOS device. Clash Royale Gem Online Hack has been tested on hundreds of Android and iOS devices and it worked perfect every single time! Another thing that makes our Clash Royale Gem Hack the best is that its really easy to use  you can Unlimited Resources. Also, you can use our hack for Unlimited amount of times! If you dont know how to use it, you will be able to read detailed instructions later on in this post! Have fun!\n\nClash Royale Gem hack tool Clash Royale Gem hack tool apk Clash Royale Gem hack tool apk apps Clash Royale Gem hack tool apk download Clash Royale Gem hack tool apk downloader Clash Royale Gem hack tool apk downloads Clash Royale Gem hack tool apk file Clash Royale Gem hack tool apk free Clash Royale Gem hack tool apk apps Clash Royale Gem hack tool apk installer Clash Royale Gem hack tool apk mania Clash Royale Gem hack tool apk no survey Clash Royale Gem hack tool apktops Clash Royale Gem hack tool download Clash Royale Gem hack tool download free Clash Royale Gem hack tool download no survey Clash Royale Gem hack tool for ios Clash Royale Gem hack tool no survey Clash Royale Gem hack tool no survey android Clash Royale Gem hack tool no survey no password Clash Royale Gem hack tool no survey online Clash Royale Gem hack tool online Clash Royale Gem hack tool password Clash Royale Gem hack tool passwords Clash Royale Gem hack tool rar Clash Royale Gem Codes, Clash Royale Gem hack tool rar password Clash Royale Gem hack tool rare Clash Royale Gem hack tool rarities Clash Royale Gem hack torrent Clash Royale Gem hack torrent download Clash Royale Gem hacks and Cheats and keygen Clash Royale Gem hacks cheat Clash Royale Gem hacks Cheats Coins\n\nHow To Get Ahead Using Our Online Tool [2018 WORKING]?\n\nSo what we found is the users get stuck at certain levels or needs a push back to get things moving. Using our Clash Royale Gem Hack Tool [2018 WORKING] solves this problem. Yes its cheating but hey, when your stuck your stuck and getting stuck at the same level is really annoying. Now it wont take long before you look around and find a bunch of videos on Clash Royale Gem that claim that this Tool [2018 WORKING] does this and that Tool [2018 WORKING] does that only to find that they dont work. The app is evolving all the time and many of the Tool [2018 WORKING]s that used to work simply do not work any longer.\n\n'Clash Royale Gem Hack' | 'Clash Royale Gem Cheats' | app Online-Generator [2018 WORKING] No Survey Details\n\nSystem- It works on all like Android, iOS, Windows, iPhones, iPads , iPods, iPad Mini, etc,. Anti-Ban Protection 100% Working And Undetectable 'Clash Royale Gem Hack' | 'Clash Royale Gem Cheats' | app Online-Generator [2018 WORKING] No Survey\n\nHack-Tool [2018 WORKING] 2018 Unlimited Free Coins Works on all types of devices Android, iOS, iPhones, iPads, iPad Mini, iPad Touch Auto Update Feature Anti Ban Protection NO ROOT OR JAILBREAK REQUIRED Simple and Easy To Use User Interface Anonymous Feature How does the Best 'Clash Royale Gem Hack' | 'Clash Royale Gem Cheats' | app Online-Generator [2018 WORKING] No Survey Work?\n\nClash Royale Gem cheat free Resources Clash Royale Gem Resources and Coins Clash Royale Gem Coins Clash Royale Gem iOS Clash Royale Gem guide Clash Royale Gem Online-Generator [2018 WORKING] Clash Royale Gem Android Clash Royale Gem iPhone Clash Royale Gem ipad Resources Clash Royale Gem iPod Clash Royale Gem mobile Clash Royale Gem gratis Resources and Coins Clash Royale Gem hack Tool [2018 WORKING] Clash Royale Gem ios Clash Royale Gem free get Clash Royale Gem hack Clash Royale Gem Cheats Clash Royale Gem get Clash Royale Gem Free android hack Clash Royale Gem Free Resources Cheats get Clash Royale Gem Free Cheats for Resources and Coins Clash Royale Gem Free Cheats free Clash Royale Gem Free Cheats Resources and Coins Clash Royale Gem Resources Clash Royale Gem Free hack ipad Clash Royale Gem Free hack Unlimited Resources and Coins Clash Royale Gem Triche Clash Royale Gem Triche Clash Royale Gem hack 2015 Clash Royale Gem hack 2015 android Clash Royale Gem hack 2015 cydia Coins Clash Royale Gem hack 2015 mac Clash Royale Gem hack android Clash Royale Gem hack android apk Clash Royale Gem hack Coins get Clash Royale Gem hack android no computer Clash Royale Gem hack android no root Clash Royale Gem hack android root Clash Royale Gem hack Coins Clash Royale Gem hack get Clash Royale Gem hack ios Clash Royale Gem hack iphone Clash Royale Gem hack may Clash Royale Gem hack no jailbreak Clash Royale Gem hack no surveys Clash Royale Gem hack no surveys no password Clash Royale Gem hack Tool [2018 WORKING] free Clash Royale Gem Cheats free Clash Royale Gem Free hack Clash Royale Gem pirater télécharger Clash Royale Gem ilmainen lataa Clash Royale Gem hakata ladata Clash Royale Gem descargar Clash Royale Gem descarga gratuita Clash Royale Gem hackear descarga Clash Royale Gem geten Clash Royale Gem gratis te geten Clash Royale Gem hack geten Clash Royale Gem kostenloser get Clash Royale Gem Coins and Resources Online-Generator [2018 WORKING] Clash Royale Gem Coins Free Clash Royale Gem laste Clash Royale Gem gratis nedlasting Clash Royale Gem hacke laste ned Clash Royale Gem baixar Clash Royale Gem get gratuito Clash Royale Gem hackear Triche Clash Royale Gem ladda Clash Royale Gem gratis nedladdning Clash Royale Gem hacka ladda Clash Royale Gem caricare Clash Royale Gem get gratuito Clash Royale Gem hack scaricare Clash Royale Gem turun Clash Royale Gem menggodam turun Clash Royale Gem code generator Clash Royale Gem generator Clash Royale Gem generator 2013 rar Clash Royale Gem generator 2014 Clash Royale Gem generator 2014 mega Clash Royale Gem generator 2014.rar Clash Royale Gem generator 2015 Clash Royale Gem generator 2015 download Clash Royale Gem generator 2015 mega Clash Royale Gem generator 2015 no survey Clash Royale Gem generator 2015 v2.2 Clash Royale Gem generator 2015 v2.2.rar Clash Royale Gem generator 2016 Clash Royale Gem generator 2016 download Clash Royale Gem generator 2016 mega Clash Royale Gem generator 2018 Clash Royale Gem generator 3.6 Clash Royale Gem generator android Clash Royale Gem generator apk Clash Royale Gem generator blogspot Clash Royale Gem generator by sk.txt Clash Royale Gem generator created by skidrow Clash Royale Gem generator descargar Clash Royale Gem generator download Clash Royale Gem generator download no survey Clash Royale Gem generator for mac Clash Royale Gem generator free Clash Royale Gem generator free download Clash Royale Gem generator full Clash Royale Gem generator gaming hax Clash Royale Gem generator gratis Clash Royale Gem generator hack Clash Royale Gem generator hack 2016 Clash Royale Gem generator january 2014.exe Clash Royale Gem generator jdownloader Clash Royale Gem generator mac Clash Royale Gem generator mega Clash Royale Gem generator no survey Clash Royale Gem generator password Clash Royale Gem generator password txt Clash Royale Gem generator rar Clash Royale Gem generator rar password Clash Royale Gem generator skidrow Clash Royale Gem generator v 12 Clash Royale Gem generator v.4 Clash Royale Gem generator v1.2 Clash Royale Gem generator v1.2 password Clash Royale Gem generator v12.rar Clash Royale Gem generator v2.rar Clash Royale Gem generator v3 6 download Clash Royale Gem generator v3.6 Clash Royale Gem generator v3.6 download Clash Royale Gem generator v3.6 password Clash Royale Gem generator v3.6 rar Clash Royale Gem generator v3.6 zip Clash Royale Gem generator v3.6.exe Clash Royale Gem generator v8.1.2 Clash Royale Gem generator v8.1.2.rar Clash Royale Gem generator.exe Clash Royale Gems generator v1.2 download Clash Royale Gems generator.zip password - Clash Royale Gem generator by sk.txt password for Clash Royale Gem generator Clash Royale Gemed apk Clash Royale Gemer show Clash Royale Gemed accounts Clash Royale Gemer movies Clash Royale Gem orange is the new black Clash Royale Gemathon Clash Royale Geming documentary Clash Royale Gems ps4 Clash Royale Gems buzzfeed Clash Royale Gem Clash Royale Gem apk Clash Royale Gem 2018 Clash Royale Gem day Clash Royale Gem show Clash Royale Gem free Clash Royale Gem for more movies Clash Royale Gem code Clash Royale Gem dark overlord Clash Royale Gem account Clash Royale Gem account 2018 Clash Royale Gem attack Clash Royale Gem app Clash Royale Gem australia Clash Royale Gem april 2018 Clash Royale Gem account 2015 Clash Royale Gem account free Clash Royale Gem apple tv is there a Clash Royale Gem get a hacked Clash Royale Gem account hack a Clash Royale Gem account hack a Clash Royale Gem hackear a Clash Royale Gem hackeando a Clash Royale Gem hackearon a Clash Royale Gem hackear a Clash Royale Gem 2015 hackear a Clash Royale Gem 2016 Clash Royale Gem bitcoin Clash Royale Gem buzzfeed Clash Royale Gem buffering Clash Royale Gem browser hack Clash Royale Gem browse hack boxeehack Clash Royale Gem Clash Royale Gem now tv box hack british Clash Royale Gem best Clash Royale Gem bd570 Clash Royale Gem Clash Royale Gem cydia Clash Royale Gem cookie Clash Royale Gem categories Clash Royale Gem canada Clash Royale Gem.com Clash Royale Gem country Clash Royale Gem cosmo Clash Royale Gem computer Clash Royale Gem crack Clash Royale Gem download Clash Royale Gem download no survey Clash Royale Gem dns Clash Royale Gem daily mail Clash Royale Gem documentary Clash Royale Gem different countries Clash Royale Gem day nintendo Clash Royale Gem deutsch Clash Royale Gem edit this cookie Clash Royale Gem europe Clash Royale Gem elle hack Clash Royale Gem email and password Clash Royale Gem email hack Clash Royale Gem streaming europe hack esquire Clash Royale Gem Clash Royale Gem extender hack Clash Royale Gem español hack Clash Royale Gem enero 2015 Clash Royale Gem free account Clash Royale Gem for android Clash Royale Gem for ios Clash Royale Gem free download Clash Royale Gem for iphone hackforums Clash Royale Gem Clash Royale Gem for now tv Clash Royale Gem for apple tv Clash Royale Gem genre Clash Royale Gem generator Clash Royale Gem genre list Clash Royale Gem google chrome Clash Royale Gem god mode Clash Royale Gem gratis Clash Royale Gem gratuit Clash Royale Gem hack hackforums Clash Royale Gem gmail hack Clash Royale Gem gogo hack Clash Royale Gem hola Clash Royale Gem hue Clash Royale Gem hln Clash Royale Gem hdcp hack Clash Royale Gem hd hack android Clash Royale Gem horror hack hack Clash Royale Gem rl hackers Clash Royale Gem ios\n\nNow Clash Royale Gem is Clash Royale Gem's premium service you can see they have ads for it all over the place and basically it gives you some exclusive shows if you go to Clash Royale Gem.com/red you can kind of see what it's all about. You get some original shows, you get google play music, all sorts of that stuff but then it does cost money. Its like 10 bucks a month so I mean I think it's worth it but some people don't want to pay so they just want it free so I guess that's who thit is for so this should also work if you already have free Clash Royale Gem but it doesn't really matter so anyway.\n\nIf we go to the settings you know we can see it says account type says Clash Royale Gem is done\n\nclash royale hack.org\nclash royale hack apk\nclash royale hack app\nclash royale hack gems\nclash royale hack 2017\nclash royale hack download ios\nclash royale hack generator\nclash royale hack ios\nclash royale hacked server\nclash royale hacks legit\nclash royale hack\nclash royale hack org\nclash royale hack online\nclash royale hack free gems\nclash royale hack apk ios\nclash royale hack apk download ios\nclash royale hack apk 2.1.7\nclash royale hack apk 2017\nclash royale hack app ios\nclash royale hack account\nclash royale hack ad\nclash royale hack apk 2.0.7\nis there a clash royale hack\nclash royale hack bluestacks\nclash royale hack bot\nclash royale hack battle\nclash royale hack by ihackedit\nclash royale hack b9\nclash royale hack blogspot\nclash royale hack by lucky patcher\nclash royale hack by sahad ikr\nclash royale hack by supercell\nclash royale hack by evil warriors\nclash royale hack cards\nclash royale hack codes\nclash royale hack cydia\nclash royale hack cheats\nclash royale hack chest\nclash royale hack cydia source\nclash royale hack computer\nclash royale hack cards legendary\nclash royale hack coins\nclash royale hack client\nclash royale hack download\nclash royale hack download apk\nclash royale hack download ios no jailbreak\nclash royale hack deck\nclash royale hack december 2017\nclash royale hack download pc\nclash royale hack dns code\nclash royale hack download ios apk\nclash royale hack download private server\nclash royale hack elixir\nclash royale hack easy\nclash royale hack easy verification\nclash royale hack easy way\nclash royale hack engine\nclash royale hack.exe\nclash royale hack es file explorer\nclash royale hack elitepvpers\nclash royale hack es file\nclash royale hack.exe file size 2.29 mb\nclash royale trucchi e hack\nclash royale hack for gems\nclash royale hack free\nclash royale hack for cards\nclash royale hack free download\nclash royale hack forum\nclash royale hack for gems no human verification\nclash royale hack fake\nclash royale hack for iphone\nclash royale hack for gems and gold\nclash royale hack game\nclash royale hack gems no survey\nclash royale hack generator no human verification\nclash royale hack gems and coins\nclash royale hack gem generator\nclash royale hack get unlimited gems\nclash royale hack gold\nclash royale hack gems and gold\nclash royale hack human verification\nclash royale hack how to get free gems\nclash royale hack how to get legendaries\nclash royale hack - how to get unlimited gems\nclash royale how hack\nclash royale hack no human verification\nclash royale hack without human verification\nclash royale hack no human verification or survey\nclash royale hack game hacker\nclash royale hack without human verify\nclash royale hack ipa\nclash royale hack ios download\nclash royale hack ios apk\nclash royale hack iosgods\nclash royale hack ios no human verification\nclash royale hack ios app\nclash royale hack ipad\nclash royale hack ios gamesave\nclash royale hack ios 11\nclash royale hack juwelen\nclash royale hack jailbreak\nclash royale hack jeuxvideo\nclash royale hack jailbreak 2017\nclash royale hack jalan tikus\nclash royale jailbreak hack cydia\nclash royale jailbreak hack ifile\nclash royale hack no jailbreak\nclash royale hack ios jailbreak\nclash royale hack kaise kare\nclash royale hack kickass\nclash royale hack kaskus\nclash royale hack game killer\nclash royale hack using game killer\nhack kartu clash royale\nclash royale gems hack kostenlos\nclash royale karten hack\nclash royale kupa hack\nkostenloser clash royale hack\nclash royale hack legit\nclash royale hack link\nclash royale hack latest version\nclash royale hack legendary\nclash royale hack legendary card\nclash royale hack legendary chest\nclash royale hack lucky patcher\nclash royale hack latest\nclash royale hack latest version apk\nclash royale hack latest version for android\nclash royale hack mod\nclash royale hack mod apk 2017\nclash royale hack mod apk 1.9.2\nclash royale hack mod sof\nclash royale hack mod apk indir\nclash royale hack mod apk 1.2.3\nclash royale hack mod apk android 1\nclash royale hack money and gems\nclash royale hack mob.org\nclash royale hack me\nclash royale hack no survey\nclash royale hack net\nclash royale hack november 2017\nclash royale hack no human verification android\nclash royale hack no human verification 2018\nclash royale hack no root\nclash royale hack no robot verification\nclash royale hack no human verification needed\nclash royale hack online generator\nclash royale hack online generator no survey\nclash royale hack offline\nclash royale hack on pc\nclash royale hack october 2017\nclash royale hack on tutuapp\nclash royale hack on android\nclash royale hack on ios\ncomo hacker o clash royale\no melhor hack para clash royale\nhack para o clash royale\nclash royale hack private server\nclash royale hack pc\nclash royale hack private server ios\nclash royale hack pro\nclash royale hack private server apk\nclash royale hack player id\nclash royale hack pc download\nclash royale hack play\nclash royale hack play online\nclash royale hack possible\nclash royale hack reddit\nclash royale hack real\nclash royale hack root",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "",
    "keywords": "clash royale hack",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "clash-royale-hacks",
    "platform": "",
    "project_url": "https://pypi.org/project/clash-royale-hacks/",
    "release_url": "https://pypi.org/project/clash-royale-hacks/0.0.0/",
    "requires_dist": [],
    "requires_python": "",
    "summary": "desc",
    "version": "0.0.0"
  },
  "releases": {
    "0.0.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "9b56e04ef24c19956c0a79f9bbf0f827",
          "sha256": "66b875c76ed35e9e2d24248ccfb1deb9f13eea3d0dd461740bb05a2ab687fdd6"
        },
        "downloads": -1,
        "filename": "clash-royale-hacks-0.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "9b56e04ef24c19956c0a79f9bbf0f827",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 9037,
        "upload_time": "2018-02-05T19:51:08",
        "url": "https://files.pythonhosted.org/packages/d4/e3/731c6ab0a4280ed001e3383a73e82a24e4b452f10d5a47bacefbfc7a445d/clash-royale-hacks-0.0.0.tar.gz"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "9b56e04ef24c19956c0a79f9bbf0f827",
        "sha256": "66b875c76ed35e9e2d24248ccfb1deb9f13eea3d0dd461740bb05a2ab687fdd6"
      },
      "downloads": -1,
      "filename": "clash-royale-hacks-0.0.0.tar.gz",
      "has_sig": false,
      "md5_digest": "9b56e04ef24c19956c0a79f9bbf0f827",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 9037,
      "upload_time": "2018-02-05T19:51:08",
      "url": "https://files.pythonhosted.org/packages/d4/e3/731c6ab0a4280ed001e3383a73e82a24e4b452f10d5a47bacefbfc7a445d/clash-royale-hacks-0.0.0.tar.gz"
    }
  ]
}