{
  "info": {
    "author": "Luca Pinello",
    "author_email": "lpinello@jimmy.harvard.edu",
    "bugtrack_url": "",
    "classifiers": [
      "Development Status :: 4 - Beta",
      "Environment :: Console",
      "Intended Audience :: Developers",
      "Intended Audience :: Science/Research",
      "License :: OSI Approved :: BSD License",
      "Operating System :: MacOS :: MacOS X",
      "Operating System :: POSIX",
      "Programming Language :: Python",
      "Topic :: Scientific/Engineering :: Bio-Informatics"
    ],
    "description": ".. image:: https://github.com/lucapinello/CRISPResso/blob/master/CRISPResso.png?raw=true\n\n\nCRISPResso is a software pipeline for the analysis of targeted CRISPR-Cas9 sequencing data. This algorithm allows for the quantification of both non-homologous end joining (NHEJ) and homologous directed repair (HDR) occurrences.\n\n\nCRISPResso automatizes and performs the following steps summarized in the figure below: \n\n1) filters low quality reads, \n2) trims adapters, \n3) aligns the reads to a reference amplicon, \n4) quantifies the proportion of HDR and NHEJ outcomes, \n5) quantifies frameshift/inframe mutations (if applicable) and identifies affected splice sites,\n6) produces a graphical report to visualize and quantify the indels distribution and position.\n\n.. image:: https://github.com/lucapinello/CRISPResso/blob/master/CRISPResso_pipeline.png?raw=true\n\n\nThe CRISPResso suite accommodates single or pooled amplicon deep sequencing, WGS datasets and allows the direct comparison of individual experiments. In fact four additional utilities are provided:\n\n1) **CRISPRessoPooled**: a tool for the analysis of pooled amplicon experiments \n2) **CRISPRessoWGS**: a tool for the analysis of WGS data or prealigned reads in .bam format\n3) **CRISPRessoCompare**:a tool for the comparison of two CRISPResso analyses, useful for example to compare treated and untreated samples or to compare different experimental conditions \n4) **CRISPRessoPooledCompare**: a tool to compare experiments involving several regions analyzed by either CRISPRessoPooled or CRISPRessoWGS \n\n\nTRY IT ONLINE! \n--------------\nIf you don't like command line tools you can also use CRISPResso online here:  http://crispresso.rocks\n\n\nInstallation and Requirements\n-----------------------------\n\nTo install the command line version of CRISPResso, some dependencies must be installed before running the setup:\n\n1) Python 2.7 Anaconda:  http://continuum.io/downloads\n2) Java: http://java.com/download\n3) C compiler / make. For Mac with OSX 10.7 or greater, open the terminal app and type and execute the command 'make', which will trigger the installation of OSX developer tools.Windows systems are not officially supported, although CRISPResso may work with Cygwin (https://www.cygwin.com/).\n\nAfter checking that the required software is installed you can install CRISPResso from the official Python repository following these steps:\n\n1) Open a terminal window\n2) Type the command: \n\n.. code:: bash\n\n        pip install CRISPResso  --no-use-wheel --verbose\n      \n3) Close the terminal window \n\nAlternatively if want to install the package without the PIP utility:\n\n1) Download the setup file: https://github.com/lucapinello/CRISPResso/archive/master.zip and decompress it  \n2) Open a terminal window  and go to the folder where you have decompressed the zip file\n3) Type the command: python setup.py install\n4) Close the terminal window and open a new one  (this is important in order to setup correctly the PATH variable in your system).\n\nThe Setup will try to install these software for you:\n\n1) Trimmomatic(tested with v0.33): http://www.usadellab.org/cms/?page=trimmomatic\n2) Flash(tested with v1.2.11): http://ccb.jhu.edu/software/FLASH/\n3) Needle from the EMBOSS suite(tested with 6.6.0): ftp://emboss.open-bio.org/pub/EMBOSS/\n\nIf the setup fails on your machine you have to install them manually and put these utilities/binary files in your path!\n\nTo check that the installation worked, open a terminal window and execute CRISPResso --help, you should see the help page.\n\nThe setup will automatically create a folder in your home folder called CRISPResso_dependencies (if this folder is deleted, CRISPResso will not work!)! If you want to put the folder in a different location, you need to set the environment variable: CRISPRESSO_DEPENDENCIES_FOLDER. For example to put the folder in /home/lpinello/other_stuff you can write in the terminal *BEFORE* the installation:\n\n.. code:: bash\n        \n        export CRISPRESSO_DEPENDENCIES_FOLDER=/home/lpinello/other_stuff\n\n\nDocker Image\n------------\nIf you like Docker, we provide a Docker image ready to use, so no installation is required!\n\t\n\thttps://hub.docker.com/r/lucapinello/crispresso/\n\nTo use the image first install Docker: https://docs.docker.com/engine/installation/\n\nThen type the command:\n\n\tdocker pull lucapinello/crispresso\n\nSee an example on how to run CRISPResso from a Docker image in the section **TESTING CRISPResso** below.\n\nOUTPUT\n-----------\nThe output of CRISPResso consists of a set of informative graphs that allow for the quantification and visualization of the position and type of outcomes within an amplicon sequence. An example is shown below:\n\n.. image:: https://github.com/lucapinello/CRISPResso/blob/master/CRISPResso_output.png?raw=true\n\n\nUsage\n-----\nCRISPResso requires two inputs: (1) paired-end reads (two files) or single-end reads (single file) in .fastq format (fastq.gz files are also accepted) from a deep sequencing experiment and (2) a reference amplicon sequence to assess and quantify the efficiency of the targeted mutagenesis. The amplicon sequence expected after HDR can be provided as an optional input to assess HDR frequency. One or more sgRNA sequences (without PAM sequences) can be provided to compare the predicted cleavage position/s to the position of the observed mutations. Coding sequence/s may be provided to quantify frameshift and potential splice site mutations. \n\nThe reads are first filtered based on the quality score (phred33) in order to remove potentially false positive indels. The filtering based on the phred33 quality score can be modulated by adjusting the optimal parameters (see additional notes below). The adapters are trimmed from the reads using Trimmomatic and then sequences are merged with FLASha (if using paired-end data).The remaining reads are then aligned with needle from the EMBOSS suite, an optimal global sequence aligner based on the Needleman-Wunsch algorithm that can easily accounts for gaps. Finally, after analyzing the aligned reads, a set of informative graphs are generated, allowing for the quantification and visualization of the position and type of outcomes within the amplicon sequence.\n\nNHEJ events:\n\nThe required inputs are: \n\n- Two files for paired-end reads or a single file for single-end reads in fastq format (fastq.gz files are also accepted). The reads are assumed to be already trimmed for adapters. If reads are not trimmed, please use the   --trim_sequences option and the   --trimmomatic_options_string  if you are using an adapter different than Nextera. \n- The reference amplicon sequence must also be provided.\n\nExample:\n\n.. code:: bash\n\n                        CRISPResso -r1 reads1.fastq.gz -r2 reads2.fastq.gz -a AATGTCCCCCAATGGGAAGTTCATCTGGCACTGCCCACAGGTGAGGAGGTCATGATCCCCTTCTGGAGCTCCCAACGGGCCGTGGTCTGGTTCATCATCTGTAAGAATGGCTTCAAGAGGCTCGGCTGTGGTT\n\nHDR events:\nThe required inputs are: \n\n- Two files for paired-end reads or a single file for single-end reads in fastq format (fastq.gz files are also accepted). The reads are assumed to be already trimmed for adapters.\n- The reference amplicon sequence.\n- The expected amplicon sequence after HDR must also be provided.\n\nExample:\n\n.. code:: bash\n\n                        CRISPResso -r1 reads1.fastq.gz -r2 reads2.fastq.gz -a GCTTACACTTGCTTCTGACACAACTGTGTTCACGAGCAACCTCAAACAGACACCATGGTGCATCTGACTCCTGAGGAGAAGAATGCCGTCACCACCCTGTGGGGCAAGGTGAACGTGGATGAAGTTGGTGGTGAGGCCCTGGGCAGGTTGGTATCAAGGTTACAAGA -e GCTTACACTTGCTTCTGACACAACTGTGTTCACGAGCAACCTCAAACAGACACCATGGTGCATCTGACTCCTGTGGAAAAAAACGCCGTCACGACGTTATGGGGCAAGGTGAACGTGGATGAAGTTGGTGGTGAGGCCCTGGGCAGGTTGGTATCAAGGTTACAAGA\n                        \nIMPORTANT: You must input the entire reference amplicon sequence (’Expected HDR Amplicon sequence’ is the reference for the sequenced amplicon, not simply the donor sequence).  If only the donor sequence is provided, an error will result\n\nUnderstanding the parameters of CRISPResso\n------------------------------------------\n\nRequired parameters\n To run CRISPResso, only 2 parameters are required for single end reads, or 3 for paired end reads:\n\n-r1 or --fastq_r1: This parameter allows for the specification of the first fastq file.\n \n-r2 or  --fastq_r2 FASTQ_R2: This parameter allows for the specification of the second fastq file for paired end reads.\n\n-a or --amplicon_seq: This parameter allows the user to enter the amplicon sequence used for the experiment.\n\nOptional parameters\n In addition to the required parameters explained in the previous section, several optional parameters can be adjusted to tweak your analysis, and to ensure CRISPResso analyzes your data in the best possible way.\n \n-g or --guide_seq or: This parameter allows for the specification of the sgRNA sequence. If more than one sequence are included, please separate by comma/s. If the guide RNA sequence is entered, then the position of the guide RNA and the cleavage site will be indicated on the output analysis plots. Note that the sgRNA needs to be input as the guide RNA sequence (usually 20 nt) immediately 5' of the PAM sequence (usually NGG for SpCas9). If the PAM is found on the opposite strand with respect to the Amplicon Sequence, ensure the sgRNA sequence is also found on the opposite strand. The CRISPResso convention is to depict the expected cleavage position using the value of the parameter cleavage_offset nt 3' from the end of the guide. In addition, the use of alternate nucleases to SpCas9 is supported. For example, if using the Cpf1 system, enter the sequence (usually 20 nt) immediately 3' of the PAM sequence and explicitly set the cleavage_offset parameter to 1, since the default setting of -3 is suitable only for SpCas9. (default:None)\n\n-e or --expected_hdr_amplicon_seq: This parameter allows for the specification of the amplicon sequence expected after HDR. If the data to be analyzed were derived from an experiment using a donor repair template for homology-directed repair (HDR for short), then you have the option to input the sequence of the expected HDR amplicon. This sequence is necessary for CRISPResso to be able to identify successful HDR events within the sequencing data.\n \n--hdr_perfect_alignment_threshold: Sequence homology percentage for an HDR occurrence (default: 98.0). This parameter allows for the user to set a threshold for sequence homology for CRISPResso to count instances of successful HDR. This is useful to improve the analysis allowing some tolerance for technical artifacts present in the sequencing data such as sequencing errors or single nucleotide polymorphisms (SNPs) in the cells used in the experiment. Therefore, if you have a read that exhibits successful HDR but has a SNP or sequencing error within the amplicon, you can lower the sequence homology in order allow CRISPResso to count the read as a successful HDR event. If the data are completely free of sequencing errors or polymorphisms, then consider to set parameter to 100.\n\n-d or -donor_seq:This parameter allows the user to highlight the critical subsequence of the expected HDR amplicon in plots. This parameter does not have any effect on the quantification of HDR events.\n \n-c, --coding_seq:This parameter allows for the specification of the subsequence/s of the amplicon sequence covering one or more coding sequences for the frameshift analysis. If more than one (for example, split by intron/s), please separate by comma. (default: None)\n\n-q, or --min_average_read_quality: This parameter allows for the specification of the minimum average quality score (phred33) to include a read for the analysis.(default: 0, minimum: 0, maximum: 40). This parameter is helpful to filter out low quality reads. If filtering based on average base quality is desired, a reasonable value for this parameter is greater than 30.\n\n-s or --min_single_bp_quality: This parameter allows for the specification of the minimum single bp score (phred33) to include a read  for the analysis (default: 0, minimum: 0, maximum: 40). This parameter is helpful to filter out low quality reads. This filtering is more aggressive, since any read with a single bp below the threshold will be discarded. If you want to filter your reads based on single base quality to have very high quality reads, a reasonable value for this parameter is greater than 20.\n\n--min_identity_score: This parameter allows for the specification of the min identity score for the alignment (default: 60.0). In order for a read to be considered properly aligned, it should pass this threshold. We suggest to lower this threshold only if really large insertions or deletions are expected in the experiment (>40% of the amplicon length).\n\n-n or --name: This parameter allows for the specification of the output name of the report (default: the names is obtained from the filename of the fastq file/s used in input).\n\n-o or --output_folder: This parameter allows for the specification of the output folder to use for the analysis (default: current folder).\n\n--split_paired_end: Splits a single fastq file contating paired end reads in two files before running CRISPResso (default: False).\nIf you got your data from the MGH sequencing core in Boston (https://dnacore.mgh.harvard.edu/new-cgi-bin/site/pages/crispr_sequencing_main.jsp), you need this option!\n\n--trim_sequences: This parameter enables the trimming of Illumina adapters with Trimmomatic (default: False)\n\n--trimmomatic_options_string: This parameter allows the user the ability to override options for Trimmomatic (default: ILLUMINACLIP:/Users/luca/anaconda/lib/python2.7/site-packages/CRISPResso-0.8.0-py2.7.egg/CRISPResso/data/NexteraPE-PE.fa:0:90:10:0:true). This parameter is useful to specify different adaptor sequences used in the experiment if you need to trim them.\n\n--min_paired_end_reads_overlap: This parameter allows for the specification of the minimum required overlap length between two reads to provide a confident overlap during the merging step. (default: 4, minimum: 1, max: read length)\n\n--hide_mutations_outside_window_NHEJ: This parameter allows the user to visualize only the mutations overlapping the window around the cleavage site and  used to classify a read as NHEJ. This parameter has no effect on the quantification of NHEJ. With the default setting (False), all mutations are visualized including those that do not overlap the window, even though these are not used to classify a read as NHEJ. It may be desirable in certain cases to hide pre-existing and known mutations or sequencing errors outside the window and hence not used for quantification of NHEJ events (default: False).\n  \n-w ,--window_around_sgrna: This parameter allows for the specification of a window(s) in bp around each sgRNA to quantify the indels. The window is centered on the predicted cleavage site specified by each sgRNA. Any indels not overlapping or substitutions not adjacent to the window are excluded. A value of 0 will disable this filter (default: 1). This parameter is important since sequencing artifacts and/or SNPs can lead to false positives or false negatives in the quantification of indels and HDR occurrences. Therefore, the user can choose to create a window around the predicted double strand break site of the nuclease used in the experiment. This can help limit sequencing or amplification errors or non-editing polymorphisms from being inappropriately quantified in CRISPResso analysis. Note: any indels that fully or partially overlap the window will be quantified.\n\n\n--cleavage_offset: This parameter allows for the specification of the cleavage offset to use with respect to the provided sgRNA sequence. Remember that the sgRNA sequence must be entered without the PAM. The default is -3 and is suitable for the SpCas9 system. For alternate nucleases, other cleavage offsets may be appropriate, for example, if using Cpf1 set this parameter to 1. (default: -3, minimum:1, max: reference amplicon length). Note: any large indel that partially overlap the window will be also fully quantified.\n\n--exclude_bp_from_left: Exclude bp from the left side of the amplicon sequence for the quantification of the indels (default: 15). This parameter is helpful to avoid artifacts due to imperfect trimming of the reads.\n\n--exclude_bp_from_right: Exclude bp from the right side of the amplicon sequence for the quantification of the indels (default: 15). This parameter is helpful to avoid artifacts due to imperfect trimming of the reads.\n\n--ignore_substitutions: Ignore substitutions events for the quantification and visualization (default: False).\n \n--ignore_insertions: Ignore insertions events for the quantification and visualization (default: False).\n\n--ignore_deletions: Ignore deletions events for the quantification and visualization (default: False).\n\n--needle_options_string: This parameter allows the user to override options for the Needle aligner (default: -gapopen=10 -gapextend=0.5 -awidth3=5000). More information on the meaning of these parameters can be found in the needle documentation (http://embossgui.sourceforge.net/demo/manual/needle.html). We suggest that only experienced users modify these values.\n\n--keep_intermediate: This parameter allows the user to keep all the intermediate files (default: False). We suggest keeping this parameter disabled for most applications, since the intermediate files (processed reads and alignments) can be really large.\n\n--dump: This parameter allows to dump numpy arrays and pandas dataframes to file for debugging purposes (default: False). \n\n--save_also_png: This  parameter allows the user to  also save.png images when creating the report., in addition to .pdf files.\n\n-p, --n_processes \nSpecify the number of processes to use for the quantification.  This parameter is useful to speed up the quantification and generation of the mutation profiles when multiple CPUs are available. Please use with caution since increasing this parameter will increase significantly the memory required to run CRISPResso (default: 1). \n\n\nTroubleshooting:\n----------------\n\n- It is important to check if your reads are trimmed or not. CRISPResso assumes that the reads are already trimmed! If reads are not trimmed, use the option --trim_sequences. The default adapter file used is the Nextera. If you want to specify a custom adapter use the option --trimmomatic_options_string.\n- It is possible to use CRISPResso with single end reads. In this case, just omit the option -r2 to specify the second fastq file.\n- It is possible to filter based on read quality before aligning reads using the option -q. A reasonable value for this parameter (phred33) is 30.\n- The command line CRISPResso tool for use on Mac computers requires OS 10.7 or greater. It also requires that command line tools are installed on your machine. After the installation of Anaconda, open the Terminal app and type make, this should prompt you to install command line tools (requires internet connection).\n- Once installed, simply typing CRISPResso into any new terminal should load CRISPResso (you will be greeted by the CRISPResso cup)\n- Paired end sequencing files are assumed to contain overlapping sequences (at least 1 bp), if not run CRISPResso on each single fastq file of the pair in single mode. \n- Use the following command to get to your folder (directory) with sequencing files, assuming that is /home/lpinello/Desktop/CRISPResso_Folder/Sequencing_Files_Folder: cd /home/lpinello/Desktop/CRISPResso_Folder/Sequencing_Files_Folder\n- CRISPResso’s default setting is to output analysis files into your directory, otherwise use the --output parameter.\n\nTESTING CRISPResso\n------------------\n\n1) Download the two fastq files:\n\n- http://bcb.dfci.harvard.edu/~lpinello/CRISPResso/reads1.fastq.gz \n- http://bcb.dfci.harvard.edu/~lpinello/CRISPResso/reads2.fastq.gz\n\n2) Open a terminal and go to the folder where you have stored the files\n\n3) Type: \n\n.. code:: bash\n\n                        CRISPResso -r1 reads1.fastq.gz -r2 reads2.fastq.gz -a AATGTCCCCCAATGGGAAGTTCATCTGGCACTGCCCACAGGTGAGGAGGTCATGATCCCCTTCTGGAGCTCCCAACGGGCCGTGGTCTGGTTCATCATCTGTAAGAATGGCTTCAAGAGGCTCGGCTGTGGTT -g TGAACCAGACCACGGCCCGT \n\n4) CRISPResso will create a folder with the processed data and the figures.\n\n\nIf you use a Docker image instead run with the following command:\n\n.. code:: bash\n\n\tdocker run -v ${PWD}:/DATA -w /DATA  -i lucapinello/crispresso CRISPResso -r1 reads1.fastq.gz -r2 reads2.fastq.gz -a AATGTCCCCCAATGGGAAGTTCATCTGGCACTGCCCACAGGTGAGGAGGTCATGATCCCCTTCTGGAGCTCCCAACGGGCCGTGGTCTGGTTCATCATCTGTAAGAATGGCTTCAAGAGGCTCGGCTGTGGTT -g TGAACCAGACCACGGCCCGT\n\nIf you run Docker on Window you have to specify the full path:\n\n.. code:: bash\n\n        docker run -v //c/Users/luca/Downloads:/DATA -w /DATA lucapinello/crispresso CRISPResso -r1 reads1.fastq.gz -r2 reads2.fastq.gz -a AATGTCCCCCAATGGGAAGTTCATCTGGCACTGCCCACAGGTGAGGAGGTCATGATCCCCTTCTGGAGCTCCCAACGGGCCGTGGTCTGGTTCATCATCTGTAAGAATGGCTTCAAGAGGCTCGGCTGTGGTT -g TGAACCAGACCACGGCCCGT\n\n\nUseful tips\n-----------\n\n- The log of the external utilities called are stored in the file CRISPResso_RUNNING_LOG.txt\n- You can specify the output folder with the option --output_folder\n- You can inspect intermediate files with the option --keep_intermediate\n- All the processed raw data used to generate the figures are available in the following plain text files:\n        - Mapping_statistics.txt: this file contains number of: reads in input, reads after preprocessing (merging or quality filtering) and reads properly aligned.\n        - Quantification_of_editing_frequency.txt: quantification of editing frequency: number of reads aligned, reads with NHEJ,  reads with HDR, and reads with mixed HDR-NHEJ); In addition to each of these categories we also provide an overall report summarizing the total numbers of  insertions, deletions and substitutions;\n        - Alleles_frequency_table.txt: number or reads and percentage for each allele discovered in the sequencing data.      \n        - Frameshift_analysis.txt: number of modified reads with frameshift, in-frame and noncoding mutations;\n        - Splice_sites_analysis.txt: number of reads corresponding to potential affected splicing sites;\n        - effect_vector_combined.txt: location of mutations (including deletions, insertions, and substitutions) with respect to the reference amplicon;\n        - effect_vector_deletion.txt : location of deletions;\n        - effect_vector_insertion.txt: location of insertions;\n        - effect_vector_substitution.txt: location of substitutions. \n        - position_dependent_vector_avg_insertion_size.txt: average length of the insertions for each position.\n        - position_dependent_vector_avg_deletion_size.txt: average length of the deletions for each position.\n        - indel_histogram.txt: processed data used to generate figure 1 in the output report.\n        - insertion_histogram.txt: processed data used to generate the insertion histogram in figure 3 in the output report.\n        - deletion_histogram.txt: processed data used to generate the deletion histogram in figure 3 in the output report.\n        - substitution_histogram.txt: processed data used to generate the substitution histogram in figure 3 in the output report.\n\n\n\nExplore the output of CRISPResso\n--------------------------------\n\nIn order to help you to familiarize with the output of CRISPResso we provide several precomputed analyses, using the standard settings, for different simulated sequencing datasets with sequencing artifact modeled after the Illumina Miseq platform (using the ART simulation tool: http://www.niehs.nih.gov/research/resources/software/biostatistics/art/ ) and with known editing efficiency and mutagenesis profile:\n\n1) 1000 unmodified reads: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_unmodified_amplicon_MISEQ_ERROR_WINDOW_1bp.zip\n\n2) 1000 unmodified reads, 1000 reads with 1 substitution: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_1_substitution_MISEQ_ERROR_WINDOW_1bp.zip\n\n3) 1000 unmodified reads, 1000 reads with 2 substitutions: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_2_substitution_MISEQ_ERROR_WINDOW_1bp.zip\n\n4) 1000 unmodified reads, 1000 reads with 3 substitutions: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_3_substitution_MISEQ_ERROR_WINDOW_1bp.zip\n\n5) 1000 unmodified reads, 1000 reads with an insertion of 5 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_5_ins_MISEQ_ERROR_WINDOW_1bp.zip\n\n6) 1000 unmodified reads, 1000 reads with an insertion of 10 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_10_ins_MISEQ_ERROR_WINDOW_1bp.zip\n\n7) 1000 unmodified reads, 1000 reads with an insertion of 50 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_50_ins_MISEQ_ERROR_WINDOW_1bp.zip\n\n8) 1000 unmodified reads, 1000 reads with a deletion of 5 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_5_del_MISEQ_ERROR_WINDOW_1bp.zip\n\n9) 1000 unmodified reads, 1000 reads with a deletion of 10 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_10_del_MISEQ_ERROR_WINDOW_1bp.zip\n\n10) 1000 unmodified reads, 1000 reads with a deletion of 50 bp: http://crispresso.rocks/static/examples/CRISPResso_on_SIMULATION_amplicon_50_del_MISEQ_ERROR_WINDOW_1bp.zip\n\n\nInstallation and usage of CRISPRessoPooled\n------------------------------------------\n\nCRISPRessoPooled is a utility to analyze and quantify targeted sequencing CRISPR/Cas9 experiments involving sequencing libraries with pooled amplicons. One common experimental strategy is to pool multiple amplicons (e.g. a single on-target site plus a set of potential off-target sites) into a single deep sequencing reaction (briefly, genomic DNA samples for pooled applications can be prepared by first amplifying the target regions for each gene/target of interest with\nregions of 150-400bp depending on the desired coverage. In a second round of PCR, with minimized cycle numbers, barcode and adaptors are added. With optimization, these two rounds of PCR can be merged into a\nsingle reaction. These reactions are then quantified, normalized, pooled, and undergo quality control before being sequenced).\nCRISPRessoPooled demultiplexes reads from multiple amplicons and runs the CRISPResso utility with appropriate reads for each amplicon separately.\n\n**Installation**\n\nCRISPRessoPooled is installed automatically during the installation of\nCRISPResso, but to use it two additional programs must be installed:\n\n-   samtools: http://samtools.sourceforge.net/\n\n-   bowtie2: http://bowtie-bio.sourceforge.net/bowtie2\n\n    To install these tools please refer to their documentation.\n\n**Usage**\n\nThis tool can run in 3 different modes:\n\n**Amplicons mode:** Given a set of amplicon sequences, in this mode the\ntool demultiplexes the reads, aligning each read to the amplicon with\nbest alignment, and creates separate compressed FASTQ files, one for\neach amplicon. Reads that do not align to any amplicon are discarded.\nAfter this preprocessing, CRISPResso is run for each FASTQ file, and\nseparated reports are generated, one for each amplicon.\n\nTo run the tool in this mode the user must provide:\n\n1.  Paired-end reads (two files) or single-end reads (single file)\n    in [FASTQ\n    format ](http://en.wikipedia.org/wiki/FASTQ_format)(fastq.gz files\n    are also accepted) \n\n2.  A description file containing the amplicon sequences used to enrich\n    regions in the genome and some additional information. In\n    particular, this file, is a tab delimited text file with up to 5\n    columns (first 2 columns required):\n\n-   *AMPLICON\\_NAME*: an identifier for the amplicon (*must be unique*).\n\n-   *AMPLICON\\_SEQUENCE*: amplicon sequence used in the design of\n    the experiment.\n\n-   *sgRNA\\_SEQUENCE (OPTIONAL)*: sgRNA sequence used for this amplicon\n    *without the PAM sequence.* If not available, enter *NA.*\n\n-   *EXPECTED\\_AMPLICON\\_AFTER\\_HDR (OPTIONAL)*: expected amplicon\n    sequence in case of HDR. If more than one, separate by commas *and\n    not spaces*. If not available, enter *NA.*\n\n-   *CODING\\_SEQUENCE (OPTIONAL)*: Subsequence(s) of the amplicon\n    corresponding to coding sequences. If more than one, separate by\n    commas *and not spaces*. If not available, enter *NA.*\n\nA file in the right format should look like this:\n\nSite1 CACACTGTGGCCCCTGTGCCCAGCCCTGGGCTCTCTGTACATGAAGCAAC CCCTGTGCCCAGCCC NA NA\n \nSite2 GTCCTGGTTTTTGGTTTGGGAAATATAGTCATC NA GTCCTGGTTTTTGGTTTAAAAAAATATAGTCATC NA\n \nSite 3 TTTCTGGTTTTTGGTTTGGGAAATATAGTCATC NA NA GGAAATATA\n\nNote: *no column titles should be entered.* Also the colors here are used only for illustrative purposes and in a plain text file will be not be present and saved.\n\nThe user can easily create this file with *any text editor* or with\nspreadsheet software like Excel (Microsoft), Numbers (Apple) or Sheets\n(Google Docs) and then save it as tab delimited file.\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoPooled -r1 SRR1046762\\_1.fastq.gz -r2 SRR1046762\\_2.fastq.gz -f AMPLICONS\\_FILE.txt --name ONLY\\_AMPLICONS\\_SRR1046762 --gene\\_annotations gencode\\_v19.gz\n\nThe output of CRISPRessoPooled Amplicons mode consists of:\n\n1.  REPORT\\_READS\\_ALIGNED\\_TO\\_AMPLICONS.txt: this file contains the\n    same information provided in the input description file, plus some\n    additional columns:\n\n    a.  *Demultiplexed\\_fastq.gz\\_filename*: name of the files\n        containing the raw reads for each amplicon.\n\n    b.  *n\\_reads*: number of reads recovered for each amplicon.\n\n2.  A set of fastq.gz files, one for each amplicon.\n\n3.  A set of folders, one for each amplicon, containing a full\n    CRISPResso report.\n    \n4.  SAMPLES_QUANTIFICATION_SUMMARY.txt: this file contains a summary of the quantification and the alignment statistics for each          region analyzed (read counts and percentages for the various classes: Unmodified, NHEJ, point mutations, and HDR).\n\n5.  *CRISPRessoPooled\\_RUNNING\\_LOG.txt*:  execution log and messages\n    for the external utilities called.\n\n**Genome mode:** In this mode the tool aligns each read to the best\nlocation in the genome. Then potential amplicons are discovered looking\nfor regions with enough reads (the default setting is to have at least\n1000 reads, but the parameter can be adjusted with the option\n*--min\\_reads\\_to\\_use\\_region*). If a gene annotation file from UCSC is\nprovided, the tool also reports the overlapping gene/s to the region. In\nthis way it is possible to check if the amplified regions map to\nexpected genomic locations and/or also to pseudogenes or other\nproblematic regions. Finally CRISPResso is run in each region\ndiscovered.\n\nTo run the tool in this mode the user must provide:\n\n1.  Paired-end reads (two files) or single-end reads (single file)\n    in [FASTQ\n    format ](http://en.wikipedia.org/wiki/FASTQ_format)(fastq.gz files\n    are also accepted) \n\n2.  The full path of the reference genome in bowtie2 format (e.g.\n    /homes/luca/genomes/human\\_hg19/hg19). Instructions on how to build\n    a custom index or precomputed index for human and mouse genome\n    assembly can be downloaded from the bowtie2\n    website: http://bowtie-bio.sourceforge.net/bowtie2/index.shtml.\n\n3.  Optionally the full path of a gene annotations file from UCSC. The\n    user can download this file from the UCSC Genome Browser (\n    http://genome.ucsc.edu/cgi-bin/hgTables?command=start ) selecting as\n    table \"knowGene\", as output format \"all fields from selected table\"\n    and as file returned \"gzip compressed\". (e.g.\n    like: homes/luca/genomes/human\\_hg19/gencode\\_v19.gz)\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoPooled -r1 SRR1046762\\_1.fastq.gz -r2 SRR1046762\\_2.fastq.gz -x /gcdata/gcproj/Luca/GENOMES/hg19/hg19 --name ONLY\\_GENOME\\_SRR1046762 --gene\\_annotations gencode\\_v19.gz\n\nThe output of CRISPRessoPooled Genome mode consists of:\n\n1.  REPORT\\_READS\\_ALIGNED\\_TO\\_GENOME\\_ONLY.txt: this file contains the\n    list of all the regions discovered, one per line with the following\n    information:\n\n-   chr\\_id: chromosome of the region in the reference genome.\n\n-   bpstart: start coordinate of the region in the reference genome.\n\n-   bpend: end coordinate of the region in the reference genome.\n\n-   fastq\\_file: location of the fastq.gz file containing the reads\n    mapped to the region.\n\n-   n\\_reads: number of reads mapped to the region.\n\n-   sequence: the sequence, on the reference genome for the region.\n\n1.  MAPPED\\_REGIONS (folder): this folder contains all the fastq.gz\n    files for the discovered regions.\n\n2.  A set of folders with the CRISPResso report on the regions with\n    enough reads.\n    \n3.  SAMPLES_QUANTIFICATION_SUMMARY.txt: this file contains a summary of the quantification and the alignment statistics for each          region analyzed (read counts and percentages for the various classes: Unmodified, NHEJ, point mutations, and HDR).\n\n4.  *CRISPRessoPooled\\_RUNNING\\_LOG.txt*:  execution log and messages\n    for the external utilities called.\n\n    This running mode is particular useful to check if there are mapping\n    artifacts or contaminations in the library. In an optimal\n    experiment, the list of the regions discovered should contain only\n    the regions for which amplicons were designed.\n\n**Mixed mode (Amplicons + Genome)**: in this mode, the tool first aligns\nreads to the genome and, as in the **Genome mode**, discovers aligning\nregions with reads exceeding a tunable threshold. Next it will align the\namplicon sequences to the reference genome and will use only the reads\nthat match both the amplicon locations and the discovered genomic\nlocations, excluding spurious reads coming from other regions, or reads\nnot properly trimmed. Finally CRISPResso is run using each of the\nsurviving regions.\n\nTo run the tool in this mode the user must provide:\n\n-   Paired-end reads (two files) or single-end reads (single file)\n    in [FASTQ\n    format ](http://en.wikipedia.org/wiki/FASTQ_format)(fastq.gz files\n    are also accepted) \n\n-   A description file containing the amplicon sequences used to enrich\n    regions in the genome and some additional information (as described\n    in the Amplicons mode section).\n\n-   The reference genome in bowtie2 format (as described in Genome\n    mode section).\n\n-   Optionally the gene annotations from UCSC (as described in Genome\n    mode section).\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoPooled -r1 SRR1046762\\_1.fastq.gz -r2 SRR1046762\\_2.fastq.gz -f AMPLICONS\\_FILE.txt -x /gcdata/gcproj/Luca/GENOMES  /hg19/hg19 --name AMPLICONS\\_AND\\_GENOME\\_SRR1046762 --gene\\_annotations gencode\\_v19.gz\n\nThe output of CRISPRessoPooled Mixed Amplicons + Genome mode consists of\nthese files:\n\n1.  REPORT\\_READS\\_ALIGNED\\_TO\\_GENOME\\_AND\\_AMPLICONS.txt: this file\n    contains the same information provided in the input description\n    file, plus some additional columns:\n\n    a.  Amplicon\\_Specific\\_fastq.gz\\_filename: name of the file\n        containing the raw reads recovered for the amplicon.\n\n    b.  *n\\_reads*: number of reads recovered for the amplicon.\n\n    c.  *Gene\\_overlapping:* gene/s overlapping the amplicon region.\n\n    d.  chr\\_id: chromosome of the amplicon in the reference genome.\n\n    e.  bpstart: start coordinate of the amplicon in the\n        reference genome.\n\n    f.  bpend: end coordinate of the amplicon in the reference genome.\n\n    g.  Reference\\_Sequence: sequence in the reference genome for the\n        region mapped for the amplicon.\n\n2.  MAPPED\\_REGIONS (folder): this folder contains all the fastq.gz\n    files for the discovered regions.\n\n3.  A set of folders with the CRISPResso report on the amplicons with\n    enough reads.\n\n4.  SAMPLES_QUANTIFICATION_SUMMARY.txt: this file contains a summary of the quantification and the alignment statistics for each          region analyzed (read counts and percentages for the various classes: Unmodified, NHEJ, point mutations, and HDR).\n\n5.  *CRISPRessoPooled\\_RUNNING\\_LOG.txt*:   execution log and messages\n    for the external utilities called.\n\nThe Mixed mode combines the benefits of the two previous running modes.\nIn this mode it is possible to recover in an unbiased way all the\ngenomic regions contained in the library, and hence discover\ncontaminations or mapping artifacts. In addition, by knowing the\nlocation of the amplicon with respect to the reference genome, reads not\nproperly trimmed or mapped to pseudogenes or other problematic regions\nwill be automatically discarded, providing the cleanest set of reads to\nquantify the mutations in the target regions with CRISPResso.\n\nIf the focus of the analysis is to obtain the best quantification of\nediting efficiency for a set of amplicons, we suggest running the tool\nin the Mixed mode. The Genome mode is instead suggested to check\nproblematic libraries, since a report is generated for each region\ndiscovered, even if the region is not mappable to any amplicon (however,\nhis may be time consuming). Finally the Amplicon mode is the fastest,\nalthough the least reliable in terms of quantification accuracy.\n\n\nInstallation and usage of CRISPRessoWGS\n---------------------------------------\n\nCRISPRessoWGS is a utility for the analysis of genome editing experiment\nfrom whole genome sequencing (WGS) data. CRISPRessoWGS allows exploring\nany region of the genome to quantify targeted editing or potentially\noff-target effects.\n\n**Installation**\n\nCRISPRessoWGS is installed automatically during the installation of\nCRISPResso, but to use it two additional programs must be installed:\n\n-   samtools: http://samtools.sourceforge.net/\n\n-   bowtie2: http://bowtie-bio.sourceforge.net/bowtie2\n\n    To install these tools please refer to their documentation.\n\nTo run CRISPRessoWGS you must provide:\n\n1.  A genome aligned *BAM* file. To align reads from a WGS experiment to\n    the genome there are many options available, we suggest using either\n    **Bowtie2 (**<http://bowtie-bio.sourceforge.net/bowtie2/>) or **BWA\n    (**<http://bio-bwa.sourceforge.net/>**).**\n\n2.  A *FASTA* file containing the reference sequence used to align the\n    reads and create the BAM file (the reference files for the most\n    common organism can be download from\n    UCSC: http://hgdownload.soe.ucsc.edu/downloads.html. *Download and\n    uncompress only the file ending with .fa.gz*, for example for the\n    last version of the human genome download and *uncompress* the\n    file hg38.fa.gz)\n\n3.  Descriptions file containing the coordinates of the regions to\n    analyze and some additional information. In particular, this file is\n    a tab delimited text file with up to 7 columns (4 required):\n\n    -   chr\\_id: chromosome of the region in the reference genome.\n\n    -   bpstart: start coordinate of the region in the reference genome.\n\n    -   bpend: end coordinate of the region in the reference genome.\n\n    -   *REGION\\_NAME*: an identifier for the region (*must be unique*).\n\n    -   *sgRNA\\_SEQUENCE (OPTIONAL)*: sgRNA sequence used for this genomic segment *without the PAM sequence.* If not available, enter *NA.*\n\n    -   *EXPECTED\\_SEGMENT\\_AFTER\\_HDR (OPTIONAL)*: expected genomic segment sequence in case of HDR. If more than one, separate by commas *and not spaces*. If not available, enter *NA.*\n\n    -   *CODING\\_SEQUENCE (OPTIONAL)*: Subsequence(s) of the genomic segment corresponding to coding sequences. If more than one, separate by commas *and not spaces*. If not available, enter *NA.*\n\n> A file in the right format should look like this:\n\nchr1 65118211 65118261 R1 CTACAGAGCCCCAGTCCTGG NA NA\n\nchr6 51002798 51002820 R2 NA NA NA\n\nNote: *no column titles should be entered.* As you may have noticed this\nfile is just a *BED* file with extra columns. For this reason a normal\nBED file with 4 columns, is also **accepted** by this utility.\n\n4.  Optionally the full path of a gene annotations file from UCSC. You\n    can download the this file from the UCSC Genome\n    Browser (http://genome.ucsc.edu/cgi-bin/hgTables?command=start)\n    selecting as table \"knowGene\", as output format \"all fields from\n    selected table\" and as file returned \"gzip compressed\". (something\n    like: homes/luca/genomes/human\\_hg19/gencode\\_v19.gz)\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoWGS -b WGS/50/50\\_sorted\\_rmdup\\_fixed\\_groups.bam -f WGS\\_TEST.txt -r /gcdata/gcproj/Luca/GENOMES/mm9/mm9.fa --gene\\_annotations ensemble\\_mm9.txt.gz --name CRISPR\\_WGS\\_SRR1542350\n\nThe output from these files will consist of:\n\n1.  REPORT\\_READS\\_ALIGNED\\_TO\\_SELECTED\\_REGIONS\\_WGS.txt: this file\n    contains the same information provided in the input description\n    file, plus some additional columns:\n\n    a.  sequence: sequence in the reference genome for the\n        region specified.\n\n    b.  *gene\\_overlapping:* gene/s overlapping the region specified.\n\n    c.  *n\\_reads*: number of reads recovered for the region.\n\n    d.  bam\\_file\\_with\\_reads\\_in\\_region: file containing only the\n        subset of the reads that overlap, also partially, with\n        the region. This file is indexed and can be easily loaded for\n        example on IGV for visualization of single reads or for the\n        comparison of two conditions. For example, in the figure below\n        (fig X) we show reads mapped to a region inside the coding\n        sequence of the gene Crygc subjected to\n        NHEJ (CRISPR\\_WGS\\_SRR1542350) vs reads from a control\n        experiment (CONTROL\\_WGS\\_SRR1542349).\n\n    e.  fastq.gz\\_file\\_trimmed\\_reads\\_in\\_region: file containing only\n        the subset of reads fully covering the specified regions, and\n        trimmed to match the sequence in that region. These reads are\n        used for the subsequent analysis with CRISPResso.\n\n2.  ANALYZED\\_REGIONS (folder): this folder contains all the BAM and\n    FASTQ files, one for each region analyzed.\n\n3.  A set of folders with the CRISPResso report on the regions provided\n    in input with enough reads (the default setting is to have at least\n    10 reads, but the parameter can be adjusted with the option\n\n    *--min\\_reads\\_to\\_use\\_region*).\n\n4.  *CRISPRessoPooled\\_RUNNING\\_LOG.txt*:   execution log and messages\n    for the external utilities called.\n\nThis utility is particular useful to investigate and quantify mutation\nfrequency in a list of potential target or off-target sites, coming for\nexample from prediction tools, or from other orthogonal assays.\n\nInstallation and usage of CRISPRessoCompare\n-------------------------------------------\nCRISPRessoCompare is a utility for the comparison of a pair of CRISPResso analyses. CRISPRessoCompare produces a summary of differences between two conditions, for example a CRISPR treated and an untreated control sample (see figure below). Informative plots are generated showing the differences in editing rates and localization within the reference amplicon,\n\n**Installation**\n\nCRISPRessoCompare  is installed automatically during the installation of CRISPResso\n\nTo run CRISPRessoCompare you must provide:\n\n1.\tTwo output folders generated with CRISPResso using the same reference amplicon and settings but on different datasets.\n2.\tOptionally a name for each condition to use for the plots, and the name of the output folder\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoCompare -n1 \"VEGFA CRISPR\" -n2 \"VEGFA CONTROL\"  -n VEGFA_Site_1_SRR10467_VS_SRR1046787 CRISPResso_on_VEGFA_Site_1_SRR1046762/ CRISPResso_on_VEGFA_Site_1_SRR1046787/\n\n.. image:: https://github.com/lucapinello/CRISPResso/blob/master/CRISPRessoCompare_output.png?raw=true\n\nThe output will consist of:\n\n1.\tComparison_Efficiency.pdf: a figure containing a comparison of the edit frequencies for each category (NHEJ, MIXED NHEJ-HDR and HDR) and as well the net effect subtracting the second sample (second folder in the command line) provided in the analysis from the first sample (first folder in the command line). \n2.\tComparison_Combined_Insertion_Deletion_Substitution_Locations.pdf: a figure showing the average profile for the mutations for the two samples in the same scale and their difference with the same convention used in the previous figure (first sample – second sample).\n3.\tCRISPRessoCompare_RUNNING_LOG.txt: detailed execution log. \n\n\nInstallation and usage of CRISPRessoPooledWGSCompare\n----------------------------------------------------\nCRISPRessoPooledWGSCompare is an extension of the CRIPRessoCompare utility allowing the user to run and summarize multiple CRISPRessoCompare analyses where several regions are analyzed in two different conditions, as in the case of the CRISPRessoPooled or CRISPRessoWGS utilities.\n\n\n**Installation**\n\nCRISPRessoPooledWGSCompare is installed automatically during the installation of CRISPResso.\n\nTo run CRISPRessoPooledWGSCompare you must provide:\n1.\tTwo output folders generated with CRISPRessoPooled or CRISPRessoWGS using the same reference amplicon and settings but on different datasets.\n2.\tOptionally a name for each condition to use for the plots, and the name of the output folder\n\nExample:\n\n.. code:: bash\n\n        CRISPRessoPooledWGSCompare CRISPRessoPooled_on_AMPLICONS_AND_GENOME_SRR1046762/ CRISPRessoPooled_on_AMPLICONS_AND_GENOME_SRR1046787/ -n1 SRR1046762 -n2 SRR1046787 -n AMPLICONS_AND_GENOME_SRR1046762_VS_SRR1046787\n\nThe output from these files will consist of:\n1.\tCOMPARISON_SAMPLES_QUANTIFICATION_SUMMARIES.txt: this file contains a summary of the quantification for each of the two conditions for each region and their difference (read counts and percentages for the various classes: Unmodified, NHEJ, MIXED NHEJ-HDR  and HDR).\n2.\tA set of folders with CRISPRessoCompare reports on the common regions with enough reads in both conditions.\n3.\tCRISPRessoPooledWGSCompare_RUNNING_LOG.txt: detailed execution log. \n\nHow to cite CRISPResso\n----------------------\n\nIf you use CRISPResso in your work please cite:  \n\n **Pinello L, Canver MC, Hoban MD, Orkin SH, Kohn DB, Bauer DE, Yuan GC. Analyzing CRISPR genome-editing experiments with CRISPResso. Nat Biotechnol. 2016 Jul 12;34(7):695-697. doi: 10.1038/nbt.3583. PubMed PMID: 27404874.**\n\n\nAcknowledgements\n----------------\nWe are grateful to Feng Zhang and David Scott for useful feedback and suggestions; the FAS Research Computing Team, in particular Daniel Kelleher, for great support in hosting the web application of CRISPResso; and Sorel Fitz-Gibbon from UCLA for help in sharing data. Finally, we thank all members of the Guo-Cheng Yuan lab for testing the software.\n",
    "docs_url": "https://pythonhosted.org/CRISPResso/",
    "download_url": null,
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "http://github.com/lucapinello/CRISPResso",
    "keywords": null,
    "license": "UNKNOWN",
    "maintainer": null,
    "maintainer_email": null,
    "name": "CRISPResso",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/CRISPResso/",
    "release_url": "https://pypi.org/project/CRISPResso/1.0.5/",
    "requires_python": null,
    "summary": "Software pipeline for the analysis of CRISPR-Cas9 genome editing outcomes from deep sequencing data",
    "version": "1.0.5"
  },
  "releases": {
    "0.7.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "f7a5e783b349604bc2925cdcec9ceec8",
          "sha256": "1f5dcd861121703d25c0726f7b905de384b7d9d6165002406aa4160c18c82d5b"
        },
        "downloads": 2732,
        "filename": "CRISPResso-0.7.1.tar.gz",
        "has_sig": false,
        "md5_digest": "f7a5e783b349604bc2925cdcec9ceec8",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 224430,
        "upload_time": "2015-07-16T23:39:08",
        "url": "https://files.pythonhosted.org/packages/1e/28/2b06f46c4760750ebea91d5fb25346d89d5a107cfe10b18fbaa61bc9d988/CRISPResso-0.7.1.tar.gz"
      }
    ],
    "0.8.6": [
      {
        "comment_text": "",
        "digests": {
          "md5": "6ea9ce2efe307e1713394778048de545",
          "sha256": "3300d2af315d87db2eaecf9555ff544ced61f44eb65a52842b172c500c1d2b9a"
        },
        "downloads": 887,
        "filename": "CRISPResso-0.8.6.tar.gz",
        "has_sig": false,
        "md5_digest": "6ea9ce2efe307e1713394778048de545",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 221871,
        "upload_time": "2015-11-16T04:13:51",
        "url": "https://files.pythonhosted.org/packages/6d/27/081c8faf763594540b16bb99cd33e102bb6b252077951b3013edd3eb7dbe/CRISPResso-0.8.6.tar.gz"
      }
    ],
    "0.9.8": [
      {
        "comment_text": "",
        "digests": {
          "md5": "7d056edbfa9c81c5478d2c97c2f7861a",
          "sha256": "abab97421a270a2f7eda3a89997503118cda9f2eca28731e07c321d06d315962"
        },
        "downloads": 418,
        "filename": "CRISPResso-0.9.8.tar.gz",
        "has_sig": false,
        "md5_digest": "7d056edbfa9c81c5478d2c97c2f7861a",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 291800,
        "upload_time": "2016-08-01T19:02:37",
        "url": "https://files.pythonhosted.org/packages/76/13/ca9574184e7ca3496497d59de9394fdbd3595659a36c321ca05e05b7ad85/CRISPResso-0.9.8.tar.gz"
      }
    ],
    "0.9.9": [
      {
        "comment_text": "",
        "digests": {
          "md5": "9a46b8434852a6554f7ffaf2475929a2",
          "sha256": "6bda4fd2d4247421bf7914934c15097c9316b89660127a84be2977a2dead8afe"
        },
        "downloads": 181,
        "filename": "CRISPResso-0.9.9.tar.gz",
        "has_sig": false,
        "md5_digest": "9a46b8434852a6554f7ffaf2475929a2",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1298090,
        "upload_time": "2016-08-20T14:01:09",
        "url": "https://files.pythonhosted.org/packages/64/04/91aa6a49996354f7417344ef03f12d3e7c51471d78ea2c2d318d722c2a66/CRISPResso-0.9.9.tar.gz"
      }
    ],
    "1.0.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "51072fdb59f9ecb4092323753664b13d",
          "sha256": "937df6d8dc8c1e142cbc225fec135c65b27956c1719ec086e8a28b411b7a8b87"
        },
        "downloads": 184,
        "filename": "CRISPResso-1.0.0.tar.gz",
        "has_sig": false,
        "md5_digest": "51072fdb59f9ecb4092323753664b13d",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 233562,
        "upload_time": "2016-08-30T16:31:43",
        "url": "https://files.pythonhosted.org/packages/e4/37/a3d7333ffaf9b4572b44c0cc2a53b2b387f97dd36c94fe4d36aac9433f0c/CRISPResso-1.0.0.tar.gz"
      }
    ],
    "1.0.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "8611897d4ecb7243ac2051070ecf8622",
          "sha256": "53973d0845e520978704770a4851b036a96a0a2c53c368ce38d5371886e4c745"
        },
        "downloads": 86,
        "filename": "CRISPResso-1.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "8611897d4ecb7243ac2051070ecf8622",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 297757,
        "upload_time": "2016-11-18T00:49:55",
        "url": "https://files.pythonhosted.org/packages/7f/e9/012882700e4a4a0a65658be080e1609ec38bba0401dc55ad8395e123ebaf/CRISPResso-1.0.1.tar.gz"
      }
    ],
    "1.0.2": [
      {
        "comment_text": "",
        "digests": {
          "md5": "eec91d26948cec5f8b313a2d42be3006",
          "sha256": "fd33553cb7228c14650bd3d744e74b44dec18eb299dde434e3c74d3d54c90b01"
        },
        "downloads": 82,
        "filename": "CRISPResso-1.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "eec91d26948cec5f8b313a2d42be3006",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 291834,
        "upload_time": "2016-12-07T16:13:35",
        "url": "https://files.pythonhosted.org/packages/e7/8c/a01155aca979faf48be5c59590ceab5fe849615974420ae3f76076649497/CRISPResso-1.0.2.tar.gz"
      }
    ],
    "1.0.5": [
      {
        "comment_text": "",
        "digests": {
          "md5": "4f4789682ed346e048dcd68661d32043",
          "sha256": "6a885dc24bd77aae0cb275208f727d1fab64b62a0628855948bcdd4f3d751a91"
        },
        "downloads": 24,
        "filename": "CRISPResso-1.0.5.tar.gz",
        "has_sig": false,
        "md5_digest": "4f4789682ed346e048dcd68661d32043",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 294560,
        "upload_time": "2017-03-31T20:56:28",
        "url": "https://files.pythonhosted.org/packages/d1/46/cdf8a04ea068fc8b7c28a1d8d3a2a6bc506d3e172cb16e65abed9cb44786/CRISPResso-1.0.5.tar.gz"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "4f4789682ed346e048dcd68661d32043",
        "sha256": "6a885dc24bd77aae0cb275208f727d1fab64b62a0628855948bcdd4f3d751a91"
      },
      "downloads": 24,
      "filename": "CRISPResso-1.0.5.tar.gz",
      "has_sig": false,
      "md5_digest": "4f4789682ed346e048dcd68661d32043",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 294560,
      "upload_time": "2017-03-31T20:56:28",
      "url": "https://files.pythonhosted.org/packages/d1/46/cdf8a04ea068fc8b7c28a1d8d3a2a6bc506d3e172cb16e65abed9cb44786/CRISPResso-1.0.5.tar.gz"
    }
  ]
}