{
  "info": {
    "author": "cylp\n\n\nMehdi Towhidi   (mehdi.towhidi@gerad.ca)\nDominique Orban (dominique.orban@gerad.ca)",
    "author_email": "mehdi.towhidi@gerad.ca",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "Important Notice\n==================\nTo comply with PEP8 we decided to rename the package name from CyLP to cylp,\nwhich was long overdue.\nIt affects the package name ONLY and a simple replace can make your program\nwork with the new settings.\nThank you for your understanding.\n\n\nWhat is CyLP?\n==============\nCyLP is a Python interface to COIN-ORs Linear and mixed-integer program solvers\n(CLP, CBC, and CGL). CyLPs unique feature is that you can use it to alter the\nsolution process of the solvers from within Python. For example, you may\ndefine cut generators, branch-and-bound strategies, and primal/dual Simplex\npivot rules completely in Python.\n\nYou may read your LP from an mps file or use the CyLPs easy modeling\nfacility. Please find examples in the `documentation\n<http://mpy.github.io/CyLPdoc/>`_.\n\n.. note::\n\n   CyLP interfaces a limited number of functionalities of\n   COIN-ORs solvers. If there is any particular\n   class or method in CLP, CBC, and CGL that you would like to use in Python\n   please don't hesitate to let us know; we will try to make the connections.\n   Moreover, in the case that you find a bug or a mistake, we would appreciate\n   it if you notify us. Contact us at mehdi [dot] towhidi [at] gerad [dot] ca.\n\n\nWho uses CyLP\n==============\nCyLP is being used in a wide range of practical and research fields. Some of the users include:\n\n#. PyArt, The Python ARM Radar Toolkit, used by Atmospheric Radiation Measurement\n   (U.S. Department of energy). https://github.com/ARM-DOE/pyart\n#. Meteorological Institute University of Bonn.\n#. Sherbrooke university hospital (Centre hospitalier universitaire de Sherbrooke): CyLP is used for nurse scheduling.\n#. Maisonneuve-Rosemont hospital (L'hopital HMR): CyLP is used for  physician scheduling with preferences.\n#. Lehigh University: CyLP is used to teach mixed-integer cuts.\n#. IBM T. J. Watson research center\n#. Saarland University, Germany\n\n\n\nInstallation\n============\n\nThe easiest way to install CyLP is by using the binaries. If that's not\npossible you may always compile it from source.\n\nRequirements\n--------------\n\nCyLP needs Numpy (www.numpy.org) and Scipy (www.scipy.org). If you wish to install CyLP from source, you will also need to compile Cbc. Details of this process is given below.\n\nBinary Installation\n----------------------\n\nIf you have setuptools installed you may run::\n\n    $ easy_install cylp\n\nIf a binary is available for your architecture it will be installed. Otherwise\nyou will see an error telling you to specify where to find a Cbc installation.\nThat's because easy_install is trying to compile the source. In this case\nyou'll have to compile Cbc and set and environment variable to point to it\nbefore calling easy_install again. The details are given in the `Installing\nfrom source`_ section.\n\n\n\nInstalling from source\n========================\n\nSTEP 1:\n    Install CBC (http://www.coin-or.org/download/source/Cbc/).\n    CyLP can be compiled against\n    Cbc version 2.8.5. Please go to the installation directory and run::\n\n        $ ./configure\n        $ make\n        $ make install\n\nSTEP 2:\n    Create an environment variable called COIN_INSTALL_DIR pointing to your\n    installation of Coin. For example::\n\n        $ export COIN_INSTALL_DIR=/Users/mehdi/Cbc-2.8.5\n\nYou may also add this line to your ~/.bash_rc or ~/.profile to make\nit persistent.\n\nSTEP 3:\n    Install CyLP. Go to CyLP's root directory and run::\n\n        $ python setup.py install\n\nSTEP 4 (LINUX):\n     In linux you might also need to add COIN's lib directory to\n     LD_LIBRARY_PATH as follows::\n\n        $ export LD_LIBRARY_PATH=/path/to/Cbc-2.8.5/lib:$LD_LIBRARY_PATH\"\n\nOptional step:\n    If you want to run the doctests (i.e. ``make doctest`` in the ``doc`` directory)\n    you should also define::\n\n        $ export CYLP_SOURCE_DIR=/Path/to/cylp\n\nNow you can use CyLP in your python code. For example::\n\n    >>> from cylp.cy import CyClpSimplex\n    >>> s = CyClpSimplex()\n    >>> s.readMps('../input/netlib/adlittle.mps')\n    0\n    >>> s.initialSolve()\n    'optimal'\n    >>> round(s.objectiveValue, 3)\n    225494.963\n\nOr simply go to CyLP and run::\n\n    $ python -m unittest discover\n\nto run all CyLP unit tests.\n\n\n\nModeling Example\n==================\n\nHere is an example of how to model with CyLP's modeling facility::\n\n    import numpy as np\n    from cylp.cy import CyClpSimplex\n    from cylp.py.modeling.CyLPModel import CyLPArray\n\n    s = CyClpSimplex()\n\n    # Add variables\n    x = s.addVariable('x', 3)\n    y = s.addVariable('y', 2)\n\n    # Create coefficients and bounds\n    A = np.matrix([[1., 2., 0],[1., 0, 1.]])\n    B = np.matrix([[1., 0, 0], [0, 0, 1.]])\n    D = np.matrix([[1., 2.],[0, 1]])\n    a = CyLPArray([5, 2.5])\n    b = CyLPArray([4.2, 3])\n    x_u= CyLPArray([2., 3.5])\n\n    # Add constraints\n    s += A * x <= a\n    s += 2 <= B * x + D * y <= b\n    s += y >= 0\n    s += 1.1 <= x[1:3] <= x_u\n\n    # Set the objective function\n    c = CyLPArray([1., -2., 3.])\n    s.objective = c * x + 2 * y.sum()\n\n    # Solve using primal Simplex\n    s.primal()\n    print s.primalVariableSolution['x']\n\n\n\nDocumentation\n===============\nYou may access CyLP's documentation:\n\n1. *Online* : Please visit http://mpy.github.io/CyLPdoc/\n\n2. *Offline* : To install CyLP's documentation in your repository, you need\n   Sphinx (http://sphinx.pocoo.org/). You can generate the documentation by\n   going to cylp/doc and run ``make html`` or ``make latex`` and access the\n   documentation under cylp/doc/build. You can also run ``make doctest`` to\n   perform all the doctest.\n\n\n.. image:: https://d2weczhvl823v0.cloudfront.net/mpy/cylp/trend.png\n   :alt: Bitdeli badge\n   :target: https://bitdeli.com/free\n\n.. image:: https://cruel-carlota.pagodabox.com/f8efbddd4f44bb098d20dafdd0b9e897\n   :alt: githalytics.com\n   :target: http://githalytics.com/mpy/cylp",
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/mpy/cylp",
    "keywords": null,
    "license": "Common Public License Version 1.0\n\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS COMMON PUBLIC\nLICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM\nCONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\n    a) in the case of the initial Contributor, the initial code and\ndocumentation distributed under this Agreement, and\n\n    b) in the case of each subsequent Contributor:\n\n    i) changes to the Program, and\n\n    ii) additions to the Program;\n\n    where such changes and/or additions to the Program originate from and are\ndistributed by that particular Contributor. A Contribution 'originates' from a\nContributor if it was added to the Program by such Contributor itself or anyone\nacting on such Contributor's behalf. Contributions do not include additions to\nthe Program which: (i) are separate modules of software distributed in\nconjunction with the Program under their own license agreement, and (ii) are not\nderivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents \" mean patent claims licensable by a Contributor which are\nnecessarily infringed by the use or sale of its Contribution alone or when\ncombined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement,\nincluding all Contributors.\n\n2. GRANT OF RIGHTS\n\n    a) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free copyright license to\nreproduce, prepare derivative works of, publicly display, publicly perform,\ndistribute and sublicense the Contribution of such Contributor, if any, and such\nderivative works, in source code and object code form.\n\n    b) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free patent license under Licensed\nPatents to make, use, sell, offer to sell, import and otherwise transfer the\nContribution of such Contributor, if any, in source code and object code form.\nThis patent license shall apply to the combination of the Contribution and the\nProgram if, at the time the Contribution is added by the Contributor, such\naddition of the Contribution causes such combination to be covered by the\nLicensed Patents. The patent license shall not apply to any other combinations\nwhich include the Contribution. No hardware per se is licensed hereunder.\n\n    c) Recipient understands that although each Contributor grants the licenses\nto its Contributions set forth herein, no assurances are provided by any\nContributor that the Program does not infringe the patent or other intellectual\nproperty rights of any other entity. Each Contributor disclaims any liability to\nRecipient for claims brought by any other entity based on infringement of\nintellectual property rights or otherwise. As a condition to exercising the\nrights and licenses granted hereunder, each Recipient hereby assumes sole\nresponsibility to secure any other intellectual property rights needed, if any.\nFor example, if a third party patent license is required to allow Recipient to\ndistribute the Program, it is Recipient's responsibility to acquire that license\nbefore distributing the Program.\n\n    d) Each Contributor represents that to its knowledge it has sufficient\ncopyright rights in its Contribution, if any, to grant the copyright license set\nforth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under its\nown license agreement, provided that:\n\n    a) it complies with the terms and conditions of this Agreement; and\n\n    b) its license agreement:\n\n    i) effectively disclaims on behalf of all Contributors all warranties and\nconditions, express and implied, including warranties or conditions of title and\nnon-infringement, and implied warranties or conditions of merchantability and\nfitness for a particular purpose;\n\n    ii) effectively excludes on behalf of all Contributors all liability for\ndamages, including direct, indirect, special, incidental and consequential\ndamages, such as lost profits;\n\n    iii) states that any provisions which differ from this Agreement are offered\nby that Contributor alone and not by any other party; and\n\n    iv) states that source code for the Program is available from such\nContributor, and informs licensees how to obtain it in a reasonable manner on or\nthrough a medium customarily used for software exchange. \n\nWhen the Program is made available in source code form:\n\n    a) it must be made available under this Agreement; and\n\n    b) a copy of this Agreement must be included with each copy of the Program. \n\nContributors may not remove or alter any copyright notices contained within the\nProgram.\n\nEach Contributor must identify itself as the originator of its Contribution, if\nany, in a manner that reasonably allows subsequent Recipients to identify the\noriginator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with\nrespect to end users, business partners and the like. While this license is\nintended to facilitate the commercial use of the Program, the Contributor who\nincludes the Program in a commercial product offering should do so in a manner\nwhich does not create potential liability for other Contributors. Therefore, if\na Contributor includes the Program in a commercial product offering, such\nContributor (\"Commercial Contributor\") hereby agrees to defend and indemnify\nevery other Contributor (\"Indemnified Contributor\") against any losses, damages\nand costs (collectively \"Losses\") arising from claims, lawsuits and other legal\nactions brought by a third party against the Indemnified Contributor to the\nextent caused by the acts or omissions of such Commercial Contributor in\nconnection with its distribution of the Program in a commercial product\noffering. The obligations in this section do not apply to any claims or Losses\nrelating to any actual or alleged intellectual property infringement. In order\nto qualify, an Indemnified Contributor must: a) promptly notify the Commercial\nContributor in writing of such claim, and b) allow the Commercial Contributor to\ncontrol, and cooperate with the Commercial Contributor in, the defense and any\nrelated settlement negotiations. The Indemnified Contributor may participate in\nany such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial product\noffering, Product X. That Contributor is then a Commercial Contributor. If that\nCommercial Contributor then makes performance claims, or offers warranties\nrelated to Product X, those performance claims and warranties are such\nCommercial Contributor's responsibility alone. Under this section, the\nCommercial Contributor would have to defend claims against the other\nContributors related to those performance claims and warranties, and if a court\nrequires any other Contributor to pay any damages as a result, the Commercial\nContributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN\n\"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR\nIMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE,\nNON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each\nRecipient is solely responsible for determining the appropriateness of using and\ndistributing the Program and assumes all risks associated with its exercise of\nrights under this Agreement, including but not limited to the risks and costs of\nprogram errors, compliance with applicable laws, damage to or loss of data,\nprograms or equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY\nCONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST\nPROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\nOUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS\nGRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under applicable\nlaw, it shall not affect the validity or enforceability of the remainder of the\nterms of this Agreement, and without further action by the parties hereto, such\nprovision shall be reformed to the minimum extent necessary to make such\nprovision valid and enforceable.\n\nIf Recipient institutes patent litigation against a Contributor with respect to\na patent applicable to software (including a cross-claim or counterclaim in a\nlawsuit), then any patent licenses granted by that Contributor to such Recipient\nunder this Agreement shall terminate as of the date such litigation is filed. In\naddition, if Recipient institutes patent litigation against any entity\n(including a cross-claim or counterclaim in a lawsuit) alleging that the Program\nitself (excluding combinations of the Program with other software or hardware)\ninfringes such Recipient's patent(s), then such Recipient's rights granted under\nSection 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to\ncomply with any of the material terms or conditions of this Agreement and does\nnot cure such failure in a reasonable period of time after becoming aware of\nsuch noncompliance. If all Recipient's rights under this Agreement terminate,\nRecipient agrees to cease use and distribution of the Program as soon as\nreasonably practicable. However, Recipient's obligations under this Agreement\nand any licenses granted by Recipient relating to the Program shall continue and\nsurvive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in\norder to avoid inconsistency the Agreement is copyrighted and may only be\nmodified in the following manner. The Agreement Steward reserves the right to\npublish new versions (including revisions) of this Agreement from time to time.\nNo one other than the Agreement Steward has the right to modify this Agreement.\nIBM is the initial Agreement Steward. IBM may assign the responsibility to serve\nas the Agreement Steward to a suitable separate entity. Each new version of the\nAgreement will be given a distinguishing version number. The Program (including\nContributions) may always be distributed subject to the version of the Agreement\nunder which it was received. In addition, after a new version of the Agreement\nis published, Contributor may elect to distribute the Program (including its\nContributions) under the new version. Except as expressly stated in Sections\n2(a) and 2(b) above, Recipient receives no rights or licenses to the\nintellectual property of any Contributor under this Agreement, whether\nexpressly, by implication, estoppel or otherwise. All rights in the Program not\nexpressly granted under this Agreement are reserved.\n\nThis Agreement is governed by the laws of the State of New York and the\nintellectual property laws of the United States of America. No party to this\nAgreement will bring a legal action under this Agreement more than one year\nafter the cause of action arose. Each party waives its rights to a jury trial in\nany resulting litigation.",
    "maintainer": null,
    "maintainer_email": null,
    "name": "cylp",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/cylp/",
    "release_url": "https://pypi.org/project/cylp/0.7.3-/",
    "requires_python": null,
    "summary": "A Python interface for CLP, CBC, and CGL",
    "version": "0.7.3-"
  },
  "releases": {
    "0.2.3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "fc2045ad4fe7454c06a940a283fa144a",
          "sha256": "17713f82076374bc4c5c0a282f63bf9a69f195f4adc5200d9f7e7a9e1b821ade"
        },
        "downloads": 2711,
        "filename": "cylp-0.2.3.tar.gz",
        "has_sig": false,
        "md5_digest": "fc2045ad4fe7454c06a940a283fa144a",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 149640,
        "upload_time": "2013-12-02T00:23:43",
        "url": "https://files.pythonhosted.org/packages/c9/4e/8620b963af7fb67dfd746b6c3ad23898776341b0a114372aab8a2218be62/cylp-0.2.3.tar.gz"
      }
    ],
    "0.2.3.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "79eedc10e973c930852bb4e1ef1b7a91",
          "sha256": "574cd82659895286b2718885d72131367af2135934e0cdd2f77ed00f71446718"
        },
        "downloads": 3089,
        "filename": "cylp-0.2.3.1.tar.gz",
        "has_sig": false,
        "md5_digest": "79eedc10e973c930852bb4e1ef1b7a91",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1014597,
        "upload_time": "2013-12-02T00:34:36",
        "url": "https://files.pythonhosted.org/packages/59/ce/5733f814bad778999abebdfe1a71565c4b1bf8c7eeeb4aafd5df3dec98a7/cylp-0.2.3.1.tar.gz"
      }
    ],
    "0.2.3.2": [
      {
        "comment_text": "",
        "digests": {
          "md5": "fdacec50833d4b7dd7946fcd4e91b505",
          "sha256": "eb52c6e8930edbdb1220201ba90cca67eed364289b36e8f0c0ab7fe8087f3232"
        },
        "downloads": 2685,
        "filename": "cylp-0.2.3.2-py2.7-linux-i686.egg",
        "has_sig": false,
        "md5_digest": "fdacec50833d4b7dd7946fcd4e91b505",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 3972730,
        "upload_time": "2013-12-03T05:47:53",
        "url": "https://files.pythonhosted.org/packages/47/a7/053ac8ea7f3f53a93e2b823b8699d3dc655fd616b8fa5bc2d72637ba10a1/cylp-0.2.3.2-py2.7-linux-i686.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "62e0dd4ed0c6b5bf61ff7ef2a676aca1",
          "sha256": "68f55cbdb7c28eeca894e2c694edf923070adfd230111523c445f673369461e7"
        },
        "downloads": 2693,
        "filename": "cylp-0.2.3.2-py2.7-macosx-10.6-x86_64.egg",
        "has_sig": false,
        "md5_digest": "62e0dd4ed0c6b5bf61ff7ef2a676aca1",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 874631,
        "upload_time": "2013-12-02T18:23:38",
        "url": "https://files.pythonhosted.org/packages/91/4f/488688959c4bafee8abdc75c65b8c4438fb3ee1e470daa43bf78c2415793/cylp-0.2.3.2-py2.7-macosx-10.6-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "265363e30705408b01411692fc62df41",
          "sha256": "71b63badc140dd83d33dcbbaf1ec45dfc459f53aa3922debcd1f12fe8dee3373"
        },
        "downloads": 2739,
        "filename": "cylp-0.2.3.2.tar.gz",
        "has_sig": false,
        "md5_digest": "265363e30705408b01411692fc62df41",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1047189,
        "upload_time": "2013-12-02T20:22:00",
        "url": "https://files.pythonhosted.org/packages/4b/7f/89854b5fe276f93036232aa1371d9adc06a5d88ad0d5d0cddefabea4e7b3/cylp-0.2.3.2.tar.gz"
      }
    ],
    "0.2.3.3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "b09cf7f6199d6b2203778a0fb31f4b65",
          "sha256": "fbba7c2adced58a33027abfed116b483111ce6409eca4ac3fb2df5e678bc3944"
        },
        "downloads": 2700,
        "filename": "cylp-0.2.3.3-py2.7-linux-i686.egg",
        "has_sig": false,
        "md5_digest": "b09cf7f6199d6b2203778a0fb31f4b65",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 14308367,
        "upload_time": "2013-12-04T03:48:06",
        "url": "https://files.pythonhosted.org/packages/4b/76/64108040fc37d0f073f0d1b1d9543d0f1f3a2df525e4af64b736759c5452/cylp-0.2.3.3-py2.7-linux-i686.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "aef88e57eb9d0fa826e9c1d4ef50803a",
          "sha256": "838ade00294babffe0f69df7bd20f94fa6c1d5e328f89146d568ef83a8026ad2"
        },
        "downloads": 2581,
        "filename": "cylp-0.2.3.3-py2.7-linux-x86_64.egg",
        "has_sig": false,
        "md5_digest": "aef88e57eb9d0fa826e9c1d4ef50803a",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 15454310,
        "upload_time": "2013-12-07T02:19:42",
        "url": "https://files.pythonhosted.org/packages/6f/c5/b88534e7015fb96b2cd45edabffc803187761a37b4bf7221eedd999c7c85/cylp-0.2.3.3-py2.7-linux-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "23def25230d6d67d85075eeacd021c75",
          "sha256": "4b9bff104589d8c4408f7a6200c39e9d75dc07351f9681330253c37b6a3de75d"
        },
        "downloads": 2581,
        "filename": "cylp-0.2.3.3-py2.7-macosx-10.6-x86_64.egg",
        "has_sig": false,
        "md5_digest": "23def25230d6d67d85075eeacd021c75",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 12252070,
        "upload_time": "2013-12-06T15:01:52",
        "url": "https://files.pythonhosted.org/packages/4c/b1/f53177b81c10292f30ab213c9ff921774c6975f50adb1df41a8b0d39da20/cylp-0.2.3.3-py2.7-macosx-10.6-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "437d833b24bcaa6535831a72846882ef",
          "sha256": "0fc686d4de34287e49f88a83b6d9ddca179f1a964058cfd94866b4822382a98c"
        },
        "downloads": 2467,
        "filename": "cylp-0.2.3.3-py2.7-win32.egg",
        "has_sig": false,
        "md5_digest": "437d833b24bcaa6535831a72846882ef",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 3993942,
        "upload_time": "2013-12-08T06:20:30",
        "url": "https://files.pythonhosted.org/packages/b9/a6/9be047a41b1c31c99388bc2625aba34773a0ca9625f9ca767027a2de0309/cylp-0.2.3.3-py2.7-win32.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "c9318da389dbaa10b462ceae077bbcd6",
          "sha256": "346bd1d26bdbf63bdb795a156ac796bfe704737cf6737dcfa8c4d426dc63c5a6"
        },
        "downloads": 2680,
        "filename": "cylp-0.2.3.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c9318da389dbaa10b462ceae077bbcd6",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1047226,
        "upload_time": "2013-12-03T05:54:28",
        "url": "https://files.pythonhosted.org/packages/65/c3/7360982718fc25a275941dc80d5599dc29ed3944fc2f25d200ebc8d2b0b5/cylp-0.2.3.3.tar.gz"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "96ff585e397cf02aed05f4b3df583ecd",
          "sha256": "7313730d1bc1da5b427e39a33ac2e3d7225c5c74b410c08875ce694b9e129fdb"
        },
        "downloads": 1988,
        "filename": "cylp-0.2.3.3.win32-py2.7.exe",
        "has_sig": false,
        "md5_digest": "96ff585e397cf02aed05f4b3df583ecd",
        "packagetype": "bdist_wininst",
        "python_version": "2.7",
        "size": 4109153,
        "upload_time": "2013-12-08T13:49:23",
        "url": "https://files.pythonhosted.org/packages/7f/ab/db33d02c4af9151aa9254d6c741ecc0e0065fbce8effac1ccd433e09e324/cylp-0.2.3.3.win32-py2.7.exe"
      }
    ],
    "0.2.3.6": [
      {
        "comment_text": "",
        "digests": {
          "md5": "50aa3ff0f02d2f35696554cc367569ff",
          "sha256": "b97b0a515f30c6fcfab66d62a687682fe3f9c2771be105aa24cc2b7109e710f2"
        },
        "downloads": 2462,
        "filename": "cylp-0.2.3.6-py2.7-linux-x86_64.egg",
        "has_sig": false,
        "md5_digest": "50aa3ff0f02d2f35696554cc367569ff",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 15461533,
        "upload_time": "2013-12-13T00:59:44",
        "url": "https://files.pythonhosted.org/packages/5a/a0/15feeaa7987e29ef9f7b645c7af1c56c31abc58f83f655f91418a3f80f10/cylp-0.2.3.6-py2.7-linux-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "8dfa724c58b70d5efdd4e0d1fe37e42d",
          "sha256": "0cb62f6fbf366bc62127d546cd73ca58344111a2e23d2006b9009130c8b91405"
        },
        "downloads": 2461,
        "filename": "cylp-0.2.3.6-py2.7-macosx-10.6-x86_64.egg",
        "has_sig": false,
        "md5_digest": "8dfa724c58b70d5efdd4e0d1fe37e42d",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 12254605,
        "upload_time": "2013-12-13T00:20:38",
        "url": "https://files.pythonhosted.org/packages/b5/cb/61d5e96d5db2f76b1c0849a10d668d820887500aaca26de8681f79dc8df5/cylp-0.2.3.6-py2.7-macosx-10.6-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "a51c680cffd76cf350774ac4ac40c708",
          "sha256": "62c4c9ae99677c45a41916da7c3967205a3cc55602c2cf344bfadca4779e6a1e"
        },
        "downloads": 2382,
        "filename": "cylp-0.2.3.6-py2.7-win32.egg",
        "has_sig": false,
        "md5_digest": "a51c680cffd76cf350774ac4ac40c708",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 3994621,
        "upload_time": "2013-12-13T00:22:36",
        "url": "https://files.pythonhosted.org/packages/13/17/bbf2c9e155b3e47b853d2c586576bbc4edb7045c476fcca3db24d147cc70/cylp-0.2.3.6-py2.7-win32.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "189b9c0ba97bd2e4e4196ed44610913b",
          "sha256": "3db87b204e47d2f9727b75b08773a27d21ab07caed531f588efaf4edb28bc847"
        },
        "downloads": 3781,
        "filename": "cylp-0.2.3.6.tar.gz",
        "has_sig": false,
        "md5_digest": "189b9c0ba97bd2e4e4196ed44610913b",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1048938,
        "upload_time": "2013-12-13T00:19:20",
        "url": "https://files.pythonhosted.org/packages/60/90/90d2e23a6423d7461d34bedaf05978787f23b64b82d3619430ed10e468e9/cylp-0.2.3.6.tar.gz"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "8e86067bcf665e0a1593ade90c65c776",
          "sha256": "5f7c4d9b1ca36a4902907ead07b0a86122a9ce11022455b4700690de4356dab4"
        },
        "downloads": 1985,
        "filename": "cylp-0.2.3.6.win32-py2.7.exe",
        "has_sig": false,
        "md5_digest": "8e86067bcf665e0a1593ade90c65c776",
        "packagetype": "bdist_wininst",
        "python_version": "2.7",
        "size": 4109807,
        "upload_time": "2013-12-13T00:25:54",
        "url": "https://files.pythonhosted.org/packages/03/e0/68efa08c7baceab97adf09e5c7702a6c46791255bb89e1da4154b1628bbd/cylp-0.2.3.6.win32-py2.7.exe"
      }
    ],
    "0.2.3.7": [
      {
        "comment_text": "",
        "digests": {
          "md5": "e27331e3db07215aeab64b9b88ababf9",
          "sha256": "19ad3dda7d1a93e12fd79615355ef60cf083bca38f808256389ad5b0ef9dbafa"
        },
        "downloads": 1948,
        "filename": "cylp-0.2.3.7.win32-py2.7.exe",
        "has_sig": false,
        "md5_digest": "e27331e3db07215aeab64b9b88ababf9",
        "packagetype": "bdist_wininst",
        "python_version": "2.7",
        "size": 6172694,
        "upload_time": "2013-12-27T02:46:08",
        "url": "https://files.pythonhosted.org/packages/4d/f8/557be4dcb862385abd73d1ddc208bc16a2b35ec98d311f3a67915314b816/cylp-0.2.3.7.win32-py2.7.exe"
      }
    ],
    "0.7.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "627fb12eea82fac8747524f53404bedd",
          "sha256": "cf6f58ba92596325d9666e5dbd041dae38b2f7414be6a02d1206723cca9ad0c4"
        },
        "downloads": 2280,
        "filename": "cylp-0.7.0-py2.7-macosx-10.6-x86_64.egg",
        "has_sig": false,
        "md5_digest": "627fb12eea82fac8747524f53404bedd",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 9857073,
        "upload_time": "2014-01-13T00:04:24",
        "url": "https://files.pythonhosted.org/packages/a5/6c/938fc0a701c02dc0221c2c52b6fcc375939be853dde8bf6e7eb547db381a/cylp-0.7.0-py2.7-macosx-10.6-x86_64.egg"
      }
    ],
    "0.7.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "ef4078477d240b75d3cb4a82aab3f2f8",
          "sha256": "a0fe012274db32c19505444cd0c87f05ee44f50c33970addd0aebbfbd0708508"
        },
        "downloads": 2249,
        "filename": "cylp-0.7.1-py2.7-macosx-10.6-x86_64.egg",
        "has_sig": false,
        "md5_digest": "ef4078477d240b75d3cb4a82aab3f2f8",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 9857052,
        "upload_time": "2014-01-13T22:36:46",
        "url": "https://files.pythonhosted.org/packages/51/59/df0ccc9b65dcbefd4102af908ec3d8c227977a9ebef086f906c1fc037c7f/cylp-0.7.1-py2.7-macosx-10.6-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "d84d6f662b2b30b28dde2d9b0ef4e9f4",
          "sha256": "ffdddca4b782a8b792d0d85673d46015b0468b9604bb6ebce77bf3287bf41b5d"
        },
        "downloads": 2221,
        "filename": "cylp-0.7.1-py2.7-macosx-10.7-intel.egg",
        "has_sig": false,
        "md5_digest": "d84d6f662b2b30b28dde2d9b0ef4e9f4",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 9914688,
        "upload_time": "2014-01-13T22:21:11",
        "url": "https://files.pythonhosted.org/packages/85/90/127b04b7f05d686c56c4dae410159c0984864ace6c84a82a3af05b1daa04/cylp-0.7.1-py2.7-macosx-10.7-intel.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "a44342705f4676126e85b258e5414082",
          "sha256": "bc9b68055d50201734036b8f990435a788824aeeb3e26b606ff1ceedbd9b4dc3"
        },
        "downloads": 2199,
        "filename": "cylp-0.7.1-py2.7-macosx-10.9-intel.egg",
        "has_sig": false,
        "md5_digest": "a44342705f4676126e85b258e5414082",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 9902377,
        "upload_time": "2014-01-14T15:49:24",
        "url": "https://files.pythonhosted.org/packages/fd/d0/488c0af567d7321644330e12146aa6a6635d28133ec9cec9069b9b726b49/cylp-0.7.1-py2.7-macosx-10.9-intel.egg"
      }
    ],
    "0.7.2": [
      {
        "comment_text": "",
        "digests": {
          "md5": "e8b98044f9a5abbb747c6bf9c5e23f21",
          "sha256": "724393f54511da0c65b3f2e32a73ea522beb80b4f9ef8719eac70b795d7fcf80"
        },
        "downloads": 2133,
        "filename": "cylp-0.7.2-py2.7-linux-x86_64.egg",
        "has_sig": false,
        "md5_digest": "e8b98044f9a5abbb747c6bf9c5e23f21",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 15620046,
        "upload_time": "2014-03-29T21:29:06",
        "url": "https://files.pythonhosted.org/packages/a4/de/8a83d116acd61b523f62aaa77c43b40637e384939dc50b1daf2831588c91/cylp-0.7.2-py2.7-linux-x86_64.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "189f15f8867f6daea39576709544d7f0",
          "sha256": "a419ddbd4cd411872b44a01e847ede320bc0e3888e894ec5c7fc3c13a34a572d"
        },
        "downloads": 2085,
        "filename": "cylp-0.7.2-py2.7-macosx-10.9-intel.egg",
        "has_sig": false,
        "md5_digest": "189f15f8867f6daea39576709544d7f0",
        "packagetype": "bdist_egg",
        "python_version": "2.7",
        "size": 10005660,
        "upload_time": "2014-03-15T12:08:49",
        "url": "https://files.pythonhosted.org/packages/9e/ee/09b405c7473cac5fb5499767f93c456eb4800b4d5e820dcda425e47ffde4/cylp-0.7.2-py2.7-macosx-10.9-intel.egg"
      },
      {
        "comment_text": "",
        "digests": {
          "md5": "b0303dbed339a7a39740392cb1b08d12",
          "sha256": "b0a1dca5a57eb15ea6edbf4fe6b4c2ffd513e19d6cd48747550b1248b8e7073e"
        },
        "downloads": 1906,
        "filename": "cylp-0.7.2.win32-py2.7.exe",
        "has_sig": false,
        "md5_digest": "b0303dbed339a7a39740392cb1b08d12",
        "packagetype": "bdist_wininst",
        "python_version": "2.7",
        "size": 4216954,
        "upload_time": "2014-03-15T12:13:28",
        "url": "https://files.pythonhosted.org/packages/c1/26/e3ecbe1f90ee9aee54770c3e25a322c48f2eb6a9a9ef1fc6a6afd814255c/cylp-0.7.2.win32-py2.7.exe"
      }
    ],
    "0.7.3-": [
      {
        "comment_text": "",
        "digests": {
          "md5": "a168cc6afc10158d076aab45a5814850",
          "sha256": "98aa35e9dbc88553622c6ad9a320190317f96343d02fd5408d40267356a967bb"
        },
        "downloads": 1492,
        "filename": "cylp-0.7.3-.win32-py2.7.exe",
        "has_sig": false,
        "md5_digest": "a168cc6afc10158d076aab45a5814850",
        "packagetype": "bdist_wininst",
        "python_version": "2.7",
        "size": 4222985,
        "upload_time": "2014-11-12T21:18:55",
        "url": "https://files.pythonhosted.org/packages/83/96/853257304a1daf0780c871b15433108603f2ee16c29b512d30ba83292cbb/cylp-0.7.3-.win32-py2.7.exe"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "a168cc6afc10158d076aab45a5814850",
        "sha256": "98aa35e9dbc88553622c6ad9a320190317f96343d02fd5408d40267356a967bb"
      },
      "downloads": 1492,
      "filename": "cylp-0.7.3-.win32-py2.7.exe",
      "has_sig": false,
      "md5_digest": "a168cc6afc10158d076aab45a5814850",
      "packagetype": "bdist_wininst",
      "python_version": "2.7",
      "size": 4222985,
      "upload_time": "2014-11-12T21:18:55",
      "url": "https://files.pythonhosted.org/packages/83/96/853257304a1daf0780c871b15433108603f2ee16c29b512d30ba83292cbb/cylp-0.7.3-.win32-py2.7.exe"
    }
  ]
}