{
  "info": {
    "author": "20C",
    "author_email": "code@20c.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 4 - Beta",
      "License :: OSI Approved :: Apache Software License"
    ],
    "description": "Facsimile\n=========\n\nContents\n--------\n\n.toc 0\n\n\nIntroduction\n------------\n\nFacsimile is designed to create exact environment copies for local development\ninstances and deployed staging and production environments.\n\nIt supports multiple hosts, as well as multiple geographic regions.\n\nYou can use either by making a separate repo for a conglomerate, or by putting\ndefintions in config/facsimile.json\n\nInternals\n---------\n\n### Definitions\n\n* project : highest level of facsimile config, can contain other subprojects\n* modules : project wide pieces, these are used to specify any sections that might be used between subprojects, or need separate passwords, etc\n\n* instances :\n  An instance is a set of machines, acting on concert to\n  produce the full experience of using the platform. Another meaning of\n  instance, in the deploy sense, is the set of configurations (including extra\n  directory, instance.json, passwd.json generated file, etc) that allow the\n  instance to be updated using the deploy scripts.\n\ninstance data is shared across projects\n\n* targets : instances may be broken into different node types (e.g., frontend, database, app) called targets\n\n\n\nrename:\nAn instance in a daemon\n  level sense refers to the fact that we sometimes run more than one copy of the\n  same code, off the same binary filename - usually with different arguments.\n  For now we are doing this purely for an HA/LB or sharding perspective, but we may\n  add further uses as well (such as hot spares - our existing HA is load\n  balanced).\n\n* definition : defines a project down to each instance, contains no state info. Definitions can be inherited infinately to avoid redefining anything\n* state : configured and generated information that is instance specific.  For example, passwords, directories\n\n\nrm:\nper instance specific configuration for the deployment system to set up an install.\n* environment : environment specific\n* subinstance : sometimes, the 1:1 nature of the instance term becomes 1:2, or\n  1:3.. or 1:n. For example, iceberg: we don't want to separately maintain the\n  configurations for dev4.ch1's instance, dev0.ch0's instance, and\n  dev5.ch1's instance separately, and we want to keep the passwords and\nuiid in sync, for clarity.  However, there are subtle differences that should\nbe tracked. This is like an overlay, in a way - but it's for the whole\ninstance (in a deploy sense), not just one of the software packages.\n\n### Directory Layout\n\n* SRC/\n  source checkouts - not separated by instance, assumes version tags are enough\n* BUILD/\n  out of source build trees, subdirectoried under $instance/\n* define/\n  instance definition files\n\n* extra/\n  extra files to be deployed\n* tmpl/\n  tmpl files to be rendered and then deployed\n\n\nTemplates\n---------\n\nAvailable structures are `instance` and `module`\n\nconfig file templates should be kept with the source repository as much as possible, so changes are versioned along with the code that uses them\n\n\nModules\n-------\n\nname: module name\ngenconfig: should facs genarate a config for this\nwrite_sql: <remove>\n\ndb::\n\nClass Overrides\n---------------\n\n_init_<system>\n\n\n\nNotes\n-----\n\nif project name matches a directory in deploy, rsync --delete is used to clean up the deploy",
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/20c/facsimile",
    "keywords": null,
    "license": "LICENSE.txt",
    "maintainer": null,
    "maintainer_email": null,
    "name": "facsimile",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/facsimile/",
    "release_url": "https://pypi.org/project/facsimile/0.0.1/",
    "requires_python": null,
    "summary": "UNKNOWN",
    "version": "0.0.1"
  },
  "releases": {
    "0.0.1": []
  },
  "urls": []
}