{
  "info": {
    "author": "Facundo Batista, Nicolás Demarchi",
    "author_email": "facundo@taniquetil.com.ar, mail@gilgamezh.me",
    "bugtrack_url": "",
    "classifiers": [],
    "description": "What is fades?\n==============\n\n\n.. image:: https://travis-ci.org/PyAr/fades.svg?branch=master\n    :target: https://travis-ci.org/PyAr/fades\n.. image:: https://readthedocs.org/projects/fades/badge/?version=latest\n    :target: http://fades.readthedocs.org/en/latest/?badge=latest\n         :alt: Documentation Status\n.. image:: https://badge.fury.io/py/fades.svg\n    :target: https://badge.fury.io/py/fades\n.. image:: https://coveralls.io/repos/PyAr/fades/badge.svg?branch=master&service=github\n    :target: https://coveralls.io/github/PyAr/fades?branch=master\n\n\nfades is a system that automatically handles the virtualenvs in the\ncases normally found when writing scripts and simple programs, and\neven helps to administer big projects.\n\n.. image:: https://raw.githubusercontent.com/PyAr/fades/master/resources/logo256.png\n\n*fades* will automagically create a new virtualenv (or reuse a previous\ncreated one), installing the necessary dependencies, and execute\nyour script inside that virtualenv, with the only requirement\nof executing the script with *fades* and also marking the required\ndependencies.\n\n*(If you don't have a clue why this is necessary or useful, I'd recommend you\nto read this small text about* `Python and the Management of Dependencies\n<https://github.com/PyAr/fades/blob/master/docs/pydepmanag.rst>`_ *.)*\n\nThe first non-option parameter (if any) would be then the child program\nto execute, and any other parameters after that are passed as is to that\nchild script.\n\n*fades* can also be executed without passing a child script to execute:\nin this mode it will open a Python interactive interpreter inside the\ncreated/reused virtualenv (taking dependencies from ``--dependency`` or\n``--requirement`` options).\n\n.. contents::\n\n\nHow to use it?\n==============\n\nClick in the following image to see a video/screencast that shows most of\nfades features in just 5', but please keep reading for more detailed\ninformation...\n\n.. image:: https://raw.githubusercontent.com/PyAr/fades/master/resources/video/screenshot.png\n    :target: https://www.youtube.com/watch?v=BCTd_TyCm98\n\n\nYes, please, I want to read\n---------------------------\n\nWhen you write an script, you have to take two special measures:\n\n- need to execute it with *fades* (not *python*)\n\n- need to mark those dependencies\n\nAt the moment you execute the script, fades will search a\nvirtualenv with the marked dependencies, if it doesn't exists\nfades will create it, and execute the script in that environment.\n\n\nHow to execute the script with fades?\n-------------------------------------\n\nYou can always call your script directly with fades::\n\n    fades myscript.py\n\nHowever, for you to not forget about fades and to not execute it\ndirectly with python, it's better if you put at the beggining of\nthe script the indication for the operating system that it should\nbe executed with fades... ::\n\n    #!/usr/bin/fades\n\n...and also set the executable bit in the script::\n\n    chmod +x yourscript.py\n\n\nHow to mark the dependencies to be installed?\n---------------------------------------------\n\nThe procedure to mark a module imported by the script as a *dependency\nto be installed by fades* is by using a comment.\n\nThis comment will normally be in the same line of the import (recommended,\nless confusing and less error prone in the future), but it also can be in\nthe previous one.\n\nThe simplest comment is like::\n\n    import somemodule   # fades\n    from somepackage import othermodule    # fades\n\nThe ``fades`` is mandatory, in this examples the repository is PyPI,\nsee `About different repositories`_ below for other examples.\n\nWith that comment, *fades* will install automatically in the virtualenv the\n``somemodule`` or ``somepackage`` from PyPI.\n\nAlso, you can indicate a particular version condition, examples::\n\n    import somemodule   # fades == 3\n    import somemodule   # fades >= 2.1\n    import somemodule   # fades >=2.1,<2.8,!=2.6.5\n\nSometimes, the project itself doesn't match the name of the module; in\nthese cases you can specify the project name (optionally, before the\nversion)::\n\n    import bs4   # fades beautifulsoup4\n    import bs4   # fades beautifulsoup4 == 4.2\n\n\nOther ways to specify dependencies\n----------------------------------\n\nApart of marking the imports in the source file, there are other ways\nto tell *fades* which dependencies to install in the virtualenv.\n\nOne way is through command line, passing the ``--dependency`` parameter.\nThis option can be specified multiple times (once per dependency), and\neach time the format is ``repository::dependency``. The dependency may\nhave versions specifications, and the repository is optional (defaults\nto 'pypi').\n\nOther way is to specify the dependencies in a text file, one dependency\nper line, with each line having the format previously described for\nthe ``--dependency`` parameter. This file is then indicated to fades\nthrough the ``--requirement`` parameter.\n\nIn case of multiple definitions of the same dependency, command line\noverrides everything else, and requirements file overrides what is\nspecified in the source code.\n\nFinally, you can include package names in the script docstring, after\na line where \"fades\" is written, until the end of the docstring;\nfor example::\n\n    \"\"\"Script to do stuff.\n\n    It's a very important script.\n\n    We need some dependencies to run ok, installed by fades:\n        request\n        otherpackage\n    \"\"\"\n\n\nAbout different repositories\n----------------------------\n\n*fades* supports installing the required dependencies from multiples repositories: besides PyPI, you can specify URLs that can point to projects from GitHub, Launchpad, etc. (basically, everything that is supported by ``pip`` itself).\n\nWhen a dependency is specified, *fades* deduces the proper repository. For example, in the following examples *fades* will install requests from the latest revision from PyPI in the first case, and in the second case the latest revision from the project itself from GitHub::\n\n    -d requests\n    -d git+https://github.com/kennethreitz/requests.git#egg=requests\n\nIf you prefer, you can be explicit about which kind of repository *fades* should use, prefixing the dependency with the special token double colon (``::``)::\n\n    -d pypi::requests\n    -d vcs::git+https://github.com/kennethreitz/requests.git#egg=requests\n\n\nThere are two basic repositories: ``pypi`` which will make *fades* to install the desired dependency from PyPI, and ``vcs``, which will make *fades* to treat the dependency as a URL for a version control system site. In the first case, for PyPI, a full range of version comparators can be specified, as usual. For ``vcs`` repositories, though, the comparison is always exact: if the very same dependency is specified, a *virtualenv* is reused, otherwise a new one will be created and populated.\n\nIn both cases (specifying the repository explicitly or implicitly) there is no difference if the dependency is specified in the command line, in a ``requirements.txt`` file, in the script's docstring, etc.  In the case of marking the ``import`` directly in the script, it slightly different.\n\nWhen marking the ``import`` it normally happens that the package itself to be installed has the name of the imported module, and because of that it can only be found in PyPI. So, in the following cases the ``pypi`` repository is not only deduced, but unavoidable::\n\n    import requests  # fades\n    from foo import bar  # fades\n    import requests  # fades <= 3\n\nBut if the package is specified (normally needed because it's different than the module name), or if a version control system URL is specified, the same possibilities stated above are available: let *fades* to deduce the proper repository or mark it explicitly::\n\n    import bs4  # fades beautifulsoup\n    import bs4  # fades pypi::beautifulsoup\n    import requests  # fades git+https://github.com/kennethreitz/requests.git#egg=requests\n    import requests  # fades vcs::git+https://github.com/kennethreitz/requests.git#egg=requests\n\nOne last detail about the ``vcs`` repository: the format to write the URLs is the same (as it's passed without modifications) than what ``pip`` itself supports (see `pip docs <https://pip.readthedocs.io/en/stable/reference/pip_install/#vcs-support>`_ for more details).\n\n\nHow to control the virtualenv creation and usage?\n-------------------------------------------------\n\nYou can influence several details of all the virtualenv related process.\n\nThe most important detail is which version of Python will be used in\nthe virtualenv. Of course, the corresponding version of Python needs to\nbe installed in your system, but you can control exactly which one to use.\n\nNo matter which way you're executing the script (see above), you can\npass a ``-p`` or ``--python`` argument, indicating the Python version to\nbe used just with the number (``2.7``), the whole name (``python2.7``) or\nthe whole path (``/usr/bin/python2.7``).\n\nOther detail is the verbosity of *fades* when telling what is doing. By\ndefault, *fades* only will use stderr to tell if a virtualenv is being\ncreated, and to let the user know that is doing an operation that\nrequires an active network connection (e.g. installing a new dependency).\n\nIf you call *fades* with ``-v`` or ``--verbose``, it will send all internal\ndebugging lines to stderr, which may be very useful if any problem arises.\nOn the other hand if you pass the ``-q`` or ``--quiet`` parameter, *fades*\nwill not show anything (unless it has a real problem), so the original\nscript stderr is not polluted at all.\n\nSometimes, you want to run a script provided by one of the dependencies\ninstalled into the virtualenv. *fades* supports this via the ``-x`` (\nor ``--exec`` argument).\n\nIf you want to use IPython shell you need to call *fades* with ``-i`` or\n``--ipython`` option. This option will add IPython as a dependency to *fades*\nand it will launch this shell instead of the python one.\n\nYou can also use ``--system-site-packages`` to create a venv with access to the system libs.\n\n\nHow to deal with packages that are upgraded in PyPI\n---------------------------------------------------\n\nWhen you tell *fades* to create a virtualenv using one dependency and\ndon't specify a version, it will install the latest one from PyPI.\n\nFor example, you do ``fades -d foobar`` and it installs foobar in\nversion 7. At some point, there is a new version of foobar in PyPI,\nversion 8, but if do ``fades -d foobar`` it will just reuse previously\ncreated virtualenv, with version 7, not downloading the new version and\ncreating a new virtualenv with it!\n\nYou can tell fades to do otherwise, just do::\n\n    fades -d foobar --check-updates\n\n...and *fades* will search updates for the package on PyPI, and as it will\nfound version 8, will create a new virtualenv using the latest version.\n\nFrom this moment on, if you request ``fades -d foobar`` it will bring the\nvirtualenv with the new version. If you want to get a virtualenv with\nnot-the-latest version for any dependency, just specify the proper versions.\n\nYou can even use the ``--check-updates`` parameter when specifying the package\nversion. Say you call ``fades -d foobar==7``, *fades* will install version 7 no\nmatter which one is the latest. But if you do::\n\n    fades -d foobar==7 --check-updates\n\n...it will still use version 7, but will inform you that a new version\nis available!\n\n\nUnder the hood options\n----------------------\n\nFor particular use cases you can send specifics arguments to ``virtualenv``, ``pip`` and ``python``. using the\n``--virtuaenv-options``, ``--pip-options`` and ``--python-options`` respectively. You have to use that argument for each argument\nsent.\n\nExamples:\n\n``fades -d requests --virtualenv-options=\"--always-copy\" --virtualenv-options=\"--extra-search-dir=/tmp\"``\n\n``fades -d requests --pip-options=\"--index-url='http://example.com'\"``\n\n``fades --python-options=-B foo.py``\n\n\nSetting options using config files\n----------------------------------\n\nYou can also configure fades using `.ini` config files. fades will search config files in\n`/etc/fades/fades.ini`, the path indicated by `xdg` for your system\n(for example `~/config/fades/fades.ini`) and `.fades.ini`.\n\nSo you can have different settings at system, user and project level.\n\nWith fades installed you can get your config dir running::\n\n    python -c \"from fades.helpers import get_confdir; print(get_confdir())\"\n\n\nThe config files are in `.ini` format. (configparser) and fades will search for a `[fades]` section.\n\nYou have to use the same configurations that in the CLI. The only difference is with the config\noptions with a dash, it has to be replaced with a underscore.::\n\n    [fades]\n    ipython=true\n    verbose=true\n    python=python3\n    check_updates=true\n    dependency=requests;django>=1.8  # separated by semicolon\n\nThere is a little difference in how fades handle these settings: \"dependency\", \"pip-options\" and\n\"virtualenv-options\". In these cases you have to use a semicolon separated list.\n\nThe most important thing is that these options will be merged. So if you configure in\n`/etc/fades/fades.ini` \"dependency=requests\" you will have requests in all the virtualenvs\ncreated by fades.\n\n\nHow to clean up old virtualenvs?\n--------------------------------\n\nWhen using *fades* virtual environments are something you should not have to think about.\n*fades* will do the right thing and create a new virtualenv that matches the required\ndependencies. There are cases however when you'll want to do some clean up to remove\nunnecessary virtual environments from disk.\n\nBy running *fades* with the ``--rm`` argument, *fades* will remove the virtualenv\nmatching the provided uuid if such a virtualenv exists.\n\nAnother way to clean up the cache is to remove all venvs that haven't been used for some time.\nIn order to do this you need to call *fades* with ``--clean-unused-venvs``.\nWhen fades it's called with this option, it runs in mantain mode, this means that fades will exit\nafter finished this task.\nAll virtualenvs that haven't been used for more days than the value indicated in param will be\nremoved.\n\nIt is recommended to have some automatically way of run this option;\nie, add a cron task that perform this command::\n\n    fades --clean-unused-venvs=42\n\n\nSome command line examples\n--------------------------\n\n``fades foo.py --bar``\n\nExecutes ``foo.py`` under *fades*, passing the ``--bar`` parameter to the child program, in a virtualenv with the dependencies indicated in the source code.\n\n``fades -v foo.py``\n\nExecutes ``foo.py`` under *fades*, showing all the *fades* messages (verbose mode).\n\n``fades -d dependency1 -d dependency2>3.2 foo.py --bar``\n\nExecutes ``foo.py`` under *fades* (passing the ``--bar`` parameter to it), in a virtualenv with the dependencies indicated in the source code and also ``dependency1`` and ``dependency2`` (any version > 3.2).\n\n``fades -d dependency1``\n\nExecutes the Python interactive interpreter in a virtualenv with ``dependency1`` installed.\n\n``fades -r requirements.txt``\n\nExecutes the Python interactive interpreter in a virtualenv after installing there all dependencies taken from the ``requirements.txt`` file.\n\n``fades -d django -x django-admin.py startproject foo``\n\nUses the ``django-admin.py`` script to start a new project named ``foo``, without having to have django previously installed.\n\n``fades --rm 89a2bf83-c280-4918-a78d-c35506efd69d``\n\nRemoves a virtualenv matching the given uuid from disk and cache index.\n\n\nWhat if Python is updated in my system?\n---------------------------------------\n\nThe virtualenvs created by fades depend on the Python version used to\ncreate them, considering its major and minor version.\n\nThis means that if run fades with a Python version and then run it again\nwith a different Python version, it may need to create a new virtualenv.\n\nLet's see some examples. Let's say you run fades with ``python``, which\nis a symlink in your ``/usr/bin/`` to ``python3.4`` (running it directly\nby hand or because fades is installed to use that Python version).\n\nIf you have Python 3.4.2 installed in your system, and it's upgraded to\nPython 3.4.3, fades will keep reusing the already created virtualenvs, as\nonly the micro version changed, not minor or major.\n\nBut if Python 3.5 is installed in your system, and the default ``python``\nis pointed to this new one, fades will start creating all the\nvirtualenvs again, with this new version.\n\nThis is a good thing, because you want that the dependencies installed\nwith one specific Python in the virtualenv are kept being used by the\nsame Python version.\n\nHowever, if you want to avoid this behaviour, be sure to always call fades\nwith the specific Python version (``/usr/bin/python3.4`` or ``python3.4``,\nfor example), so it won't matter if a new version is available in the\nsystem.\n\n\nHow to install it\n=================\n\nSeveral instructions to install ``fades`` in different platforms.\n\nSimplest way\n------------\n\nIn some systems you can install ``fades`` directly, no needing to\ninstall previously any dependency.\n\nIf you are in debian unstable or testing, just do:\n\n    sudo apt-get install fades\n\nFor Arch linux:\n\n    yaourt -S fades\n\nFor Mac OS X (and `Homebrew <http://brew.sh/>`_):\n\n    brew install fades\n\nElse, keep reading to know how to install the dependencies first, and\n``fades`` in your system next.\n\n\nDependencies\n------------\n\nBesides needing Python 3.3 or greater, fades depends also on the\n``pkg_resources`` package, that comes in with ``setuptools``.\nIt's installed almost everywhere, but in any case,\nyou can install it in Ubuntu/Debian with::\n\n    apt-get install python3-setuptools\n\nAnd on Archlinux with::\n\n    pacman -S python-setuptools\n\nIt also depends on ``python-xdg`` package. This package should be\ninstalled on any GNU/Linux OS wiht a freedesktop.org GUI. However it\nis an **optional** dependency.\n\nYou can install it in Ubuntu/Debian with::\n\n    apt-get install python3-xdg\n\nAnd on Archlinux with::\n\n    pacman -S python-xdg\n\nFades also needs the `virtualenv <https://virtualenv.pypa.io/en/latest/>` package to\nsupport different Python versions for child execution. (see `--python` argument.)\n\n\nFor others debian and ubuntu\n----------------------------\n\nIf you are NOT in debian unstable or testing (if you are, see\nabove for better instructions), you can use this\n`.deb <http://taniquetil.com.ar/fades/fades-latest.deb>`_.\n\nDownload it and install doing::\n\n    sudo dpkg -i fades-latest.deb\n\n\nUsing pip if you want\n----------------------\n::\n\n    pip3 install fades\n\n\nMultiplatform tarball\n---------------------\n\nFinally you can always get the multiplatform tarball and install\nit in the old fashion way::\n\n    wget http://taniquetil.com.ar/fades/fades-latest.tar.gz\n    tar -xf fades-latest.tar.gz\n    cd fades-*\n    sudo ./setup.py install\n\n\nCan I try it without installing it?\n-----------------------------------\n\nYes! Branch the project and use the executable::\n\n    git clone https://github.com/PyAr/fades.git\n    cd fades\n    bin/fades your_script.py\n\n\nWhat about Windows?\n-------------------\n\nWindows is a platform supported by fades.\n\nHowever, we don't have a proper Windows installer (a ``.exe`` or\n``.msi``), but you can install it using ``pip``, or from the tarball,\nor try it directly from the project. All these options are properly\ndescribed above.\n\nWe *do* want to have a Windows installer. If you can help us in this\nregard, please contact us. Also we would want a Travis running in\nWindows so that GitHub runs all the tests in this platform too before\nlanding any code. Thanks!\n\n\nGet some help, give some feedback\n=================================\n\nYou can ask any question or send any recommendation or request to\nthe `mailing list <http://listas.python.org.ar/mailman/listinfo/fades>`_.\n\nCome chat with us on IRC. The #fades channel is located at the `Freenode <http://freenode.net/>`_ network.\n\nAlso, you can open an issue\n`here <https://github.com/PyAr/fades/issues/new>`_ (please do if you\nfind any problem!).\n\nThanks in advance for your time.\n\n\nHow to develop fades itself\n===========================\n\nQuick guide to get you up and running in fades development.\n\n\nGetting the code\n----------------\n\nClone the project::\n\n    git clone git@github.com:PyAr/fades.git\n\n\nInstall dependencies\n--------------------\n\n*fades* manages it's own dependencies, so there is nothing extra you need to install.\n\nTo try it, just do::\n\n    bin/fades -V\n\n\nHow to run the tests\n--------------------\n\nWhen starting development, at all times, and specially before wrapping up\na new branch, you need to be sure that all tests pass ok.\n\nThis is very simple, actually, just run::\n\n    ./test\n\nThat will not only check test cases, but also that the code complies with\naesthetic recommendations, and that the README document has a proper format.\n\nIf you want to run *one* particular test, just specify it. Example::\n\n    ./test tests.test_main:DepsMergingTestCase.test_two_different\n\n\nDevelopment process\n-------------------\n\nJust pick an issue from `the list <https://github.com/PyAr/fades/issues>`_.\n\nDevelop, assure ``./test`` is happy, commit, push, create a pull request, etc.\n\nPlease, if you aim for creating a Pull Request with new code (functionality\nor fixes), include tests for your changes.\n\nThanks! Enjoy.",
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/PyAr/fades",
    "keywords": null,
    "license": "GPL-3",
    "maintainer": null,
    "maintainer_email": null,
    "name": "fades",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/fades/",
    "release_url": "https://pypi.org/project/fades/6.0/",
    "requires_python": null,
    "summary": "A system that automatically handles the virtualenvs in the cases normally found when writing scripts and simple programs, and even helps to administer big projects.",
    "version": "6.0"
  },
  "releases": {
    "0.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "7f77f1417fcacf3250c261666d6144b2",
          "sha256": "bb3f7588663e81520d2ec49f953089ccd26f7eb598bf213df5ed37b86aa40f34"
        },
        "downloads": 1106,
        "filename": "fades-0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "7f77f1417fcacf3250c261666d6144b2",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 21876,
        "upload_time": "2015-02-07T21:18:56",
        "url": "https://files.pythonhosted.org/packages/57/94/9af5424c422b4f139e26ff32d7a717b7a64187ad2dc45ff2cfe7acc4d2eb/fades-0.1.tar.gz"
      }
    ],
    "1.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "ad46a7c512f150ab56e970eedbf84a7d",
          "sha256": "464192f792d4df137f08d4d2451296ce2255dc2009e7aa799edfc530a7c7a4e8"
        },
        "downloads": 1363,
        "filename": "fades-1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "ad46a7c512f150ab56e970eedbf84a7d",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 22206,
        "upload_time": "2015-02-07T22:49:00",
        "url": "https://files.pythonhosted.org/packages/e8/4a/b7abb3a7958fd59316bfff31b261faae18118251830751a09b45a579fd30/fades-1.0.tar.gz"
      }
    ],
    "2.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "e0d2689fa56be592501adcd6a1f9548d",
          "sha256": "72fb05c8560d3a613d050c85ccea1b0e63315bd29b5ccd591a088939ecbd875d"
        },
        "downloads": 1140,
        "filename": "fades-2.0.tar.gz",
        "has_sig": false,
        "md5_digest": "e0d2689fa56be592501adcd6a1f9548d",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 25430,
        "upload_time": "2015-02-27T17:12:04",
        "url": "https://files.pythonhosted.org/packages/7a/9f/a56161f7c3b4604fd34fccda8a816e70d9f0466cad3346c5b039857de530/fades-2.0.tar.gz"
      }
    ],
    "2.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "c0390cac992c23fcf4422c6b36276601",
          "sha256": "33d1a91230cc9815c0a3b0bba7ff809f5e49446d985d72bf4ec2dcdf8f9be71d"
        },
        "downloads": 1157,
        "filename": "fades-2.1.tar.gz",
        "has_sig": false,
        "md5_digest": "c0390cac992c23fcf4422c6b36276601",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 23857,
        "upload_time": "2015-02-27T17:54:05",
        "url": "https://files.pythonhosted.org/packages/8d/16/215f41cdac2dcc9642e63973e84672c012717dbb5b5498bf69abe98a8484/fades-2.1.tar.gz"
      }
    ],
    "3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "78bebd9cfa792c3f5a270c80b8c994fc",
          "sha256": "e321a33a3e875017b0d6d6464dd7dfebe002d6586783fce2789c28481c7b0f85"
        },
        "downloads": 3591,
        "filename": "fades-3.tar.gz",
        "has_sig": false,
        "md5_digest": "78bebd9cfa792c3f5a270c80b8c994fc",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 29224,
        "upload_time": "2015-06-16T22:40:58",
        "url": "https://files.pythonhosted.org/packages/51/a4/1454a6eb292ba720e14cde950ae560a62b74d55c505be678c591425910f0/fades-3.tar.gz"
      }
    ],
    "4": [
      {
        "comment_text": "",
        "digests": {
          "md5": "5084b92260b31afbe0aa430eb501475f",
          "sha256": "3f9b4eb13bf1ab22c18beb7bd14d0f73bdec41781d31a4e3bafbb4732fd0d98d"
        },
        "downloads": 649,
        "filename": "fades-4.tar.gz",
        "has_sig": false,
        "md5_digest": "5084b92260b31afbe0aa430eb501475f",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 32567,
        "upload_time": "2015-11-10T19:58:51",
        "url": "https://files.pythonhosted.org/packages/7c/77/370519772cba58940c2cb650395fd5c8526d43247c41fb10dfecd359b8f7/fades-4.tar.gz"
      }
    ],
    "5": [
      {
        "comment_text": "",
        "digests": {
          "md5": "791913189e5a1a987ff6f9f4b2905e37",
          "sha256": "1952f496059ba6bac535f2c07effae44a55de0654ababaa1a15879c4b3fa89c1"
        },
        "downloads": 227,
        "filename": "fades-5.tar.gz",
        "has_sig": false,
        "md5_digest": "791913189e5a1a987ff6f9f4b2905e37",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 36617,
        "upload_time": "2016-02-16T17:00:52",
        "url": "https://files.pythonhosted.org/packages/30/0c/ce5e0888a54eb9be01029425d08cee78b37723e4aaa4f58acf79277de011/fades-5.tar.gz"
      }
    ],
    "6.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "ac2c69b205a5b0cdd8893a018f2ecc0c",
          "sha256": "747ee3a159be1cb7512fd7ea4163d22e2734209e474aa2dbbccc29a0f0c92d09"
        },
        "downloads": 0,
        "filename": "fades-6.0.1.tar.gz",
        "has_sig": false,
        "md5_digest": "ac2c69b205a5b0cdd8893a018f2ecc0c",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 42965,
        "upload_time": "2017-05-15T19:01:33",
        "url": "https://files.pythonhosted.org/packages/59/18/cc80eb5c0a2e15c4b95df6a3c6158e06acb2e075ef2b811753936a6bdf57/fades-6.0.1.tar.gz"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "ac2c69b205a5b0cdd8893a018f2ecc0c",
        "sha256": "747ee3a159be1cb7512fd7ea4163d22e2734209e474aa2dbbccc29a0f0c92d09"
      },
      "downloads": 0,
      "filename": "fades-6.0.1.tar.gz",
      "has_sig": false,
      "md5_digest": "ac2c69b205a5b0cdd8893a018f2ecc0c",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 42965,
      "upload_time": "2017-05-15T19:01:33",
      "url": "https://files.pythonhosted.org/packages/59/18/cc80eb5c0a2e15c4b95df6a3c6158e06acb2e075ef2b811753936a6bdf57/fades-6.0.1.tar.gz"
    }
  ]
}