{
  "info": {
    "author": "",
    "author_email": "",
    "bugtrack_url": "",
    "classifiers": [
      "Framework :: Django :: 1.4"
    ],
    "description": "[hd stream] Supernatural Season 11 Episode 12 Don't You Forget About Me. We will be ready to watch online for it, the Supernatural s11e12 online. Please to know the title as Don't You Forget About Me. Sam and Dean drop in on Jody Mills, Claire and Alex after receiving a panicked phone call from Claire. She believes the recent murders in town are supernatural and wants the boys’ help. However, Sheriff Mills tells Sam and Dean that Claire has been getting into trouble lately as she’s been attacking normal people and accusing them of being monsters.\r\n\r\nA bit reminder from \"Into the Mystic\" Thirty years ago in Ireland, a man is killed after hearing a strange noise and being attacked. His wife banishes the creature but also dies, leaving only their baby alive. In the present day Sam & Dean investigate a case in a retirement home where one of the residents died in a similar manner. \r\n\r\nA resident named Mildred sees the creature commit it's second kill of the building manager. The brothers realize the creature is a Banshee, driving its victims insane with its voice before feeding on their brains. Sam is briefly captured by a a deaf woman posing as a housekeeper, Eileen. Eileen was the baby who was raised by a hunter after her parents died, her grandfather was a Men of Letters. \r\n\r\nThe banshee's screams also destroyed Eileen's hearing. Posing as Castiel, Lucifer searches the bunker for a way to kill Amara and Dean admits his connection to her but asks to keep it a secret from Sam. \"Castiel\" agrees saying maybe they can use this to draw Amara out. Assuming Mildred is the next target, the Winchesters and Eileen protect her but are caught off guard when the banshee targets Dean. \r\n\r\nMildred and Eileen are able to kill it. Eileen continues hunting while Mildred assumes Dean is attracted to someone out there. Later, Sam admits how Lucifer taunted him and apologizes for not looking for Dean while he was in Purgatory. Dean had forgiven him a long time ago. Sam is able to rest soundly, but Dean is still tormented by thoughts of Amara.\r\n\r\n100% working here:\r\n\r\nhttp://tinyurl.com/zfw2ds9\r\n\r\nhttp://tinyurl.com/gm5zobl\r\n\r\nSupernatural (season 11) spoilers to know more, The eleventh season of Supernatural, an American supernatural drama television series created by Eric Kripke, premiered on October 7, 2015, on The CW. The season will consist of 23 episodes and air on Wednesdays at 9:00 pm (ET). A very wonderful plot line, check this out then, watching the Supernatural s11e12 \"Don't You Forget About Me.\"",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "",
    "keywords": "",
    "license": "",
    "maintainer": "",
    "maintainer_email": "",
    "name": "hd-stream-supernatural-season-11-episode-12-dont-you-forget-about-me",
    "platform": "",
    "project_url": "https://pypi.org/project/hd-stream-supernatural-season-11-episode-12-dont-you-forget-about-me/",
    "release_url": "https://pypi.org/project/hd-stream-supernatural-season-11-episode-12-dont-you-forget-about-me/1.1.9/",
    "requires_python": null,
    "summary": "",
    "version": "1.1.9"
  },
  "releases": {
    "1.1.9": []
  },
  "urls": []
}