{
  "info": {
    "author": "Ryan Heuser, Josh Falk, Arto Anttila",
    "author_email": "heuser@stanford.edu",
    "bugtrack_url": null,
    "classifiers": [],
    "description": "# PROSODIC\n\nPROSODIC is a a metrical-phonological parser written in Python. Currently, it can parse English and Finnish text, but adding additional languages is easy with a pronunciation dictionary or a custom python function. PROSODIC was built by [Ryan Heuser](https://github.com/quadrismegistus), [Josh Falk](https://github.com/jsfalk), and [Arto Anttila](http://web.stanford.edu/~anttila/), beginning in the summer of 2010. Josh also maintains [another repository](https://github.com/jsfalk/prosodic1b), in which he has rewritten the part of this project that does phonetic transcription for English and Finnish. [Sam Bowman](https://github.com/sleepinyourhat) has contributed to the codebase as well, adding several new metrical constraints.\n\n## About PROSODIC\n\nPROSODIC does two main things. First, it tokenizes text into words, and then converts each word into its stressed, syllabified, phonetic transcription. Second, if desired, it finds the best available metrical parse for each line of text. In the style of Optimality Theory, (almost) all logically possibile parses are attempted, but the best parses are those that least violate a set of user-defined constraints. The default metrical constraints are those proposed by Kiparsky and Hanson in their paper \"A Parametric Theory of Poetic Meter\" (Language, 1996). See below for how these and other constraints are implemented.\n\n### Example of metrical parsing\n\nHere's an example of the metrical parser in action, on Shakespeare's first sonnet.\n\n\t[text]                                    \t\t\t\t[parse]                                   \n\tfrom fairest creatures we desire increase\t\t\t\tfrom|FAI|rest|CREA|tures|WE|de|SIRE|in|CREASE\n\tthat thereby beauty's rose might never die\t\t\t\tthat|THERE|by|BEAU|ty's|ROSE|might|NEV|er|DIE\n\tbut as the riper should by time decease \t\t\t\tbut|AS|the|RI|per|SHOULD|by|TIME|de|CEASE\n\this tender heir might bear his memory   \t\t\t\this|TEN|der|HEIR|might|BEAR|his|MEM|o|RY\n\tbut thou contracted to thine own bright eyes\t\t\tbut|THOU|con|TRACT|ed|TO|thine|OWN|bright|EYES\n\tfeed'st thy light's flame with self substantial fuel\tFEED'ST|thy|LIGHT'S|flame.with|SELF|sub|STAN|tial|FU|el\n\tmaking a famine where abundance lies    \t\t\t\tMAK|ing.a|FA|mine|WHERE|ab|UN|dance|LIES\n\tthy self thy foe to thy sweet self too cruel\t\t\tthy|SELF|thy|FOE|to.thy|SWEET.SELF|too|CRU|el\n\tthou that art now the world's fresh ornament\t\t\tthou|THAT|art|NOW|the|WORLD'S|fresh|OR|na|MENT\n\tand only herald to the gaudy spring     \t\t\t\tand|ON|ly|HER|ald|TO|the|GAU|dy|SPRING  \n\twithin thine own bud buriest thy content\t\t\t\twith|IN|thine|OWN|bud|BU|ri|EST|thy|CON|tent\n\tand tender churl mak'st waste in niggarding\t\t\t\tand|TEN|der|CHURL|mak'st|WASTE|in|NIG|gard|ING\n\tpity the world or else this glutton be  \t\t\t\tPI|ty.the|WORLD|or|ELSE|this|GLUT|ton|BE\n\tto eat the world's due by the grave and thee\t\t\tto|EAT|the|WORLD'S|due|BY|the|GRAVE|and|THEE\n\nNot bad, right? PROSODIC not only captures the sonnet's overall iambic meter, but also some of its variations. It accurately captures the trochaic inversions in the lines \"*Mak*ing a *fam*ine *where* a*bun*dance *lies*\" and \"*Pi*ty the *world* or *else* this *glut*ton *be*.\" Also, depending on the constraints, it also captures the double-strong beat that can often follow a double-weak beat in the line \"Thy *self* thy *foe* to thy *sweet self* too *cruel*\" (see, for this metrical pattern, [Bruce Hayes' review of Derek Attridge's *The Rhythms of English Poetry* in *Language* 60.1, 1984](http://www.linguistics.ucla.edu/people/hayes/Papers/Hayes1984ReviewOfAttridge.pdf)). It also gets some lines wrong: its interpretation of \"feed'st thy light's flame,\" for example. But how accurate is it on average?\n\n### Accuracy of metrical parser\n\nIn preliminary tests, we ran PROSODIC against a sample of 1800 hand-parsed lines of iambic, trochaic, anapestic, and dactylic verse ([included](https://github.com/quadrismegistus/prosodic/blob/master/tagged_samples/tagged-sample-litlab-2016.txt)). For example, here is a line, and how it was parsed by a human, PROSODIC, and the \"bare template\" of its poem's meter (iambic).\n\n\tLine:       Anxious  in  vain  to  find  the  distant  floor\n\n\tHuman:      ANxious  in  VAIN  to  FIND  the  DIStant  FLOOR\n                s   w    w   s     w   s     w    s  w     s\n\n\tPROSODIC:   ANxious  in  VAIN  to  FIND  the  DIStant  FLOOR\n                s   w    w   s     w   s     w    s  w     s\n\n\tTemplate:   anXIOUS  in  VAIN  to  FIND  the  DIStant  FLOOR\n                w   s    w   s     w   s     w    s  w     s\n\t            *   *\n\nWe can see that PROSODIC gets this line right; the template gets most of it right, missing only the trochaic inversion. By running all of the lines through in this way (using the `/eval` command of PROSODIC [see below]) we can see what percentage of syllables both PROSODIC and a template \"correctly\" capture—where \"correct\" is to agree with the human parse.\n\n<table>\n\t<thead align=center>\n\t\t<tr>\n\t\t\t<th colspan=\"5\">% Syllables Correctly Parsed</th>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<th></th>\n\t\t\t<th width=140>Another Human</th>\n\t\t\t<th width=140>PROSODIC</th>\n\t\t\t<th width=140>Base Template (for this meter)</th>\n\t\t\t<th width=140>Base Template (iambic meter)</th>\n\t\t</tr>\n\t</thead>\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Iambic lines</td>\n\t\t\t<td>93.7%</td>\n\t\t\t<td>92.6%</td>\n\t\t\t<td>89.0%</td>\n\t\t\t<td>89.0%</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Trochaic lines</td>\n\t\t\t<td>98.8%</td>\n\t\t\t<td>94.5%</td>\n\t\t\t<td>95.3%</td>\n\t\t\t<td>4.5%</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Anapestic lines</td>\n\t\t\t<td>97.2%</td>\n\t\t\t<td>84.7%</td>\n\t\t\t<td>66.1%</td>\n\t\t\t<td>52.9%</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Dactylic lines</td>\n\t\t\t<td>95.8%</td>\n\t\t\t<td>83.8%</td>\n\t\t\t<td>75.6%</td>\n\t\t\t<td>49.7%</td>\n\t\t</tr>\n\t</tbody>\n</table>\n\nThe extent to which two human taggers (both English literature Ph.D. students) agree is in the first column: given that metrical scansion inevitably varies from person to person, this might be taken as the upper threshold of what we could expect PROSODIC to do. But PROSODIC is not too far off, especially for the binary meters (iambic and trochaic). The ternary meters are more complicated: they depart more often from their metrical templates, as can be seen in the third column. But the third column of metrical templates assumes that we already know the meter of the poem (which, in this evaluation sample, we do). Not surprisingly, if we don't already know the meter, and simply apply an iambic temlpate to every poem, then it works well for iambic poems, but not at all for poems of other meters—as can be seen in the fourth column. This means that, *for parsing poems whose meter is unknown*, or for parsing free verse poems or even prose, PROSODIC is especially useful. Parsing lines individually, and agnostic as to the meter of \"the poem,\" PROSODIC is nonetheless able to discover the basic contours of the metrical patterns in the lines. In [another research project](https://github.com/quadrismegistus/litlab-poetry), run out of the [Stanford Literary Lab](http://litlab.stanford.edu/), PROSODIC's parses were able to predict the overall meter in 200 poems with about 98% accuracy.\n\nThe data above were produced when the meter was defined as the following constraints and weights: `[*strength.s=>-u/3.0] [*strength.w=>-p/3.0] [*stress.s=>-u/2.0] [*stress.w=>-p/2.0] [*footmin-none/1.0] [*footmin-no-s-unless-preceded-by-ww/10.0] [*posthoc-no-final-ww/2.0] [*posthoc-standardize-weakpos/1.0] [*word-elision/1.0]`. These and other constraints are mentioned below, but are best documented in their confuration file, `config.py`.\n\n[One final note: these human annotations—made by literature Ph.D. students—embody certain assumptions about meter that are common in literary, but not linguistic circles. For instance, representing a trochaic inversion as a literal inversion of feet, \"swws,\" is not how Kiparsky would represent it; for him, a trochaic inversion is simply a conventional, permissible violation of the iambic meter. However, PROSODIC doesn't necessarily commit itself to either of these theories or approaches: parses that conform to either theory can be generated using different sets of constraints.]\n\n\n## Installation\n\n### Quick start\n\nTo install PROSODIC, it's best to clone the github repository here. To do that, type this into the terminal:\n\n\tgit clone git@github.com:quadrismegistus/prosodic.git\n\t\n[If you don't have git, you can [get it here](https://git-scm.com/downloads).] Or, you can also [download the repository as a zip file](https://github.com/quadrismegistus/prosodic/archive/master.zip), and unzip it. Either method will create a directory called \"prosodic.\" Enter that folder in the terminal, and boot up prosodic by typing:\n\n\tpython prosodic.py\n\t\nPROSODIC can also be used as a python module within your own applications:\n\n\timport prosodic as p\n\ttext = p.Text(\"Shall I compare thee to a summer's day?\")\n\ttext.parse()\n\nInstructions on how to use PROSODIC in interactive mode, and as a python module, are below. \n\n### Dependencies\n\n#### Text to speech engine for parsing unknown English words\n\nBy default, PROSODIC uses the CMU pronunciation dictionary to discover the syllable boundaries, stress pattern, and other information about English words necessary for metrical parsing. Lines with words not in this dictionary are, again by default, skipped when parsing. However, with a Text-to-Speech engine, it's possible to \"sound out\" unknown English words into a stressed, syllabified form that can then be parsed. PROSODIC supports two TTS engines: *espeak* (recommended), and *OpenMary*. I find that espeak produces better syllabifications than OpenMary (at least for English), and is simpler to use, but either will work just fine.\n\n##### Setting up espeak\n\n[Espeak](http://espeak.sourceforge.net/) is an open-source TTS engine for Windows and Unix systems (including Mac OS X). You can [download it for your operating system here](http://espeak.sourceforge.net/download.html). But if you're running Mac OS X, an even simpler way to install espeak is via the [HomeBrew package manager](http://brew.sh/). To do so, install homebrew if you haven't, and then run in a terminal: `brew install espeak`. After you've installed espeak, set the \"en_TTS_ENGINE\" flag in the *config.py* file to \"espeak.\" That's it!\n\n<small>*Note:* Espeak produces *un*-syllabified IPA transcriptions of any given (real or unreal) word. To syllabify these, the [syllabifier](https://p2tk.svn.sourceforge.net/svnroot/p2tk/python/syllabify/syllabifier.py) from the [Penn Phonetics Toolkit (P2TK)](https://www.ling.upenn.edu/phonetics/old_website_2015/p2tk/) is used. An extra plus from this pipeline is consistency: this same syllabifier is responsible for the syllable boundaries in the CMU pronunciation dictionary, which PROSODIC draws from (if possible) before resorting to a TTS engine.</small>\n\n##### Setting up OpenMary\n\nOpenMary is another open-source TTS engine, written in Java and developed by two German research institutes: the [DFKI](http://www.dfki.de/web)'s [Language Technology Lab](http://www.dfki.de/lt/) and [Saarland University](http://www.uni-saarland.de/startseite.html)'s [Institute of Phonetics](http://www.coli.uni-saarland.de/groups/WB/Phonetics/). To install OpenMary, first [download it here](http://mary.dfki.de/download/index.html) [select the \"Run time package\" link]. Then, unzip the zip file, go into the unzipped folder, and start OpenMary as a server. To do that, type into the terminal after unzipping: `./marytts-5.2/bin/marytts-server.sh`. To use OpenMary in PROSODIC, you'll have to make sure OpenMary is running as a server process beforehand; if not, you'll have to repeat the last command. For espeak, this step isn't necessary.\n\n#### Python module dependencies\n\nBy default, PROSODIC has no module dependencies. The modules it does use—[lexconvert](http://people.ds.cam.ac.uk/ssb22/gradint/lexconvert.html), [P2TK](https://www.ling.upenn.edu/phonetics/old_website_2015/p2tk/)'s [syllabify.py](https://p2tk.svn.sourceforge.net/svnroot/p2tk/python/syllabify/syllabifier.py), and a [python hyphenator for syllabifying English orthography](https://github.com/Kozea/Pyphen)—are small, and already included in the repository. However, there are a few exceptions, depending on what you want to do. To install these modules, first [install pip](https://pip.pypa.io/en/stable/installing/) if you haven't yet.\n\n- If you'd like to use the built-in query language (available under \"/query\" in the interactive mode), you'll need to install pyparsing: `pip install pyparsing`.\n- If you're running OpenMary, you'll need to install the xml parser Beautiful Soup 4, and the unicode module unidecode: `pip install bs4` and `pip install unidecode`.\n- If you'd like to be able to read evaluation data in spreadsheet form (*.xls, *.xlsx) (available under \"/eval\" in interactive mode), you'll need to install xlrd: `pip install xlrd`.\n\n\n\n## Usage\n\nThere are two main ways of using PROSODIC: in interactive mode, and, for more Python-advanced users, as a Python module.\n\n### Interactive mode\n\nYou can enter the interactive mode of prosodic by running `python prosodic.py`. This will bring you to an interface like this:\n\n\t################################################\n\t## welcome to prosodic!                  v1.1 ##\n\t################################################\n\n\n\t\t[please type a line of text, or enter one of the following commands:]\n\t\t\t/text\tload a text\n\t\t\t/corpus\tload folder of texts\n\t\t\t/paste\tenter multi-line text\n\n\t\t\t/eval\tevaluate this meter against a hand-tagged sample\n\t\t\t/mute\thide output from screen\n\t\t\t/save\tsave previous output to file\n\t\t\t/exit\texit\n\n\t>> [0.0s] prosodic:en$ \n\n#### Loading text\n\nThe first thing to do when using PROSODIC is to give it some text to work with. There's a few ways of doing this. The simplest way is to simply a type in a line, one at a time. You can also type `/paste`, and then enter or copy/paste multiple lines in at a time. You can also type `/text` to load a text, or `/corpus` to load a folder of text files. If you do, you'll be given instructions on how either to specify a relative path from within PROSODIC's corpus folder, or an absolute path to another file or folder on your disk. You can also define the text you want to work with as an argument for the command you use to boot PROSODIC with: `python prosodic.py /path/to/my/file.txt`.\n\n#### Checking phonetic/phonological annotations\n\nEven before metrically parsing the text you've loaded (see below), you can run a few commands to test out how PROSODIC has interpreted the text in terms of its phonetics and phonology. The command `/show` will show the phonetic transcription and stress- and weight-profiles for each word:\n\n    000001  of                      P:ʌv                                S:U     W:L\n    000002  mans                    P:'mænz                             S:P     W:H\n    000003  first                   P:'fɛːst                            S:P     W:H\n    000004  disobedience            P:`dɪ.sə.'biː.diː.əns               S:SUPUU W:LLHHH\n    000005  and                     P:ænd                               S:U     W:L\n    000006  the                     P:ðə                                S:U     W:L\n    000007  fruit                   P:'fruːt                            S:P     W:H\n\nThe command `/tree` shows a hierarchical description of each word's phonology, as it is embedded in the hierarchical organization of the text. For instance, the beginning of the output from `/tree` for this line would be:\n\n\t-----| (S1) <Stanza>\n\t      |\n\t      |-----| (S1.L1) <Line>                                                                       [of mans first disobedience and the fruit]\n\t            |\n\t            |-----| (S1.L1.W1) <Word>\tof\t<ʌv>\n\t                  |     [+functionword]\n\t                  |     [numSyll=1]\n\t                  |\n\t                  |-----| (S1.L1.W1.S1) <Syllable>                                                 [ʌv]\n\t                        |     [prom.stress=0.0]\n\t                        |\n\t                        |-----| (S1.L1.W1.S1.SB1) <SyllableBody>                                   [ʌv]\n\t                              |     [shape=VC]\n\t                              |     [-prom.vheight]\n\t                              |     [-prom.weight]\n\t                              |\n\t                              |-----| (S1.L1.W1.S1.SB1.O1) <Onset>\n\t                              |\n\t                              |-----| (S1.L1.W1.S1.SB1.R2) <Rime>\n\t                                    |\n\t                                    |-----| (S1.L1.W1.S1.SB1.R2.N1) <Nucleus>\n\t                                          |     [-prom.vheight]\n\t                                          |\n\t                                          |-----| (S1.L1.W1.S1.SB1.R2.N1.P1) <Phoneme>             [ʌ]\n\t                                    |\n\t                                    |-----| (S1.L1.W1.S1.SB1.R2.C2) <Coda>\n\t                                          |\n\t                                          |-----| (S1.L1.W1.S1.SB1.R2.C2.P1) <Phoneme>             [v]\n\t            |\n\t            |-----| (S1.L1.W2) <Word>\tmans\t<'mænz>\n\t                  |     [numSyll=1]\n\t                  |\n\t                  |-----| (S1.L1.W2.S1) <Syllable>                                                 ['mænz]\n\t                        |     [prom.stress=1.0]\n\t                        |     [prom.kalevala=1.0]\n\t                        |\n\t                        |-----| (S1.L1.W2.S1.SB1) <SyllableBody>                                   [mænz]\n\t                              |     [shape=CVCC]\n\t                              |     [-prom.vheight]\n\t                              |     [+prom.weight]\n\t                              |\n\t                              |-----| (S1.L1.W2.S1.SB1.O1) <Onset>\n\t                                    |\n\t                                    |-----| (S1.L1.W2.S1.SB1.O1.P1) <Phoneme>                      [m]\n\t                              |\n\t                              |-----| (S1.L1.W2.S1.SB1.R2) <Rime>\n\t                                    |\n\t                                    |-----| (S1.L1.W2.S1.SB1.R2.N1) <Nucleus>\n\t                                          |     [-prom.vheight]\n\t                                          |\n\t                                          |-----| (S1.L1.W2.S1.SB1.R2.N1.P1) <Phoneme>             [æ]\n\t                                    |\n\t                                    |-----| (S1.L1.W2.S1.SB1.R2.C2) <Coda>\n\t                                          |\n\t                                          |-----| (S1.L1.W2.S1.SB1.R2.C2.P1) <Phoneme>             [n]\n\t                                          |\n\t                                          |-----| (S1.L1.W2.S1.SB1.R2.C2.P2) <Phoneme>             [z]\n\nLastly, the `/query` command allows you to query these phonological annotations. Once `/query` is entered, the query language parser starts up (type `/` to exit, or hit `Ctrl+D`). Which are the stressed syllables in the text? `(Syllable: [+prom.stress])`. Which are all the voiced phonemes? `(Phoneme: [+voice])`. Which are all the syllables with voiced onsets and codas? `(Syllable: (Onset: [+voice]) (Coda: [+voice]))`. Etc.\n\n\n#### Metrically parsing text\n\nThe command `/parse` will metrically parse whatever text is currently loaded into PROSODIC. Once the text is parsed, further commands become possible, all of which either view or save the data gleaned from the parser.\n\nThe command `/scan` prints the best parse for each line, along with statistics on which constraints it violated. [This output, like any other output, can be saved to disk (and then opened with Excel) by using the `/save` command.] For instance, here are the first four lines of *Paradise Lost*, using the `/scan` command:\n\n\ttext                                    \t\tparse                                   \t\t#pars\t#viol\tmeter\t\t\t[*footmin-none]\t[*strength.s=>-u]\t[*strength.w=>-p]\t[*stress.s=>-u]\t[*stress.w=>-p]\n\tof mans first disobedience and the fruit\t\tof|MANS|first|DI|so|BE|di|ENCE|and.the|FRUIT\t3\t\t5\t\twswswswswws\t\t0\t\t\t\t0\t\t\t\t\t2\t\t\t\t\t2\t\t\t\t1\n\tof that forbidden tree whose mortal tast\t\tof|THAT|for|BID|den|TREE|whose|MOR|tal|TAST\t\t1\t\t0\t\twswswswsws\t\t0\t\t\t\t0\t\t\t\t\t0\t\t\t\t\t0\t\t\t\t0\n\tbrought death into the world and all our woe\tbrought|DEATH|in|TO|the|WORLD|and|ALL|our|WOE\t1\t\t2\t\twswswswsws\t\t0\t\t\t\t0\t\t\t\t\t0\t\t\t\t\t2\t\t\t\t0\n\twith loss of eden till one greater man  \t\twith|LOSS|of|ED|en|TILL|one|GRE|ater|MAN\t\t1\t\t2\t\twswswswsws\t\t0\t\t\t\t0\t\t\t\t\t2\t\t\t\t\t0\t\t\t\t0\n\n\n\nThe command `/report` is a more verbose version of `/scan`, printing each possible (i.e. non-harmonically-bounded) parse for each line. For instance, for each line, it produces an output like:\n\n\t==============================\n\t[line #1 of 4]: of mans first disobedience and the fruit\n\n\t\t--------------------\n\t\t[parse #3 of 3]: 8.0 errors\n\t\t1\tw\tof        \t\n\t\t2\ts\tMANS      \t\n\t\t3\tw\tfirst     \t[*stress.w=>-p]\n\t\t4\ts\tDI        \t\n\t\t5\tw\tso        \t\n\t\t6\ts\tBE        \t\n\t\t7\tw\tdi        \t\n\t\t8\ts\tENCE      \t[*stress.s=>-u]\n\t\t9\tw\tand       \t\n\t\t10\ts\tTHE       \t[*stress.s=>-u]\n\t\t11\tw\tfruit     \t[*stress.w=>-p]\n\t\n\t\t[*stress.s=>-u]: 4.0  [*stress.w=>-p]: 4.0  \n\t\t--------------------\n\t\n\t\t--------------------\n\t\t[parse #2 of 3]: 5.0 errors\n\t\t1\tw\tof        \t\n\t\t2\ts\tMANS      \t\n\t\t3\tw\tfirst     \t[*stress.w=>-p]\n\t\t4\ts\tDI        \t\n\t\t5\tw\tso        \t\n\t\t6\ts\tBE        \t\n\t\t7\tw\tdi ence   \t[*footmin-none]\n\t\t8\ts\tAND       \t[*stress.s=>-u]\n\t\t9\tw\tthe       \t\n\t\t10\ts\tFRUIT     \t\n\t\n\t\t[*footmin-none]: 1.0  [*stress.s=>-u]: 2.0  [*stress.w=>-p]: 2.0  \n\t\t--------------------\n\t\n\t\t--------------------\n\t\t[parse #1 of 3]: 5.0 errors\n\t\t1\tw\tof        \t\n\t\t2\ts\tMANS      \t\n\t\t3\tw\tfirst     \t[*stress.w=>-p]\n\t\t4\ts\tDI        \t\n\t\t5\tw\tso        \t\n\t\t6\ts\tBE        \t\n\t\t7\tw\tdi        \t\n\t\t8\ts\tENCE      \t[*stress.s=>-u]\n\t\t9\tw\tand the   \t[*footmin-none]\n\t\t10\ts\tFRUIT     \t\n\t\n\t\t[*footmin-none]: 1.0  [*stress.s=>-u]: 2.0  [*stress.w=>-p]: 2.0  \n\t\t--------------------\n\t\n\t==============================\n\nFinally, you can also save a variety of statistics from the metrical parser in tab-separated form by running the `/stats` command.\n\n#### Evaluating the meter against a hand-parsed sample\n\nHow well does PROSODIC do when its metrical parses are compared with those that a human reader has annotated? The statistics above, in \"Accuracy of metrical parser,\" were generated from the evaluation command: `/eval`. From there, you can select a spreadsheet (either a tab-separated text file or an excel document) saved in the `tagged_samples/` folder to use as the \"ground truth\", human-annotated parse. The `/eval` command will ask which columns in the file correspond to the line (\"Of man's first disobedience and the fruit\"), the parse (\"wswswswwsws\"), and (optionally) the meter of the line (\"iambic\"). PROSODIC will then parse the lines under the \"line\" column (using, as always, the current configuration of metrical constraints in `config.py`), and save statistics to the same folder in tab-separated form. The spreadsheet used in the above accuracy table is provided, made by the Stanford Literary Lab's [poetry project](http://github.com/quadrismegistus/litlab-poetry) in 2014 and 2016.\n\n### Configuration options\n\nAll configuration of PROSODIC takes place in `config.py` in the root folder of PROSODIC. This file is well-commented and is the best source of documentation on how to use it. (It's best to edit this file inside a text editor that highlights the Python syntax, so you can visually see which settings are deactivated by being \"commented-out,\" i.e. by having a \"#\" character at the start of their lines.) Here is a list of what you will find there.\n\n* Technical options about how PROSODIC works:\n\t* The paths used for corpora, results, and tagged samples\n\t* The language used (currently, English or Finnish)\n\t* Which Text-to-Speech engine, if any, is used for parsing unknown English words\n\t* Whether to print output to screen\n* Options about metrical parsing:\n\t* The minimum and maximum size of metrical positions (from a mora to two or more syllables)\n\t* The constraints used in metrical parsing, some of which are:\n\t\t* Constraints proposed by Kiparsky and Hanson in \"A Parametric Theory of Poetic Meter\" (*Language*, 1996):\n\t\t\t* *Strength*: A weak/strong syllable should not be in a strong/weak metrical position.\n\t\t\t* *Stress*: An unstressed/stressed syllable should not bein a strong/weak metrical position.\n\t\t\t* *Weight*: A light/heavy syllable should not be in a strong/weak metrical position.\n\t\t\t* *Minimal foot*: a disyllabic metrical position should not contain more than a minimal foot (only if the syllables are weighted light-heavy or light-light is a disyllabic position allowed).\n\t\t* Other constraints regulating disyllabic metrical positions\n\t\t* Constraints allowing the initial parts of lines to be extrametrical\n\t\t* Constraints regulating word elisions (e.g. \"Plu-ton-i-an\" becoming \"Plu-ton-ian\")\n\t* What to pass to the metrical parser: a line in the text file, a line between punctuation markers, etc.\n* Options about words and tokenization:\n\t* The regular expression used for word tokenization\n\t* For words with multiple stress profiles (e.g. \"INto\" and \"inTO\"), whether to allow the metrical parser to choose the stress profile based on whichever works best metrically in the line\n\t* Whether to allow elided pronunciations (e.g. \"Plu-ton-ian\" for \"Plu-ton-i-an\") as metrical possibilities also\n\t* How to display the phonetic output for words (IPA, orthography, CMU notation)\n\nAgain, please see the documentation within `config.py` for more information.\n\t\n\n### Running PROSODIC as a python module\n\nPROSODIC can also be run within other python applications.\n\n\tIn [1]: import prosodic as p\n\t\n\tIn [2]: t = p.Text(\"corpora/shakespeare/sonnet-001.txt\")\n\t\n\tIn [3]: t.parse()\n\t\n\tIn [4]: for parse in t.bestParses():\n\t   ...:     print parse\n\t   ...:     \n\tfrom|FAI|rest|CREA|tures|WE|de|SIRE|in|CREASE\n\tthat|THERE|by|BEAU|ty's|ROSE|might|NEV|er|DIE\n\t[...]\n\nFor more information on this, please see [the Wiki](https://github.com/quadrismegistus/prosodic/wiki).\n\n\n## How it works\n\nHow does PROSODIC work? Here is an overview of its two major aspects: how words are tokenized, phonetically transcribed, syllabified, and stressed; and then how that information is used to find the optimal metrical parse according to a set of constraints.\n\n### From text, to words, to phonetics and phonology\n\nPROSODIC first encounters a piece of English or Finnish text. It tokenizes that text according to a user-defined tokenizer, set under the option \"tokenizer\" in `config.py`, defaulting to splitting lines into words by whitespace and hyphens. In Finnish text, a pure-Python implementation of Finnish IPA-transcription and syllabification is provided, built by Josh Falk. In English, the process is more complicated. If the word is found in the [CMU pronunciation dictionary](http://www.speech.cs.cmu.edu/cgi-bin/cmudict), its syllabified, stressed, phonetic transcription is used. If not, a text-to-speech engine is used to \"sound out\" the unknown word, and then a syllabifier is used to break the stressed IPA transcription into syllables. For details on which text-to-speech engine and syllabifier are used, see above, \"Text to speech engine for parsing unknown English words.\"\n\nWith these phonetic-phonological transcriptions, PROSODIC builds each word as a hierarchy of its constituent parts. For instance, the English word \"love\" is interpreted:\n\n\t| (W1) <Word>\tlove\t<'l ah v>\n\t|     [numSyll=1]\n\t|\n\t|-----| (W1.S1) <Syllable>                               \n\t      |     [prom.stress=1.0]\n\t      |\n\t      |-----| (W1.S1.SB1) <SyllableBody>\n\t            |     [shape=CVC]\n\t            |     [+prom.weight]\n\t            |\n\t            |-----| (W1.S1.SB1.O1) <Onset>\n\t                  |\n\t                  |-----| (W1.S1.SB1.O1.P1) <Phoneme>          [l]\n\t            |\n\t            |-----| (W1.S1.SB1.R2) <Rime>\n\t                  |\n\t                  |-----| (W1.S1.SB1.R2.N1) <Nucleus>\n\t                        |\n\t                        |-----| (W1.S1.SB1.R2.N1.P1) <Phoneme> [ʌ]\n\t                  |\n\t                  |-----| (W1.S1.SB1.R2.C2) <Coda>\n\t                        |\n\t                        |-----| (W1.S1.SB1.R2.C2.P1) <Phoneme> [v]\n\n\nDue to this hierarchical organization, sophisticated queries become possible on the linguistic structures in their interrelationships. In other words, since the hierarchy defines basic \"child-of\" or \"contained-in\" relationships between linguistic structures, it is possible to query for, say, \"all onsets *with* at least one voiced consonant *in* stressed syllables.\" (For more details on the included query language, see above).\n\n### From phonology to metrics\n\nOnce these phonetic and phonological annotations on words are in place, metrical parsing can then use them as it tries to maximize the correspondence between metrically strong positions and, say, syllable stress. The parsing is performed in the spirit of Optimality Theory: (almost) all logically possibile parses are attempted, but the best parses are those that least violate a set of user-defined constraints. If Parse A's total violation score is, for each constraint, the same as Parse B's, but there is at least one constraint where Parse A's violation score is even worse than Parse B's—then parse A is \"harmonically bounded\" by parse B. Parse A is never better than Parse B; and in at least one instance, it's worse. No matter how the constraints are weighted, these \"bounded\" parses are categorically worse than others. The metrical parser, written primarily by [Josh Falk](https://github.com/jsfalk), works as fast as it does by disregarding harmonically bounded parses as it goes: this way, it doesn't have to travel further down a parse once it realizes that that parse has already been bounded by other parses.\n\nThe number of *unbounded* parses for a given line then represents something about the metrical complexity of the line. For instance, take (Shakespeare's) Richard III's line, \"A horse! A horse! My kingdom for a horse!\" Only one parse survives the harmonic bounding process:\n\n\t[parse #1 of 1]: 2.0 errors\n\t1\tw\ta         \t\n\t2\ts\tHORSE     \t\n\t3\tw\ta         \t\n\t4\ts\tHORSE     \t\n\t5\tw\tmy        \t\n\t6\ts\tKING      \t\n\t7\tw\tdom       \t\n\t8\ts\tFOR       \t[*stress.s=>-u]\n\t9\tw\ta         \t\n\t10\ts\tHORSE     \t\n\t\n\t[*stress.s=>-u]: 2.0  \n\nThis parse only violates one constraint: it elevated an unstressed word, \"for,\" to a metrically strong position. Compare this line to another of Shakespeare's, which has the same number of syllables, but is metrically more complex: \"Never came poison from so sweet a place.\" Here, four parses survive:\n\n\t--------------------\n\t[parse #4 of 4]: 14.0 errors\n\t1\tw\tnev       \t[*strength.w=>-p][*stress.w=>-p]\n\t2\ts\tER        \t[*strength.s=>-u][*stress.s=>-u]\n\t3\tw\tcame      \t[*stress.w=>-p]\n\t4\ts\tPOI       \t\n\t5\tw\tson       \t\n\t6\ts\tFROM      \t[*stress.s=>-u]\n\t7\tw\tso        \t\n\t8\ts\tSWEET     \t\n\t9\tw\ta         \t\n\t10\ts\tPLACE     \t\n\t\n\t[*strength.s=>-u]: 3.0  [*strength.w=>-p]: 3.0  [*stress.s=>-u]: 4.0  [*stress.w=>-p]: 4.0  \n\t--------------------\n\t\n\t--------------------\n\t[parse #3 of 4]: 13.0 errors\n\t1\ts\tNEV       \t\n\t2\tw\ter        \t\n\t3\ts\tCAME POI  \t[*footmin-none][*footmin-no-s-unless-preceded-by-ww]\n\t4\tw\tson       \t\n\t5\ts\tFROM      \t[*stress.s=>-u]\n\t6\tw\tso        \t\n\t7\ts\tSWEET     \t\n\t8\tw\ta         \t\n\t9\ts\tPLACE     \t\n\t\n\t[*footmin-no-s-unless-preceded-by-ww]: 10.0  [*footmin-none]: 1.0  [*stress.s=>-u]: 2.0  \n\t--------------------\n\t\n\t--------------------\n\t[parse #2 of 4]: 9.0 errors\n\t1\ts\tNEV       \t\n\t2\tw\ter came   \t[*stress.w=>-p][*footmin-none]\n\t3\ts\tPOI       \t\n\t4\tw\tson from  \t[*footmin-none]\n\t5\ts\tSO        \t[*stress.s=>-u]\n\t6\tw\tsweet a   \t[*stress.w=>-p][*footmin-none]\n\t7\ts\tPLACE     \t\n\t\n\t[*footmin-none]: 3.0  [*stress.s=>-u]: 2.0  [*stress.w=>-p]: 4.0  \n\t--------------------\n\t\n\t--------------------\n\t[parse #1 of 4]: 6.0 errors\n\t1\ts\tNEV       \t\n\t2\tw\ter came   \t[*stress.w=>-p][*footmin-none]\n\t3\ts\tPOI       \t\n\t4\tw\tson       \t\n\t5\ts\tFROM      \t[*stress.s=>-u]\n\t6\tw\tso        \t\n\t7\ts\tSWEET     \t\n\t8\tw\ta         \t\n\t9\ts\tPLACE     \t[*posthoc-standardize-weakpos]\n\t\n\t[*footmin-none]: 1.0  [*posthoc-standardize-weakpos]: 1.0  [*stress.s=>-u]: 2.0  [*stress.w=>-p]: 2.0  \n\t--------------------\n\nThe best parse (at the bottom) is iambic with a trochaic inversion; it violates the constraint against demoting stressed syllables (\"came\") into a metrically weak position, as well as a constraint discouraging disyllabic positions. The next best is a dactylic interpretation of the line, but it too violates certain constraints. The third best tried to squeeze two syllables into a strong position, and the last—the traditional iambic parse—tried to alter the stress contour of \"never,\" which violates constraints encouraging the correspondence between the meter and syllable \"strength\" in polysyllabic words.\n\nThe default metrical constraints are those proposed by Kiparsky and Hanson in their paper \"A Parametric Theory of Poetic Meter\" (Language, 1996). See `config.py` for a better description of these and other constraints.\n\n## Extending PROSODIC\n\n### Adding languages\n\nThere are two possible methods by which Prosodic can understand a language:\n\n* using a dictionary in the format:\n\t* {word-token}[tab]{stressed, syllabified, IPA format}\n\t* eg:\n\t\t* befuddle [tab] bɪ.'fə.dəl\n\t\t* befuddled\t[tab] bɪ.'fə.dəld\n\t\t* befuddles\t[tab] bɪ.'fə.dəlz\n\n* using a python function which takes in a word-token as an input, and a stressed, syllabified, IPA format as its output. \n\nCurrently, Finnish is implemented by the latter method; English, by a combination of two, using the dictionary for recognized words, and a python function for unrecognized words.\n\nTo add entries to a language's dictionary, simply add an entry in the above format to the dictionary `[language_name].tsv` under the folder `[prosodic_dir]/dicts/[language_twoletter_code]`.\n\nTo add a new language entirely, you can create a new dictionary in the above format and place it under `[prosodic_dir]/dicts/[language_twoletter_code]/[language_name].tsv`. Or, you can create a python file under `[prosodic_dir]/dicts/[language_twoletter_code]/[language_name].py`, which has a function `get(token,config={})`. This function must accept a word-token as its only argument, and PROSODIC's configuration settings as an optional keyword argument, and it must return a list of tuples in the form:\n\n\t[\n\t\t(\n\t\t\t<ipa unicode string>,\n\t\t\t<token string split into a list of syllable strings>,\n\t\t\t{a dictionary of optional keyword arguments to be stored on the word object},\n\t\t),\n\t\t...\n\t]\n\t\nFor example, `get(\"into\", config={'add_elided_pronunciations':1})` might return:\n\n\t[\n\t\t(u\"ɪn.'tuː\", ['in','to'], {'is_elision': False}),\n\t\tu\"'ɪn.tuː\", ['in','to'], {'is_elision': False}),\n\t\tu\"ɪn.tʌ\", ['in','to'], {'is_elision': False})\n\t]\n\nSee the `get()` function in `dicts/en/english.py` or `dicts/fi/finnish.py` for examples.\n\n### Contributing to the code base\n\nPlease feel free to pull and push back to the codebase here! And feel free to use this code in your projects: it is licensed by [GPLv3](https://www.gnu.org/licenses/gpl-3.0.en.html).",
    "docs_url": null,
    "download_url": "https://github.com/quadrismegistus/prosodic/archive/1.1.tar.gz",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/quadrismegistus/prosodic",
    "keywords": "metrical-parser,linguistics,nlp,finnish-language-analysis,poetry,rhythm",
    "license": "UNKNOWN",
    "maintainer": null,
    "maintainer_email": null,
    "name": "prosodic",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/prosodic/",
    "release_url": "https://pypi.org/project/prosodic/1.1.10/",
    "requires_python": null,
    "summary": "PROSODIC: a metrical-phonological parser, written in Python. For English and Finnish, with flexible language support.",
    "version": "1.1.10"
  },
  "releases": {
    "1.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "a5dbfb01954842f53e5ba9a8b0dbea54",
          "sha256": "8ddcadfbd34c060c8c4608078989df35fb8b98f64e5c0447db4974cc3614728c"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "a5dbfb01954842f53e5ba9a8b0dbea54",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 8129,
        "upload_time": "2017-04-23T03:05:37",
        "url": "https://files.pythonhosted.org/packages/bf/43/b8d2edf0edf82456c266a72958e087ac19d745aa3ad2e034880afea020a4/prosodic-1.1.tar.gz"
      }
    ],
    "1.1.10": [
      {
        "comment_text": "",
        "digests": {
          "md5": "3ab6801c6b62c7ca4d736987e7c94321",
          "sha256": "cbcf6fff9a204a684c33577674dcc03f0f1f590121c2508a1553851c21f2e5b2"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.10.tar.gz",
        "has_sig": false,
        "md5_digest": "3ab6801c6b62c7ca4d736987e7c94321",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 3884279,
        "upload_time": "2017-04-23T04:01:07",
        "url": "https://files.pythonhosted.org/packages/e1/cc/ddad16dc58155eaf59ac955d784158987c57848c2e28313fa0addf060bb5/prosodic-1.1.10.tar.gz"
      }
    ],
    "1.1.2": [
      {
        "comment_text": "",
        "digests": {
          "md5": "3414c521baeed904480903f48f35240e",
          "sha256": "2e761a423d66229eaaf8905b5d5ae2ea2efac925c65509574d78bffad50a5328"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.2.tar.gz",
        "has_sig": false,
        "md5_digest": "3414c521baeed904480903f48f35240e",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 118940,
        "upload_time": "2017-04-23T03:21:05",
        "url": "https://files.pythonhosted.org/packages/91/c3/b621fea7e7a70e4cddc62c5b52ab5cae488aaa7b1aac74e6a11a263e4070/prosodic-1.1.2.tar.gz"
      }
    ],
    "1.1.3": [
      {
        "comment_text": "",
        "digests": {
          "md5": "c2d0315c29e0f7688af2930c6d43da5e",
          "sha256": "843855d465c7e84b9cb1c5f1d9903c4b44c698fe63394c001e53fe545705d9b4"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.3.tar.gz",
        "has_sig": false,
        "md5_digest": "c2d0315c29e0f7688af2930c6d43da5e",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 118926,
        "upload_time": "2017-04-23T03:23:12",
        "url": "https://files.pythonhosted.org/packages/41/9f/64a7d57e82d54dc4179e797f060a1187d0c3011f3a6493fa2d0144d0fcfa/prosodic-1.1.3.tar.gz"
      }
    ],
    "1.1.4": [
      {
        "comment_text": "",
        "digests": {
          "md5": "9305c06f52c5a3a2a96ac6602ca8a2c9",
          "sha256": "b532cfa7a5931a01656a1a3a6748aa6277e2ca619f333ec7d6783e5599fee77c"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.4.tar.gz",
        "has_sig": false,
        "md5_digest": "9305c06f52c5a3a2a96ac6602ca8a2c9",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 118924,
        "upload_time": "2017-04-23T03:29:24",
        "url": "https://files.pythonhosted.org/packages/f5/30/a72294d7bf4a790ff88968797b167d9fb8a2dcabb5dd5802f2f3c8a9adf0/prosodic-1.1.4.tar.gz"
      }
    ],
    "1.1.5": [
      {
        "comment_text": "",
        "digests": {
          "md5": "991f83a6054147a180abc39217898c14",
          "sha256": "cf23a9baa3bd48920682ebec3be31e820913a80666c30b76a0766d6d438eccf8"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.5.tar.gz",
        "has_sig": false,
        "md5_digest": "991f83a6054147a180abc39217898c14",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 118937,
        "upload_time": "2017-04-23T03:31:43",
        "url": "https://files.pythonhosted.org/packages/91/3a/b21f947280aafbc8ab5f2efcee64edba22a4939e0897844e47760ac02394/prosodic-1.1.5.tar.gz"
      }
    ],
    "1.1.6": [
      {
        "comment_text": "",
        "digests": {
          "md5": "27f0c9079be773dfacafe8a349567f47",
          "sha256": "f226b43e83b374983ce25f4736da8c2c0332eb7365b5537961d88d6998b597bf"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.6.tar.gz",
        "has_sig": false,
        "md5_digest": "27f0c9079be773dfacafe8a349567f47",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 1533953,
        "upload_time": "2017-04-23T03:39:03",
        "url": "https://files.pythonhosted.org/packages/5c/b6/4c32fcf74a1f311c2722f89565bf76fdd4e8deaab0a859e477750928c27a/prosodic-1.1.6.tar.gz"
      }
    ],
    "1.1.7": [
      {
        "comment_text": "",
        "digests": {
          "md5": "51bb9f1ab6e15aefd6247c9f98e98663",
          "sha256": "05beea9e25dd9725221de1e327fc47b730cb31fe86f7deb6444122717f2bb344"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.7.tar.gz",
        "has_sig": false,
        "md5_digest": "51bb9f1ab6e15aefd6247c9f98e98663",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 3884324,
        "upload_time": "2017-04-23T03:50:26",
        "url": "https://files.pythonhosted.org/packages/ba/5c/9d0c16efca984cf17cd15f13403603fed5a93d86573e72ddc7ded78df8b8/prosodic-1.1.7.tar.gz"
      }
    ],
    "1.1.8": [
      {
        "comment_text": "",
        "digests": {
          "md5": "3725418dfb38857496eded92739588a2",
          "sha256": "420af70c17448dc772c5462e0bb4c02248f3a16696f691ed341a68f2fdb4bc93"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.8.tar.gz",
        "has_sig": false,
        "md5_digest": "3725418dfb38857496eded92739588a2",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 3884287,
        "upload_time": "2017-04-23T03:55:20",
        "url": "https://files.pythonhosted.org/packages/8e/31/1da3dbb590d5e0ff234d75215d3ab864ccac13bcd34fcf2e0d208ba0ae3b/prosodic-1.1.8.tar.gz"
      }
    ],
    "1.1.9": [
      {
        "comment_text": "",
        "digests": {
          "md5": "c42a4fa68e0c1e5f8d6e5d4178150bbd",
          "sha256": "accec71808eb01a74d84ebe74c39f105d8a06a14e4c1fd79c0d0d868c28d6580"
        },
        "downloads": 0,
        "filename": "prosodic-1.1.9.tar.gz",
        "has_sig": false,
        "md5_digest": "c42a4fa68e0c1e5f8d6e5d4178150bbd",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 3884306,
        "upload_time": "2017-04-23T03:56:41",
        "url": "https://files.pythonhosted.org/packages/1e/be/93f30af0d30f5e9b463bedfb9df4443a78db1d2bb9d10a3ddbab612cff57/prosodic-1.1.9.tar.gz"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "3ab6801c6b62c7ca4d736987e7c94321",
        "sha256": "cbcf6fff9a204a684c33577674dcc03f0f1f590121c2508a1553851c21f2e5b2"
      },
      "downloads": 0,
      "filename": "prosodic-1.1.10.tar.gz",
      "has_sig": false,
      "md5_digest": "3ab6801c6b62c7ca4d736987e7c94321",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 3884279,
      "upload_time": "2017-04-23T04:01:07",
      "url": "https://files.pythonhosted.org/packages/e1/cc/ddad16dc58155eaf59ac955d784158987c57848c2e28313fa0addf060bb5/prosodic-1.1.10.tar.gz"
    }
  ]
}