{
  "info": {
    "author": "Justin Bois",
    "author_email": "bois@caltech.edu",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 2 - Pre-Alpha",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: MIT License",
      "Natural Language :: English",
      "Programming Language :: Python :: 3.5",
      "Programming Language :: Python :: 3.6"
    ],
    "description": "# Reaction-Diffusion Solver\n\n[![Build Status](https://travis-ci.org/justinbois/rdsolver.svg?branch=master)](https://travis-ci.org/justinbois/rdsolver)\n\n## Status\n**Pre-alpha. Unit tests are passing, but coverage is not complete nor are integration tests.**\n\n## Purpose\nThis package solves a simple problem: reaction diffusion dynamics in two dimensions. Specifically, it solves the system of PDEs\n\n![RD PDE](imgs/RD_PDE.png)\n\nHere, each chemical species is indicated by the subscript *i* and the physical parameters *D<sub>i</sub>*, *β<sub>i</sub>*, and *γ<sub>ij</sub>* are constants in space and time. Note that summation over like indices in the above equation is not assumed; only the explicit summation is performed. The coordinates are Cartesian and the boundary conditions periodic.\n\n## Installation\n\nTo install, you can use pip.\n\n```\npip install rdsolver\n```\n\nFor some of the interactive visualizations to work properly in Jupyter notebooks, you may need to use version 2.0.0 of `widgetsnbextension` because of [this issue](https://github.com/jupyter-widgets/ipywidgets/issues/1678). To install this using the `conda` package manager, you will need to do:\n\n```\nconda install widgetsnbextension=2.0.0\n```\n\nYou may also need to run this at the command line after installation:\n\n```\njupyter nbextension enable --py --sys-prefix widgetsnbextension\n```\n\nFinally, your browser may have problems rending the graphics, so you should launch your Jupyter notebook like this:\n\n```\njupyter notebook --NotebookApp.iopub_data_rate_limit=10000000\n```\n\n\n## Method\nTo solve the PDEs, I use spectral differentiation with variable time step implicit/explicit (VSIMEX) time stepping using a Crank-Nicholson/Adams-Bashforth method. The cons of this approach appear below, and the pros are best understood by considering why these methods are chosen.\n\n#### Why IMEX?\n\nReaction-diffusion equations can be stiff, which makes explicit time stepping really slow. So, if we can do implicit stepping, we can take much larger steps because implicit methods have a more amenable stability region. The problem is that nonlinear problems make implicit time stepping difficult because we would have to solve a system of nonlinear equations to make time steps. A typical way around this is to linearize the equations and take steps according to the linearized model.\n\nInstead, imagine that the right hand side of the PDEs have a linear stiff part and a nonlinear part that is not so stiff. We could then do implicit time stepping on the linear part (which involves solving a *linear* system of equations) and explicit time stepping on the nonlinear part. This is typically what we have in reaction-diffusion equations. The diffusive part is stiff, and the chemical reaction part is not. In the system of equations solved here, we have split out the linear parts given by the diffusion terms and the spontaneous production and degradation terms that are common in biological application from the remainder of the nonlinear reaction terms, given by the function *f<sub>i</sub>*(*c*<sub>1</sub>, *c*<sub>2</sub>, ...).\n\nSo, for each time step, we step implicitly for the linear terms using a Crank-Nicholson step and explicitly for the nonlinear terms using an Adams-Bashforth step.\n\n\n#### Why variable step size?\n\nBy taking steps of variable size, we can take bigger steps when the solution is not changing much, and shorter steps when it is, allowing us to resolve the dynamics without wasting steps. I use a PID controller to adjust step size to hit a (small) target relative change in the solution for each step.\n\nThe primary reference for the VSIMEX method is Wang and Ruuth, *J. Comput. Math.*, **26**, 838-855, 2008.\n\n\n#### Why spectral methods?\nThere are two major bonuses to using spectral methods. First, the solution of the linear system in the implicit time step becomes trivial. This makes the time stepping **much** more efficient. Second, spectral methods give very accurate derivatives with fewer grid points. In turn, the fewer grid points results in faster time stepping.\n\nWe can do non-periodic boundary conditions with spectral methods by computing on Chebyshev grids, which is a future enhancement. For now, we limit the solutions to periodic domains.\n\n#### Cons to spectral methods\n\nThere are a few important watch-outs when using spectral methods. First, the initial conditions need to be chosen carefully. Importantly, you cannot just make random perturbations. The functions must be strictly periodic and smooth. Along the same lines, spectral methods will fail if there are very sharp changes in the concentration profile.\n",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/justinbois/rdsolver",
    "keywords": "rdsolver",
    "license": "MIT license",
    "maintainer": "",
    "maintainer_email": "",
    "name": "rdsolver",
    "platform": "",
    "project_url": "https://pypi.org/project/rdsolver/",
    "release_url": "https://pypi.org/project/rdsolver/0.1.1/",
    "requires_dist": [],
    "requires_python": "",
    "summary": "Solver for 2D reaction-diffusion systems.",
    "version": "0.1.1"
  },
  "releases": {
    "0.1.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "cd5033c29cc346b4aaf0933e1cad8278",
          "sha256": "2163b37e0334647b52551651937266c2ff95d17f5008c12270270b0e972593f6"
        },
        "downloads": 0,
        "filename": "rdsolver-0.1.0.tar.gz",
        "has_sig": false,
        "md5_digest": "cd5033c29cc346b4aaf0933e1cad8278",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 25051,
        "upload_time": "2017-08-30T20:25:06",
        "url": "https://files.pythonhosted.org/packages/82/1c/dae2456ebe3f46cf063d11f74acff0a358fd57bdfa5dafdcc40159b129e6/rdsolver-0.1.0.tar.gz"
      }
    ],
    "0.1.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "caad7eba8b2c14a3ed089f0afddc83b5",
          "sha256": "8f73223035b0ce247da7b209edcd08e34e9294a003a31e63fdd10eb65b6dd7ba"
        },
        "downloads": 0,
        "filename": "rdsolver-0.1.1.tar.gz",
        "has_sig": false,
        "md5_digest": "caad7eba8b2c14a3ed089f0afddc83b5",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 25088,
        "upload_time": "2017-08-30T20:28:59",
        "url": "https://files.pythonhosted.org/packages/81/6f/3c8192812d48bcc5d3ac74bd3bde830fbf51881d0b8a8e3a2dd2b6296f60/rdsolver-0.1.1.tar.gz"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "caad7eba8b2c14a3ed089f0afddc83b5",
        "sha256": "8f73223035b0ce247da7b209edcd08e34e9294a003a31e63fdd10eb65b6dd7ba"
      },
      "downloads": 0,
      "filename": "rdsolver-0.1.1.tar.gz",
      "has_sig": false,
      "md5_digest": "caad7eba8b2c14a3ed089f0afddc83b5",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 25088,
      "upload_time": "2017-08-30T20:28:59",
      "url": "https://files.pythonhosted.org/packages/81/6f/3c8192812d48bcc5d3ac74bd3bde830fbf51881d0b8a8e3a2dd2b6296f60/rdsolver-0.1.1.tar.gz"
    }
  ]
}