{
  "info": {
    "author": "SENAITE Foundation",
    "author_email": "support@senaite.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "Environment :: Web Environment",
      "Framework :: Plone",
      "Framework :: Zope2",
      "Programming Language :: Python"
    ],
    "description": ".. figure:: https://raw.githubusercontent.com/senaite/senaite.core/master/bika/lims/skins/bika/senaite-core-logo.png\n   :width: 500px\n   :alt: senaite.core\n   :align: center\n\n— **SENAITE.CORE**: *the heart of SENAITE.LIMS, the evolution of Bika LIMS*\n\n.. image:: https://img.shields.io/pypi/v/senaite.core.svg?style=flat-square\n    :target: https://pypi.python.org/pypi/senaite.core\n\n.. image:: https://img.shields.io/travis/senaite/senaite.core/master.svg?style=flat-square\n    :target: https://travis-ci.org/senaite/senaite.core\n\n.. image:: https://img.shields.io/scrutinizer/g/senaite/senaite.core/master.svg?style=flat-square\n    :target: https://scrutinizer-ci.com/g/senaite/senaite.core/\n\n.. image:: https://img.shields.io/github/issues-pr/senaite/senaite.core.svg?style=flat-square\n    :target: https://github.com/senaite/senaite.core/pulls\n\n.. image:: https://img.shields.io/github/issues/senaite/senaite.core.svg?style=flat-square\n    :target: https://github.com/senaite/senaite.core/issues\n\n.. image:: https://img.shields.io/github/contributors/senaite/senaite.core.svg?style=flat-square\n    :target: https://github.com/senaite/senaite.core/blob/master/CONTRIBUTORS.rst\n\n\nIntroduction\n============\n\nSENAITE.CORE is an Open Source Laboratory Information Management System (LIMS)\nfor enterprise environments, especially focused to behave with high speed,\nexcellent performance and good stability.\n\nThis software is a derivative work of BikaLIMS_\nsoftware and comes with the same user interface. Since SENAITE.CORE provides the\ncore functionalities and entities used by `SENAITE.LIMS <https://github.com/senaite/senaite.lims>`_,\nthe installation of the latter is strongly recommended for an optimal user\nexperience.\n\n\nInstallation\n============\n\nSENAITE.CORE is built on top of `Plone CMS <https://plone.org>`_, so it must be\ninstalled first.\nPlease, follow the `installation instructions for Plone 4.x <https://docs.plone.org/4/en/manage/installing/installation.html>`_\nfirst.\n\nOnce Plone 4.x is installed successfully, you can choose any of the two options\nbelow:\n\nReady-to-go installation\n------------------------\nWith this installation modality, the sources from ``senaite.core`` will be\ndownloaded automatically from `Python Package Index (Pypi) <https://pypi.python.org/pypi/senaite.core>`_.\nIf you want the latest code from the `source code repository <https://github.com/senaite/senaite.core>`_,\nfollow the `installation instructions for development <https://github.com/senaite/senaite.core/blob/master/README.rst#installation-for-development>`_.\n\nCreate a new buildout file ``senaite.cfg`` which extends your existing\n``buildout.cfg`` – this way you can easily keep development stuff separate from\nyour main buildout.cfg which you can also use on the production server::\n\n  [buildout]\n  index = https://pypi.python.org/simple\n  extends = buildout.cfg\n\n  [instance]\n  eggs +=\n      senaite.core\n\nNote that with this approach you do not need to modify the existing buildout.cfg\nfile.\n\nThen build it out with this special config file::\n\n  bin/buildout -c senaite.cfg\n\nand buildout will automatically download and install all required dependencies.\n\nFor further details about Buildout and how to install add-ons for Plone, please check\n`Installing add-on packages using Buildout from Plone documentation <https://docs.plone.org/4/en/manage/installing/installing_addons.html>`_.\n\n\nInstallation for development\n----------------------------\n\nThis is the recommended approach how to enable ``senaite.core`` for your\ndevelopment environment. With this approach, you'll be able to download the\nlatest source code from `senaite.core's repository <https://github.com/senaite/senaite.core>`_\nand contribute as well.\n\nUse git to fetch ``senaite.core`` source code to your buildout environment::\n\n  cd src\n  git clone git://github.com/senaite/senaite.core.git senaite.core\n\nCreate a new buildout file ``senaite.cfg`` which extends your existing\n``buildout.cfg`` – this way you can easily keep development stuff separate\nfrom your main buildout.cfg which you can also use on the production server.\n\n``senaite.cfg``::\n\n  [buildout]\n  index = https://pypi.python.org/simple\n  extends = buildout.cfg\n  develop +=\n      src/senaite.core\n\n  [instance]\n  eggs +=\n      senaite.core\n\nNote that with this approach you do not need to modify the existing buildout.cfg\nfile.\n\nThen build it out with this special config file::\n\n  bin/buildout -c senaite.cfg\n\nand buildout will automatically download and install all required dependencies.\n\n\nContribute\n==========\n\nWe want contributing to SENAITE.CORE to be fun, enjoyable, and educational for\nanyone, and everyone. This project adheres to the `Contributor Covenant <https://github.com/senaite/senaite.core/blob/master/CODE_OF_CONDUCT.md>`_.\nBy participating, you are expected to uphold this code. Please report\nunacceptable behavior.\n\nContributions go far beyond pull requests and commits. Although we love giving\nyou the opportunity to put your stamp on SENAITE.CORE, we also are thrilled to\nreceive a variety of other contributions. Please, read `Contributing to senaite.core\ndocument <https://github.com/senaite/senaite.core/blob/master/CONTRIBUTING.md>`_.\n\n\nFeedback and support\n====================\n\n* `Gitter channel <https://gitter.im/senaite/Lobby>`_\n* `Users list <https://sourceforge.net/projects/senaite/lists/senaite-users>`_\n\n\nLicense\n=======\nSENAITE.CORE\nCopyright (C) 2018 Senaite Foundation\n\nThis software, henceforth \"SENAITE.CORE\", an add-on for\n`Plone software <https://plone.org/>`_, is a derivative work of BIKALIMS_.\n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the `GNU General Public License version 2 <./LICENSE>`_ as published by the Free Software Foundation.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU General Public License for more details.\n\nSENAITE.CORE uses third party libraries that are distributed under their own\nterms (see LICENSE-3RD-PARTY.rst)\n\n\n.. Links\n\n.. _BIKALIMS: https://github.com/bikalims/bika.lims\n\nRelease notes\n=============\n\nUpdate from 1.2.0 to 1.2.1\n--------------------------\n\n- This update requires the execution of `bin/buildout`, because a new dependency has\n  been added: `Plone Subrequest <https://pypi.python.org/pypi/plone.subrequest/>`_\n\n- With this update, Analyses Services that are inactive, but have active\n  dependent services, will be automatically transitioned to `active` state. This\n  procedure fixes eventual inconsistencies amongst the statuses of Analyses\n  Services. See #555\n\nChangelog\n=========\n\n1.2.1 (2018-01-26)\n------------------\n\n**Added**\n\n- #555 Don't allow the deactivation of Analysis Services with active dependencies\n- #555 Don't allow the activation of Analysis Services with inactive dependents\n\n**Changed**\n\n- #569 Minimalistic dashboard indicators\n\n**Fixed**\n\n- #606 Handle unicode queries in Client ReferenceWidgetVocabulary\n- #603 Out of range Icons are not displayed through all Analysis states\n- #598 BadRequest error when changing Calculation on Analysis Service\n- #593 Price/Spec/Interim not set in AR Manage Analyses\n- #585 Empty value for Analysis Request column in aggregated list of analyses\n- #578 Fix translation for review state titles in listings\n- #580 Fix calculations using built-ins\n- #563 Deactivated Analyses are added in new ARs when using Analysis Profiles/Template\n- #562 Client Batch lists are empty\n- #561 Sampler field is not displayed in Analysis Request Add form\n- #559 Fix numeric field event handler in bika.lims.site.js\n- #553 Fixed that images and barcodes were not printed in reports\n- #551 Traceback in Worksheet Templates list when there are Instruments assigned\n- #571 Added try/except around id-template format function to log key errors in ID generation\n\n\n1.2.0 (2018-01-03)\n------------------\n\n**Added**\n\n- #498 Added getPriorityText method to Analysis Request\n\n**Changed**\n\n- #519 #527 #528 bika.lims to senaite.core distribution\n\n**Fixed**\n\n- #522 Worksheets: Analyses listing does not show attached Analyses\n- #514 Site Error when listing Dormant Worksheet Templates\n- #517 Expired Reference Samples are displayed in Add Blank/Add Control views\n- #517 Inactive services displayed for selection in Add Blank/Add Control views\n- #516 List of Analyses Services is not properly filtered by state\n- #516 Activate and Deactivate buttons do not appear in Analysis Services list\n- #512 Duplicates transition to \"Attachment due\" after submit\n- #499 Wrong slots when adding analyses manually in Worksheet with a WST assigned\n- #499 When a Worksheet Template is used, slot positions are not applied correctly\n- #499 Applying a WS template which references a Duplicate raises an Error\n- #513 ShowPrices doctest is failing\n- #488 JS Errors in bika.lims.analysisrequest.js\n\n\n1.1.8 (2017-12-23)\n------------------\n\n**Added**\n\n- #440 ITopLeft, ITopRight and ITopWide hooks (placeholders) in bikalisting\n- #472 Dashboard panels visibility by roles\n- #467 All/Mine filters in Dashboard panels\n- #423 Instrument import interface for Abbott's m2000 Real Time\n\n**Changed**\n\n- #469 Remove unique field validator for Batch titles\n- #459 PR-1942 Feature/instrument certification interval refactoring\n- #431 Make ARAnalysesField setter to accept Analysis/Service objects\n\n**Fixed**\n\n- #494 Rejection reasons widget does not appear on rejection\n- #492 Fix AR Add Form: CC Contacts not set on Contact Change\n- #489 Worksheet Templates selection list is empty in Worksheets view\n- #490 Fix AR Add Form: No specifications found if a sample type was set\n- #475 Assigning Analyses to a WS raises AttributeError\n- #466 UnicodeDecodeError if unicode characters are entered into the title field\n- #453 Sample points do not show the referenced sample types in view\n- #470 Sort order of Analyses in WS print view wrong\n- #457 Calculation referring to additional python module not triggered\n- #459 Traceback in Instruments list after adding a calibration certificate\n- #454 Click on some analyses pops up a new page instead of object log\n- #452 Traceback error when deleting attachment from Analysis Request\n- #450 Traceback after clicking \"Manage Results\" in a WS w/o Analyses assigned\n- #445 Fix AR Add Form: No sample points are found if a sample type was set\n\n\n1.1.7 (2017-12-01)\n------------------\n\n**Added**\n\n- #377 XML importer in Instrument Interface of Nuclisense EasyQ\n\n**Removed**\n\n- #417 Remove calls to deprecated function getService (from AbstractAnalysis)\n\n**Fixed**\n\n- #439 Cannot verify calculated analyses when retracted dependencies\n- #432 Wrong indentation of services in Worksheet\n- #436 Auto Import View has an Add Button displayed, but shouldn't\n- #436 Clicking on the Add Button of Instrument Certifications opens an arbitrary Add form\n- #433 Analyses not sorted by sortkey in Analysis Request' manage analyses view\n- #428 AR Publication from Client Listing does not work\n- #425 AR Listing View: Analysis profiles rendering error\n- #429 Fix worksheet switch to transposed layout raises an Error\n- #420 Searches by term with custom indexes do not work in clients folder view\n- #410 Unable to select or deselect columns to be displayed in lists\n- #409 In Add Analyses view, analyses id are displayed instead of Analysis Request IDs\n- #378 Fix GeneXpert interface does not import results for multiple analyses\n- #416 Fix inconsistencies with sorting criterias in lists\n- #418 LabClerks don't have access to AR view after received and before verified\n- #415 Referencefield JS UID check: Don't remove Profile UIDs\n- #411 Analyses don't get selected when copying an Analysis Request without profiles\n\n\n1.1.6 (2017-11-24)\n------------------\n\n**Changed**\n\n- #390 Remove log verbosity of UIDReference.get when value is None or empty\n\n**Fixed**\n\n- #403 Calculations not triggered in manage results view\n- #402 Sort Analysis Services correctly based on their Sortkey + Title (Again)\n- #398 PR-2315 ID Server does not find the next correct sequence after flushing the number generator\n- #399 PR-2318 AR Add fails silently if e.g. the ID of the AR was already taken\n- #400 PR-2319 AR Add fails if an Analysis Category was disabled\n- #401 PR-2321 AR Add Copy of multiple ARs from different clients raises a Traceback in the background\n- #397 Fix Issue-396: AttributeError: uid_catalog on AR publication\n\n\n1.1.5 (2017-11-20)\n------------------\n\n**Added**\n\n- #386 PR-2297 Added seeding function to IDServer\n- #372 Added build system to project root\n- #345 'SearchableText' field and adapter in Batches\n- #344 PR-2294 Allow year in any portal type's ID format string\n- #344 PR-2210 ID Server and bika setup updates along with migation step\n- #321 PR-2158 Multiple stickers printing in lists\n- #319 PR-2112 Laboratory Supervisor\n- #317 Enable backreferences associated to UIDReference fields\n- #315 PR-1942 Instrument Certification Interval\n- #292 PR-2125 Added descriptions for Analysis Requests\n- #291 PR-1972 Landscape Layout for Reports\n- #286 Added Github Issue/PR Template\n- #281 PR-2269 Show the Unit in Manage Analyses View\n- #279 Allow external Python library functions to be used in Calculation Formulas\n- #279 Calculation formula test widgets\n- #279 PR-2154 New ar add form\n\n**Changed**\n\n- #385 PR-2309 Unnecessary loops were done in instrument listing views\n- #369 Let DateTimeField setter accept datetime.datetime objects and convert them\n- #362 Add \"Methods\" column and hide unused columns in Analysis Services list\n- #353 Remove deprecation warnings\n- #338 Preserve Analysis Request order when adding into Worksheet\n- #338 Analyses sorted by priority in Add Analyses view\n- #333 Display analyses sorted by sortkey in results report\n- #331 Sort analyses lists by sortkey as default\n- #321 Sticker's autoprint generates PDF instead of browser's print dialog\n- #312 Worksheet: \"Print\" does not display/print partial results\n- #306 PR-2077 Better usability of Clients lists for sites with many users\n- #298 PR-2246 Implemented ProxyField to fix data duplication between ARs and Samples\n\n**Fixed**\n\n- #419 'getLastVerificator' function of Abstract Analyses fails when there is no Verificator.\n- #388 Unable to get the portal object when digesting/creating results report\n- #387 ClientWorkflowAction object has no attribute 'portal_url' when publishing multiple ARs\n- #386 PR-2313 UniqueFieldValidator: Encode value to utf-8 before passing it to the catalog\n- #386 PR-2312 IDServer: Fixed default split length value\n- #386 PR-2311 Fix ID Server to handle a flushed storage or existing IDs with the same prefix\n- #385 PR-2309 Some objects were missed in instrument listing views\n- #384 PR-2306 Do not use localized dates for control chart as it breaks the controlchart.js datetime parser\n- #382 PR-2305 TypeError in Analysis Specification category expansion\n- #380 PR-2303 UnicodeDecodeError if title field validator\n- #379 Missing \"Instrument-Import-Interface\" relationship\n- #375 Dependencies error in Manage Analyses view\n- #371 Reflex rules don't have 'inactive_state' values set\n- #365 LIMS installation fails during setting client permissions in bika_setup\n- #364 Error on Manage Results view while adding new Analyses from different Category\n- #363 PR-2293 Add CCEmails to recipients for Analysis Request publication reports\n- #352 Traceback on listings where objects follow the bika_inactive_workflow\n- #323 Allow IDServer to correctly allocate IDs for new attachments (add Attachment to portal_catalog)\n- #344 PR-2273. Ensure no counters in the number generator before initialising id server\n- #343 PR-2281 Fix publication preferences for CC Contacts\n- #340 TypeError: \"Can't pickle objects in acquisition wrappers\" (Calculation)\n- #339 Index not found warnings in bika listing\n- #337 Error when adding reference analysis in a Worksheet\n- #336 Accreditation Portlet renders an error message for anonymous users\n- #335 The Lab Name is always set to \"Laboratory\" after reinstallation\n- #334 TypeError (setRequestId, unexpected keyword argument) on AR Creation\n- #330 Show action buttons when sorting by column in listings\n- #318 PR-2205 Conditional Email Notification on Analysis Request retract\n- #316 Small fixes related with i18n domain in Worksheet's print fixtures\n- #314 'SamplingDate' and 'DateSampled' fields of AR and Sample objects don't behave properly\n- #313 The PDF generated for stickers doesn't have the right page dimensions\n- #311 PR-1931 Fixed Link User to Contact: LDAP Users not found\n- #309 PR-2233 Infinite Recursion on Report Publication.\n- #309 PR-2130 Copied ARs are created in random order.\n- #308 Analysis Service' interim fields not shown\n- #307 Fix sorting of Analysis Services list and disable manual sorting\n- #304 PR-2081 Fixed multiple partition creation from ARTemplate\n- #304 PR-2080 Batch Book raises an Error if the Batch inherits from 2 ARs\n- #304 PR-2053 Computed Sample Field \"SampleTypeUID\" does not check if a SampleType is set\n- #304 PR-2017 Fixed BatchID getter\n- #304 PR-1946 Showing Verified Worksheets under all\n- #299 PR-1931 Fixed Link User to Contact: LDAP Users not found\n- #298 PR-1932 AttributeError: 'bika_setup' on login on a new Plone site w/o bika.lims installed\n- #297 PR-2102 Inline rendered attachments are not displayed in rendered PDF\n- #296 PR-2093 Sort order in Bika Setup Listings\n- #294 PR-2016 Convert UDL and LDL values to string before copy\n- #293 Fix analysis_workflow permissions for Field Analysis Results\n- #284 PR-1917 Solved WF Translation issues and fixed WF Action Buttons in Bika Listings\n- #283 PR-2252 Traceback if the title contains braces on content creation\n- #282 PR-2266 Instrument Calibration Table fixes\n- #280 PR-2271 Setting 2 or more CCContacts in AR view produces a Traceback on Save\n\n\n1.0.0 (2017-10-13)\n------------------\n\n**Added**\n\n- #269 Added IFrontPageAdapter, to make front page custom-redirections easier\n- #250 Sanitize tool to fix wrong creation dates for old analyses\n\n**Fixed**\n\n- #272 Unknown sort_on index (getCategoryTitle) in Worksheet's Add Analyses view\n- #270 ParseError in Reference Widget Search. Query contains only common words\n- #266 Worksheet column appears blank in Aggregated List of Analyses\n- #265 ValueError in productivity report\n- #264 Fix permissions error on site install\n- #262 DateSampled does not appear to users other than labman or administrator\n- #261 Checking async processes fails due to Privileges of Client Contact\n- #259 Error when saving and Analysis Request via the Save button\n- #258 Sorting Analysis Requests by progress column does not work\n- #257 AttributeError (getRequestUID) when submitting duplicate analyses\n- #255 Client contacts cannot see Analysis Requests if department filtering is enabled\n- #249 Unable to reinstate cancelled Analysis Requests\n\n**Security**\n\n- #256 Restrict the linkeage of client contacts to Plone users with Client role only\n- #254 Anonymous users have access to restricted objects\n\n\n3.2.0.1709-a900fe5 (2017-09-06)\n-------------------------------\n\n**Added**\n\n- #244 Asynchronous creation of Analysis Requests\n- #242 Visibility of automatically created analyses because of reflex rule actions\n- #241 Fine-grained visibility of analyses in results reports and client views\n- #237 Performance optimizations in Analysis Request creation\n- #236 Progress bar column in Analysis Requests list and Analyses number\n- #233 Background color change on mouse over for fields table from ARAdd view\n- #232 Display Priority in Analyses Add View from Worksheet and allow to sort\n- #229 Highlight rows in bikalisting on mouse over\n- #157 Catalog for productivity/management reports to make them faster\n\n**Changed**\n\n- #218 Render barcodes as bitmap images by default\n- #212 Allow direct verification of analyses with dependencies in manage results view\n- #213 Sampling Date and Date Sampled fields refactoring to avoid confusions\n- #228 Translations updated\n- #224 Remove warnings and unuseful elses in Analysis Request setters\n- #193 Render transition buttons only if 'show_workflow_action' in view is true\n- #191 Code sanitize to make Analysis Specifications folder to load faster\n\n**Fixed**\n\n- #248 Search using Client not working in Add Analyses (Worksheet)\n- #247 Sample Type missing in analysis view for rejected samples\n- #246 ZeroDivisionError when calculating progress\n- #245 Missing Lab Contacts tab in Departments View\n- #240 Unable to modify Sample point field in Analysis Request view\n- #235 Fix Jsi18n adapter conflict\n- #239 Sort on column or index is not valid\n- #231 Partition inconsistences on secondary Analysis Requests\n- #230 Priority not showing on Analysis Request listing\n- #227 Malformed messages and/or html make i18ndude to fail\n- #226 Action buttons are not translated\n- #225 State inconsistencies when adding an analysis into a previous Analysis Request\n- #223 TypeError when Analysis Service's exponential format precision is None\n- #221 Filters by Service, Category and Client do not work when adding Analyses into a Worksheet\n- #220 Not all departments are displayed when creating a new Lab Contact\n- #219 When a Sample Point is modified in AR view, it does not get printed in report\n- #217 Setupdata import fixes\n- #216 Results reports appear truncated\n- #215 All Samples are displayed in Analysis Request Add form, regardless of client\n- #214 Status inconsistences in Analyses in secondary Analysis Requests\n- #211 Sorting by columns in batches is not working\n- #210 In some cases, the sampler displayed in results reports is wrong\n- #209 AttributeError: 'NoneType' object has no attribute 'getPrefix' in Analysis Request add view\n- #208 Rendering of plone.abovecontent in bika.lims.instrument_qc_failures_viewlet fails\n- #206 Unknown sort_on index (getClientTitle) in Add Analyses view from Worksheet\n- #202 Once a result is set, the checkbox is automatically checked, but action buttons do not appear\n- #201 Results interpretation field not updated after verification or prepublish\n- #200 Dependent analyses don't get selected when analysis with dependents is choosen in AR Add view\n- #199 AttributeError when adding a Blank in a Worksheet because of Service without category\n- #198 The assignment of a Calculation to a Method doesn't get saved apparently, but does\n- #196 Error invalidating a published test report (retract_ar action)\n- #195 List of Analysis Request Templates appears empty after adding a Sampling Round Template\n- #192 Date Sampled is not displayed in Analysis Request View\n- #190 Bad time formatting on Analysis Request creation within a Sampling Round\n- #189 Bad time formatting when creating a secondary Analysis Request\n- #187 After verification, department managers are not updated in results report anymore\n- #185 Analysis services list not sorted by name\n- #183 Decimals rounding is not working as expected when uncertainties are set\n- #181 Client contact fields are not populated in Sampling Round add form\n- #179 Wrong values for \"Sampling for\" and \"Sampler for scheduled sampling\" fields after AR creation\n- #178 Sampler information is wrong in results reports\n- #175 Changes in \"Manage Analyses\" from \"Analysis Request\" have no effect\n- #173 NameError (global name 'safe_unicode' is not defined) in Analysis Request Add view\n- #171 Error printing contact address\n- #170 Index error while creating an Analysis Request due to empty Profile\n- #169 ValueError (Unterminated string) in Analysis Request Add view\n- #168 AttributeError 'getBatch' after generating barcode\n- #166 Analyses don't get saved when creating an Analysis Request Template\n- #165 AttributeError in Bika Setup while getting Analysis Services vocabulary\n- #164 AttributeError on Data Import: 'NoneType' object has no attribute 'Import'\n- #161 TypeError from HistoryAwareReferenceField while displaying error message\n- #159 Date published is missing on data pulled through API\n- #158 Date of collection greater than date received on Sample rejection report\n- #156 Calculation selection list in Analysis Service edit view doesn't get displayed\n- #155 Error while rejecting an Analysis Request. Unsuccessful AJAX call\n\n\n3.2.0.1706-315362b (2017-06-30)\n-------------------------------\n\n**Added**\n\n- #146 Stickers to PDF and new sticker 2\"x1\" (50.8mm x 25.4mm) with barcode 3of9\n- #152 Caching to make productivity/management reports to load faster\n\n**Changed**\n\n- #150 Dynamic loading of allowed transitions in lists\n- #145 Workflow refactoring: prepublish\n- #144 Workflow refactoring: publish\n\n**Fixed**\n\n- #154 AttributeError on upgrade step v1705: getDepartmentUID\n- #151 State titles not displayed in listings\n- #149 Decimal point not visible after edition\n- #143 Fix AttributeError 'getProvince' and 'getDistrict' in Analysis Requests view\n- #142 AttributeError on publish: 'getDigest'\n- #141 AttributeError on upgrade.v3_2_0_1705: 'NoneType' object has no attribute 'aq_parent'\n\n\n3.2.0.1706-baed368 (2017-06-21)\n-------------------------------\n\n**Added**\n\n- #133 Multiple use of instrument control in Worksheets\n\n**Fixed**\n\n- #139 Reference migration fails in 1705 upgrade\n- #138 Error on publishing when contact's full name is empty\n- #137 IndexError while notifying rejection: list index out of range\n- #136 Worksheets number not working in Dashboard\n- #135 Fix string formatting error in UIDReferenceField\n- #132 ValueError in worksheets list. No JSON object could be decoded\n- #131 \"Show more\" is missing on verified worksheets listing\n- #129 Unsupported operand type in Samples view\n\n\n3.2.0.1706-afc4725 (2017-06-12)\n-------------------------------\n\n**Fixed**\n\n- #128 TypeError in Analysis Request' manage results view: object of type 'Missing.Value' has no len()\n- #127 AttributeError while copying Service: 'float' object has no attribute 'split'\n- #126 AttributeError during results publish: getObject\n- #123 Analysis Request state inconsistences after upgrade step v3.2.0.1705\n- #122 ValueError on results file import\n\n\n3.2.0.1706-f32494f (2017-06-08)\n-------------------------------\n\n**Added**\n\n- #120 Add a field in Bika Setup to set the default Number of ARs to add\n- #88 GeneXpert Results import interface\n- #85 Sticker for batch\n- #84 Sticker for worksheet\n- #83 Adapter to make the generation of custom IDs easier\n- #82 Added a method the get always the client in stickers\n- #75 Wildcards on searching lists\n\n**Changed**\n\n- #106 Predigest publish data\n- #103 Prevent the creation of multiple attachment objects on results import\n- #101 Performance improvement. Remove Html Field from AR Report\n- #100 Performance improvement. Replacement of FileField by BlobField\n- #97 Performance improvement. Removal of versionable content types\n- #95 Performance improvement. Analysis structure and relationship with Analysis Service refactored\n- #58 Defaulting client contact in Analysis Request Add view\n\n**Fixed**\n\n- #118 Results import throwing an error\n- #117 Results publishing not working\n- #113 Biohazard symbol blocks the sticker making it impossible to be read\n- #111 Fix error while submitting reference analyses\n- #109 Remarks in analyses (manage results) are not displayed\n- #105 System doesn't save AR when selected analyses are from a department to which current user has no privileges\n- #104 ReferenceException while creating Analysis Request: invalid target UID\n- #99 Instrument's getReferenceAnalyses. bika.lims.instrument_qc_failures_viewlet fails\n- #94 Site Search no longer searching Analysis Requests\n- #93 Analyses did not get reindexed after recalculating results during import\n- #92 Analyses disappearing on sorting by date verified\n- #91 KeyError on Samples view: 'getSamplingDate'\n- #90 AttributeError on Analysis Request submission: 'NoneType' object has no attribute 'getDepartment'\n- #89 Analysis to be verified not showing results\n- #87 AttributeError in analyses list: 'getNumberOfVerifications'\n- #82 JS error while checking for rejection reasons in client view\n- #80 CatalogError: Unknown sort_on index (Priority)\n- #79 ValueError in Bika's DateTimeWidget\n- #78 CatalogError in Batch View. Unknown sort_on index (BatchID)\n- #77 ValueError in AR Add: time data '2016-05-10' does not match format '%Y-%m-%d %H:%M'\n- #76 AttributeError in Client ARs view: bika_catalog\n- #74 AttributeError: 'NoneType' object has no attribute 'getCalculation'\n- #73 Analyses disappearing on sorting by date verified\n- #72 Cancelled analyses appearing in aggregated list of analyses\n- #71 AttributeError on publish: 'getRequestID'\n- #70 The number of pending verifications displayed in analyses list is wrong\n- #69 Selecting a sticker template in AR's sticker preview does nothing\n- #68 Error while listing analyses in Analysis Request details view\n- #67 Show more button is not working in Analysis Services list\n- #66 TypeError in Worksheets view. TypeError: 'list' object is not callable\n- #65 Fix error when an object has no status defined while listing in WS\n- #64 AttributeError: 'NoneType' object has no attribute 'getInstrumentEntryOfResults\n- #63 If login failed, setDepartmentCookies throws an IndexError\n- #61 Show more button is not working in Worksheet's Add Analyses view\n- #60 Index Error in Analysis Request Add view\n- #59 AttributeError (NoneType) in service.getInstruments()\n- #57 Select all departments option is not working\n- #56 Client and District not sortable in Analysis Requests listing\n- #52 System throwing error on opening \"Verified\" folder\n\n\n3.2.0.1703-0f28b48 (2017-03-30)\n-------------------------------\n\n**Added**\n\n- #39 Performance improvement. Make use of brains in Worksheets lists\n- #32 Performance improvement. Catalog for analyses and make use of brains\n\n**Fixed**\n\n- #48 Error on AR publish. Global name 'traceback' is not defined (getServiceUsingQuery)\n- #47 Error in CloneAR during retraction. AttributeError: setRequestID\n- #46 Error rejecting an Analysis Request\n- #45 CatalogError in Dashboard. Unknown sort_on index (created) in view.get_sections()\n- #44 AttributeError in worksheets view\n- #43 Sort not working on all lists\n- #41 No Service found for UID None\n- #40 Client Sample ID is missing in Analysis Request Add view\n\n\n3.2.0.1703-1c2913e (2017-03-20)\n-------------------------------\n\n**Added**\n\n- #33 New Analysis Request Add form outside client\n\n**Fixed**\n\n- #37 Publish results throwing an error\n- #36 System is not printing labels automatically\n- #35 Equipment interface is not working\n- #34 Results import submission error\n\n\n3.2.0.1703-e596f2d (2017-03-08)\n-------------------------------\n\n**Added**\n\n- #25 Instrument import without user intervention\n- #22 Date Tested range filter on lists\n- #20 Added filter bar in Aggregated list of analyses\n- HEALTH-364: Added country/province/district columns to client listings\n- Add buttons to export lists to csv and xml formats\n- Additional \"printed\" workflow for analysis requests once published\n\n**Changed**\n\n- #12 Multi-method assignment and Virtual-Real Instrument correspondence\n- #11 Restrictions in manual instrument import - Instruments and interfaces\n- #10 Performance improvement. Catalog for Analysis Requests and use of brains\n\n**Fixed**\n\n- #26 Publishing bug due to SMTP Authentication\n- #24 Condition rule being affected on duplicate samples\n- #23 Date of Birth: crash if date is before 1900\n- #21 Rejection option does not appear if only one column in AR Add form\n- #19 Inconsistent status of Analysis in WS after AR rejection\n- #13 Number of verifications no longer taking effect\n- HEALTH-568: TaqMan 96 interface not working well\n- HEALTH-567: Nuclisens interface not working well\n\n\n3.2.0.1701-26f2c4b (2017-01-17)\n-------------------------------\n\n- LIMS-2477: Reference Analysis has no dependencies; remove guard that assumes it does\n- LIMS-2465: Not possible to translate Bika Listing Table Workflow Action Buttons\n- LIMS-1391: Add configurable identifier types (CAS# for AnalysisService)\n- LIMS-2466: Central Instrument Location Management\n- LIMS-2357: Custom Landing Page and Link to switch between the Front Page and Dashboard\n- LIMS-2341: Cleanup and format default Multi-AR COA\n- LIMS-2455: Contact/Login Linkage Behavior\n- LIMS-2456: Restrict duplicate slots in worksheet templates to routine analyses only.\n- LIMS-2447: getDatePublished index not indexed correctly at time of AR publication\n- LIMS-2404: AR list in batches permitted sampling without Sampler and Sampling date provided\n- LIMS-2380: ARs are created in correct order (order of columns in ar-create form)\n- LIMS-2394: Calculation failure in worksheets. TDS Calc misfires again.\n- LIMS-2391: Use source analysis's sample ID in duplicate analysis IDs\n- LIMS-2351: Field analyses without results do not prevent Samples from being received\n- LIMS-2366: Workflow. AR stays in Received state with all Analyses in To be Verifie\n- LIMS-2384: ARImport: Workflow state of imported ARs and their Analyses not synchronised.\n- LIMS-2369: Workflow. Sampler and Date Sampled should be compulsory\n- LIMS-2355: Unable to view dormant/active filters in some bika_setup pages\n- LIMS-2344: Fix some UI javascript failures when viewing ARs\n- LIMS-2319: AR Add: Deleting a selected CC Contact corrupts the UID of reference widgets\n- LIMS-2325: Allow SampleTypes to be linked with Client Sample Points\n- LIMS-2324: WS export to the LaChat Quick Chem FIA\n- LIMS-2298: Add filter in Clients list\n- LIMS-2299: Add ui for editing ar_count in all analysisrequest lists\n- LIMS-2268: Instrument Interface. Vista Pro Simultaneous ICP, bi-directional CSV\n- LIMS-2261: Cannot create analysis request\n- LIMS-1562: Using a Sample Round. Basic form and printed form\n- LIMS-2266: Crating partitions through Add form, doesn't create partitions.\n- HEALTH-394: Sample sticker layout. 2 new sticker layouts, 2 stickers per row\n- LIMS-2032: AS Methods initialise with 1st available Instrument (loading setup data)\n- LIMS-2014: I can only select a Default Method for an AS if Manual results capture is on\n- LIMS-2181: An analysis is not stopped from using an invalid instrument\n- HEALTH-310: Implemented Nuclisens EasyQ instrument importer\n- HEALTH-319: Instrument. Roche Cobas Taqman 96\n- LIMS-2091: Table Column Display options Everywhere\n- LIMS-2207: Indentation in analysisrequests.py\n- LIMS-2208: WinescanCSVParser class instance variable misspelling\n- LIMS-1832: New Results Template, COA. Multiple ARs in columns\n- LIMS-2148: Unable to sort Bika Listing tables\n- LIMS-1774: Shiny graphs for result ranges\n- Replacement of pagination by 'Show more' in tables makes the app faster\n- Add Bika LIMS TAL report reference in reports preview\n- Simplify instrument interface creation for basic CSV files\n- Scheduled sampling functionality added\n- LIMS-2257: Scheduled sampling\n- LIMS-2255: Switch to Chameleon (five.pt) for rendering TAL templates\n- System-wide filter by department\n- Allow to assign a lab contact to more than one department\n- Multi-verification of analyses, with different verification types\n- Add option to allow multi-approval (multi-verification) of results\n- Added Analyses section in the Dashboard\n- Add option to allow labman to self-verify analysis results\n- Replacement of pagination by 'Show more' in tables makes the app faster\n- Add Bika LIMS TAL report reference in reports preview\n- Simplify instrument interface creation for basic CSV files\n\n\n3.1.13 (2016-12-28)\n-------------------\n\n- LIMS-2299: Add ui for editing ar_count in all analysisrequest lists\n- Removed commented HTML that was causing Chameleon to choke when adding ARs.\n\n\n3.1.12 (2016-12-15)\n-------------------\n\n- HEALTH-569 Bar code printing not working on sample registration\n- Pinned CairoSVG to 1.0.20 (support for Python 2 removed in later versions)\n\n\n3.1.11 (2016-04-22)\n-------------------\n\n- LIMS-2252: Partitions not submitted when creating AR if the form is submitted before partitions are calculated\n- LIMS-2223: Saving a recordswidget as hidden fails\n- LIMS-2225: Formatted results not displayed properly in Worksheet's transposed layout\n- LIMS-2001: Duplicate for one analysis only\n- LIMS-1809: Typos. Perdiod an missing spaces\n- LIMS-2221: Decimal mark doesn't work in Sci Notation\n- LIMS-2219: Using a SciNotation diferent from 'aE+b / aE-b' throws an error\n- LIMS-2220: Raw display of exponential notations in results manage views\n- LIMS-2216: Results below LDL are not displayed in reports\n- LIMS-2217: Specifications are not set in analyses on Analysis Request creation\n- LIMS-2218: Result is replaced by min or max specs when \"<Min\" or \">Max\" fields are used\n- LIMS-2215: Decimal mark not working\n- LIMS-2203: 'Comma' as decimal mark doesnt work\n- LIMS-2212: Sampling round- Sampling round templates show all system analysis request templates\n- LIMS-2209: error in manage analyises\n- LIMS-1917: Inconsistencies related to significant digits in uncertainties\n- LIMS-2015: Column spacing on Client look-up\n- LIMS-1807: Validation for Start Date - End date relationship while creating invoices and price lists\n- LIMS-1991: Sort Order for Analysis Categories and Services\n- LIMS-1521: Date verified column for AR lists\n- LIMS-2194: Error when submitting a result\n- LIMS-2169: Cannot start instance\n- WINE-125: Client users receive unauthorized when viewing some published ARs\n\n\n3.1.10 (2016-01-13)\n-------------------\n\n- Updated Plone to 4.3.7\n- Dashboard: replace multi-bar charts by stacked-bar charts\n- LIMS-2177: template_set error when no template has been selected\n- HEALTH-410: AR Create. Auto-complete Contact field if only 1\n- LIMS-2175: \"NaN\" is shown automatically for result fields that have AS with \"LDL\" enabled and then an error is shown after submitting a result\n- LIMS-1917: Inconsistencies related to significant digits in uncertainties\n- LIMS-2143: Statements vs Invoices\n- LIMS-1989: Retracting a published AR fails if one or more ASs has been retracted before publishing\n- LIMS-2071: Can't generate Invoice Batch/Monthly Statements\n- WINE-71: Instrument. BBK WS export to FIA fails\n- WINE-72: Instrument. BBK WineScan Auto Import fails\n- WINE-58: Instrument. BBK FIAStar import fails\n- WINE-76: WineScan FT120 Import warnings incorrect?\n- LIMS-1906: Spaces should be stripped out of the keywords coming from the Instrument\n- LIMS-2117: Analysis Categories don't expand on Analysis Specification creation\n- LIMS-1933: Regression: Selecting secondary AR in client batches, fails.\n- LIMS-2075: Ensure hiding of pricing information when disabled in site-setup\n- LIMS-2081: AR Batch Import WorkflowException after edit\n- LIMS-2106: Attribute error when creating AR inside batch with no client.\n- LIMS-2080: Correctly interpret default (empty) values in ARImport CSV file\n- LIMS-2115: Error rises when saving a Calculation\n- LIMS-2116: JSONAPI throws an UnicodeDecodeError\n- LIMS-2114: AR Import with Profiles, no Analyses are created\n- LIMS-2132: Reference Analyses got the same ID\n- LIMS-2133: Once in a while, specs var is going empty in results reports\n- LIMS-2136: Site Error on AR Verification\n- LIMS-2121: Fix possible Horiba ICP csv handling errors\n- LIMS-2042: Improving Horiba ICP to avoid Element Symbols as keywords\n- LIMS-2123: Analysis Categories don't expand in Worksheet Templates\n- LIMS-1993: Existing Sample look-up for AR Create in Batch does not work\n- LIMS-2124: QR missing on sticker preview\n- LIMS-2147: Add ARImport schema fields when creating ARs\n- LIMS-409: ShowPrices setting was getting ignored in some contexts\n- LIMS-2062: Cancelled ARs no longer appear in analysisrequest folder listings\n- LIMS-2076: Cancelled batches appear in listing views\n- LIMS-2154: Hide inactive ARs from BatchBook view\n- LIMS-2134: Inactive services appear in AR Create\n- LIMS-2139: WS Blank and Control Selection renderes whole page\n- LIMS-2156: Ignore blank index values when calculating ReferenceAnalysesGroupID\n- LIMS-2157: Cancelled ARs appear in AR listing inside Batches\n- LIMS-2042: Horiba ICP: Missing 'DefaultResult' for imported rows\n- LIMS-2030: Assign ARs in alphabetical ID order to WS\n- LIMS-2167: Cannot assign a QC analysis to an invalid instrument\n- LIMS-2067: Prevent initial method/instrument query for each analysis\n- WINE-82: Ignore invalid entry in Sample field during AR creation\n- LIMS-1717: Workflow transitions in edit context do not take effect\n- WINE-111: Do not attempt formatting of 'nan' analysis result values\n- WINE-114: Some users cannot view published ARs (unauthorised)\n- WINE-122: Transposed worksheet layout failed while rendering empty slots\n- LIMS-2149: Missing analyses can cause error accessing worksheet\n- LIMS-1521: Date verified column for AR lists\n- LIMS-2015: Column spacing on Client look-up\n- LIMS-1807: Validation for Start Date - End Date relationship\n\n\n3.1.9 (2015-10-8)\n-----------------\n\n- LIMS-2068: LIMS-2068 Urgent. Analysis Catgories don't expand\n- LIMS-1875: Able to deactivate instruments and reference samples without logging in\n- LIMS-2049: Displaying lists doesn't work as expected in 319\n- LIMS-1908: Navigation tree order\n- LIMS-1543: Add \"Security Seal Intact Y/N\" checkbox for partition container\n- LIMS-1544: Add \"File attachment\" field on Sample Point\n- LIMS-1949: Enviromental conditions\n- LIMS-1549: Sampling Round Templates privileges and permissions\n- LIMS-1564: Cancelling a Sampling Round\n- LIMS-2020: Add Sampling Round - Department not available for selection\n- LIMS-1545: Add \"Composite Y/N\" checkbox on AR Template\n- LIMS-1547: AR Templates tab inside Sampling Round Template\n- LIMS-1561: Editing a Sampling Round\n- LIMS-1558: Creating Sampling Rounds\n- LIMS-1965: Modified default navtree order for new installations\n- LIMS-1987: AR Invoice tab should not be shown if pricing is toggled off\n- LIMS-1523: Site Error when transitioning AR from 'Manage Analyses' or 'Log' tab\n- LIMS-1970: Analyses with AR Specifications not displayed properly in AR Add form\n- LIMS-1969: AR Add error when \"Categorise analysis services\" is disabled\n- LIMS-1397: Fix Client Title accessor to prevent catalog error when data is imported\n- LIMS-1996: On new system with no instrument data is difficult to get going.\n- LIMS-2005: Click on Validations tab of Instruments it give error\n- LIMS-1806: Instrument Interface. AQ2. Seal Analytical - Error\n- LIMS-2002: Error creating Analysis Requests from batch.\n- LIMS-1996: On new system with no instrument data it is difficult to get going. The warnings could be confusing\n- LIMS-1312: Transposed Worksheet view, ARs in columns\n- LIMS-1760: Customised AR Import spreadsheets (refactored, support importing to Batch)\n- LIMS-1548: Client-specific Sampling Round Templates\n- LIMS-1546: Sampling Round Template Creation and Edit view\n- LIMS-1944: Prevent concurrent form submissions from clobbering each other's results\n- LIMS-1930: AssertionError: Having an orphan size, higher than batch size is undefined\n- LIMS-1959: Not possible to create an AR\n- LIMS-1956: Error upgrading to 319\n- LIMS-1934: Hyperlinks in invoices\n- LIMS-1943: Stickers preview and custom stickers templates support\n- LIMS-1855: Small Sticker layout. QR-code capabilities\n- LIMS-1627: Pricing per Analysis Profile\n- HEALTH-279: AS IDs to be near top of page. Columns in AS list\n- LIMS-1625: Instrument tab titles and headers do not correspond\n- LIMS-1924: Instrument tab very miss-titled. Internal Calibration Tests\n- LIMS-1922: Instrument out of date typo and improvement\n- HEALTH-175: Supplier does not resolve on Instrument view page\n- LIMS-1887: uniquefield validator doesn't work properly\n- LIMS-1869: Not possible to create an Analysis Request\n- LIMS-1867: Auto-header, auto-footer and auto-pagination in results reports\n- LIMS-1743: Reports: ISO (A4) or ANSI (letter) pdf report size\n- LIMS-1695: Invoice export function missing\n- LIMS-1812: Use asynchronous requests for expanding categories in listings\n- LIMS-1811: Refactor AR Add form Javascript, and related code.\n- LIMS-1818: Instrument Interface. Eltra CS-2000\n- LIMS-1817: Instrument Interface. Rigaku Supermini XRF\n- New System Dashboard for LabManagers and Admins\n\n\n3.1.8.3 (2015-10-01)\n--------------------\n\n- LIMS-1755: PDF writer should be using a world-writeable tmp location\n- LIMS-2041: Resolve ${analysis_keyword) in instrument import alert.\n- LIMS-2041: Resolve translation syntax error in instrument import alert\n- LIMS-1933: Secondary Sample selection in Client Batches does not locate samples\n\n\n3.1.8.2 (2015-09-27)\n--------------------\n\n- LIMS-1996: On new system with no instrument data is difficult to get going.\n- LIMS-1760: Customised AR Import spreadsheets (refactored, support importing to Batch)\n- LIMS-1930: AssertionError: Having an orphan size, higher than batch size is undefined\n- LIMS-1818: Instrument Interface. Eltra CS-2000\n- LIMS-1817: Instrument Interface. Rigaku Supermini XRF\n- LIMS-2037: Gracefully anticipate missing analysis workflow history\n- LIMS-2035: Prevent Weasyprint flooding due to asyncronous publish\n\n\n3.1.8.1 (2015-06-23)\n--------------------\n\n- LIMS-1806: Instrument Interface. AQ2. Seal Analytical - Error\n- LIMS-1760: Customised AR Import spreadsheets (refactored, support importing to Batch)\n- Fix portlets.xml for Plone 4.3.6 compatibility\n\n\n3.1.8 (2015-06-03)\n------------------\n\n- LIMS-1923: Typo InstrumentCalibration\n- HEALTH-287: Hyperlink in Instrument messages\n- LIMS-1929: Translation error on Instrument Document page\n- LIMS-1928 Asset Number on Instruments' Certificate tab should use Instrument's default\n- LIMS-1929: Translation error on Instrument Document page\n- LIMS-1773: Instrument. Thermo Fisher ELISA Spectrophotometer\n- LIMS-1697: Error updating bika.lims 317 to 318 via quickinstaller\n- LIMS-1820: QC Graphs DateTime's X-Axis not well sorted\n- LIMS-280 : System IDs starting from a specific value\n- LIMS-1819: Bika LIMS in footer, not Bika Lab Systems\n- LIMS-1808: Uncertainty calculation on DL\n- LIMS-1522: Site Error adding display columns to sorted AR list\n- LIMS-1705: Invoices. Currency unit overcooked\n- LIMS-1806: Instrument Interface. AQ2. Seal Analytical\n- LIMS-1770: FIAStar import 'no header'\n- LIMS-1771: Instrument. Scil Vet abc Plus\n- LIMS-1772: Instrument. VetScan VS2\n- LIMS-1507: Bika must notify why is not possible to publish an AR\n- LIMS-1805: Instrument Interface. Horiba JY ICP\n- LIMS-1710: UnicodeEncode error while creating an Invoice from AR view\n- WINE-44: Sample stickers uses Partition ID only if ShowPartitions option is enabled\n- LIMS-1634: AR Import fields (ClientRef, ClientSid) not importing correctly\n- LIMS-1474: Disposed date is not shown in Sample View\n- LIMS-1779: Results report new fields and improvements\n- LIMS-1775: Allow to select LDL or UDL defaults in results with readonly mode\n- LIMS-1769: Allow to use LDL and UDL in calculations.\n- LIMS-1700: Lower and Upper Detection Limits (LDL/UDL). Allow manual input\n- LIMS-1379: Allow manual uncertainty value input\n- LIMS-1324: Allow to hide analyses in results reports\n- LIMS-1754: Easy install for LIMS' add-ons was not possible\n- LIMS-1741: Fixed unwanted overlay when trying to save supply order\n- LIMS-1748: Error in adding supply order when a product has no price\n- LIMS-1745: Retracted analyses in duplicates\n- LIMS-1629: Pdf reports should split analysis results in different pages according to the lab department\n- Some new ID Generator's features, as the possibility of select the separator type\n- LIMS-1738: Regression. 'NoneType' object has no attribute 'getResultsRangeDict'\n- LIMS-1739: Error with results interpretation field of an AR lacking departments\n- LIMS-1740: Error when trying to view any Sample\n- LIMS-1724: Fixed missing start and end dates on reports\n- LIMS-1628: There should be a results interpretation field per lab department\n- LIMS-1737: Error when adding pricelists of lab products with no volume and unit\n- LIMS-1696: Decimal mark conversion is not working with \"<0,002\" results type\n- LIMS-1729: Analysis Specification Not applying to Sample when Selected\n- LIMS-1507: Do not cause exception on SMTPServerDisconnect when publishing AR results.\n\n\n3.1.7 (2015-02-26)\n------------------\n\n- LIMS-1693: Error trying to save a new AR\n- LIMS-1570: Instrument interface: Roche Cobas Taqman 48\n- LIMS-1520: Allow to invalidate verified ARs\n- LIMS-1690: Typo. Instrument page\n- LIMS-1688: After AR invalidation, ARs list throws an error\n- LIMS-1569: Instrument interface: Beckman Coulter Access 2\n- LIMS-1689: Error while creating a new invoice batch\n- LIMS-1266: Sampling date format error\n- LIMS-1365: Batch search parameters on Work sheets/Work sheets insides Batches\n- LIMS-1428: After receiving a sample with Sampling Workflow enable is not possible to input results\n- LIMS-1540: When accent characters are used in a \"Sample Type\" name, it is not possible to create a new AR\n- LIMS-1617: Error with bin/test\n- LIMS-1571: Instrument interface: Sysmex XS-1000i\n- LIMS-1574: Fixed AR and Analysis attachments\n- LIMS-1670: Fixed windows incompatibility in TAL (referencewidget.pt)\n- LIMS-1594: Added option to select landing page for clients in configuration registry\n- LIMS-1594: Re-ordered tabs on Client home page\n- LIMS-1520: Allow to invalidate verified ARs\n- LIMS-1539: Printable Worksheets. In both AR by row or column orientations\n- LIMS-1199: Worksheet totals in WS lists\n- LIMS-257: Set Blank and Warning icons in Reference Sample main view\n- LIMS-1636: Batch Sample View crash\n- LIMS-1524: Invalidate email does not have variables populated\n- LIMS-1572: Instrument interface: Sysmex XS-500i\n- LIMS-1575: Thermo Arena 20XT\n- LIMS-1423: Save details when AR workflow action kicked off\n- LIMS-1624: Import default test.xlsx fails\n- LIMS-1614: Error when selecting Analysis Administration Tab after receiving a sample with Sampling Workflow enabled\n- LIMS-1605: Tescan TIMA interface\n- LIMS-1604: BioDrop uLite interface\n- LIMS-1603: Life Technologies Qubit interface\n- LIMS-1517: Storage field tag untranslated?\n- LIMS-1518: Storage Location table\n- LIMS-1527: CC Contact on AR view (edit) offers all contacts in system\n- LIMS-1536: Add button [Add], to alow quickly addings in referencewidget\n- LIMS-1587: Better support for extension of custom sample labels\n- LIMS-1622: Version Check does not correctly check cache\n- LIMS-1623: Implement bika-frontpage as a BrowserView\n\n\n3.1.6 (2014-12-17)\n------------------\n\n- LIMS-1530: Scrambled Analysis Category order in Published Results\n- LIMS-1529: Error while inserting an AR with container-based partitioning is required\n- LIMS-1460: Additional field in AR for comments or results interpretation\n- LIMS-1441: An error message related to partitions unit is shown when selecting analysis during AR creation\n- LIMS-1470: AS Setup. File attachment field tag is missing\n- LIMS-1422: Results doesn't display yes/no once verified but 1 or 0\n- LIMS-1486: Typos in instrument messages\n- LIMS-1498: Published Results not Showing for Logged Clients\n- LIMS-1445: Scientific names should be written in italics in published reports\n- LIMS-1389: Units in results publishing should allow super(sub)script format, for example in cm2 or m3\n- LIMS-1500: Alere Pima's Instrument Interfice\n- LIMS-1457: Exponential notation in published AR pdf should be formatted like a×10^b instead of ae^+b\n- LIMS-1334: Calculate result precision from Uncertainty value\n- LIMS-1446: After retracting a published AR the Sample gets cancelled\n- LIMS-1390: More workflow for Batches\n- LIMS-1378: Bulking up Batches\n- LIMS-1479: new-version and upgrade-steps should be python viewlets\n- LIMS-1362: File attachment uploads to Batches\n- LIMS-1404: New Batch attributes (and their integration with existing ones on Batch views)\n- LIMS-1467: Sample Point Lookup doesn't work on AR modify\n- LIMS-1363: Batches per Client\n- LIMS-1405: New Sample and AR attributes\n- LIMS-1085: Allow Clients to add Attachments to ARs\n- LIMS-1444: In AR published report accredited analysis services are not marked as accredited\n- LIMS-1443: In published reports the publishing date is not shown in the pdf\n- LIMS-1420: Status filter is not kept after moving to next page\n- LIMS-1442: Sample Type is not filtred by Sample Point\n- LIMS-1448: Reports: when you click on \"Analysis turnaround time\" displays others\n- LIMS-1440: Error when trying to publish with analysis from different categories\n- LIMS-1459: Error when checking instrument validity in manage_results\n- LIMS-1430: Create an AR from batch allows you to introduce a non existent Client and Contacts don't work properly\n- After modifying analysis Category, reindex category name and UID for all subordinate analyses\n- Setup data import improvements and fixes\n- Simplify installation with a custom Plone overview and add site\n\n\n3.1.5 (2014-10-06)\n------------------\n\n- LIMS-1082: Report Barcode. Was images for pdf/print reports etc\n- LIMS-1159: reapply fix for samplepoint visibility\n- LIMS-1325: WSTemplate loading incompatible reference analyses\n- LIMS-1333: Batch label replace with standard Plone keyword widget\n- LIMS-1335: Reference Definitions don't sort alphabetically on WS Template lay-outs\n- LIMS-1345: Analysis profiles don't sort\n- LIMS-1347: Analysis/AR background colour to be different to for Receive and To be Sampled\n- LIMS-1360: Number of analyses in ARs folder view\n- LIMS-1374: Auto label printing does not happen for an AR drop-down receive\n- LIMS-1377: Error when trying to publish after updating branch hotfix/next or develop\n- LIMS-1378: Add AR/Sample default fields to Batch\n- LIMS-1395: front page issue tracker url\n- LIMS-1402: If no date is chosen, it will never expire.\" not been accomplished\n- LIMS-1416: If a sample point has a default sample type the field is not pulled automatically during AR template creation\n- LIMS-1425: Verify Workflow (bika_listing) recursion\n- added 'getusers' method to JSON API\n- Added 'remove' method to JSON API\n- Added AR 'Copy to new' action in more contexts\n- Added basic handling of custom Sample Preparation Workflows\n- Added decimal mark configuration for result reports\n- Added help info regards to new templates creation\n- Added IAcquireFieldDefaults - acquire field defaults through acquisition\n- Added IATWidgetVisibility - runtime show/hide of AT edit/view widgets\n- Added watermark on invalid reports\n- Added watermark on provisional reports\n- Alert panel when upgrades are available\n- All relevant specification ranges are persisted when copying ARs or adding analyses\n- Allow comma entry in numbers for e.g. German users\n- Bika LIMS javascripts refactoring and optimization\n- Fix ZeroDivisionError in variation calculation for DuplicateAnalysis\n- Fixed spreadsheet load errors in Windows.\n- Fixed template rendering errors in Windows\n- JSONAPI update: always use field mutator if available\n- JSONAPI: Added 'remove' and 'getusers' methods.\n- Refactored ARSpecs, and added ResultsRange field to the AR\n\n\n3.1.4.1 (2014-07-24)\n--------------------\n\n- 3.1.4 release was broken, simple ARs could not be created.\n- LIMS-1339: Published reports should use \"±\" symbol instead of \"+/-\"\n- LIMS-1327: Instrument from worksheet\n- LIMS-1328: Instrument calibration test graphs do not work on multiple samples\n- LIMS-1347: Analysis/AR background colour to be different to for Receive and To be Sampled\n- LIMS-1353: Analyses don't sort in Attachment look-up\n\n- #eview for Results reports\n    - Single/Multi-AR preview\n    - Allows to cancel the pre-publish/publish process\n    - Allows to make visible/invisible the QC analyses\n    - Allows to add new custom-made templates\n    - JS machinery allowed for pdf reporting\n\n\n3.1.4 (2014-07-23)\n------------------\n\n- LIMS-113: Allow percentage value for AS uncertainty\n- LIMS-1087: Prevent listing of empty categories\n- LIMS-1203: Fix Batch-AnalysisRequests query\n- LIMS-1207: LIMS-113 Allow percentage value for AS uncertainty\n- LIMS-1221: use folder icon for ARImports in nav\n- LIMS-1240: fix permissions for \"Copy To New\" in AR lists\n- LIMS-1330: handle duplicate of reference analysis\n- LIMS-1340: soft-cache validator results\n- LIMS-1343: Prevent sudden death if no version information is available\n- LIMS-1352: SamplingWorkflow not saved to sample\n- LIMS-334: Add Service/ExponentialFormatPrecision\n- LIMS-334: Added ExponentialFormatThreshold setting\n- LIMS-334: Allow exponential notation entry in numeric fields\n- LIMS-334: Exponent Format used for analysis Result\n- LIMS-334: Remove duplicate getFormattedResult code\n- LIMS-83: Update Method->calculation reference version when Calculation changes\n- Formula statements can be written on multiple lines for clarity.\n- Replace kss-bbb ajax-spinner with a quieter one\n- bika.lims.utils.log logs location url correctly\n\n\n3.1.3 (2014-07-17)\n------------------\n\n- Missing fixes from 3.1.2\n- LIMS-671: Preferred/Restricted client categories\n- LIMS-1251: Supply order permission error\n- LIMS-1272: Currency in Price Lists\n- LIMS-1310: Broken AnalysisProfile selector in AR Add form.\n\n\n3.1.2 (2014-07-15)\n------------------\n\n- LIMS-1292: UI fix Retracted ARs workfow: Warning msg on \"full\" retract.\n- LIMS.1287: UI fix Report parameter formatting\n- LIMS-1230: UI fix Livesearch's box\n- LIMS-1257: UI fix Long titles in Analysis Profiles, Sample Points, etc.\n- LIMS-1214: UI fix More columns\n- LIMS-1199: UI fix Worksheet listing: better columns\n- LIMS-1303: jsi18n strings must be added to bika-manual.pot.  i18ndude cannot find.\n- LIMS-1310: Filter SamplePoints by client in AR Template Edit View\n- LIMS-1256: Client objects included in AR-Add filters for Sample Point etc.\n- LIMS-1290: Allows Analyst to retract analyses, without giving extra permissions.\n- LIMS-1218: Slightly nicer monkey patch for translating content object ID's and titles.\n- LIMS-1070: Accreditation text can be customised in bika_setup\n- LIMS-1245: off-by-one in part indicators in ar_add\n- LIMS-1240: Hide \"copy to new\" from Analyst users\n- LIMS-1059: Added worksheet rejection workflow\n\n    RejectAnalysis (Analysis subclass (has IAnalysis!)) workflow transition.\n\n    Does not retract individual Analysis objects - instead, forces their state\n        back to \"Received\", and assigns them onto newly created WS.\n\n    Sets attributes on src and dst worksheets:\n        WS instance rejected worksheet attribute: .replaced_by = UID\n        WS instance replacement worksheet attribute: .replaces_rejected_worksheet:UID\n\n- Fixed some i18n and encoding snags, and updated translations.\n\n\n3.1.1 (2014-06-29)\n------------------\n\n- Some bugs which only appear while running Windows, have been fixed.\n- LIMS-1281: Fix Restricted and Default categories in ar_add\n- LIMS-1275: Fix lax Aalyst permissions\n- LIMS-1301: jsonapi can set ReferenceField=\"\"\n- LIMS-1221: Icon for ARImports folder in Navigation\n- LIMS-1252: AR Published Results Signature Block formatting\n- LIMS-1297: Update frontpage\n\n\n3.1 (2014-06-23)\n----------------\n\n- #oduct and Analysis specifications per AR\n- Incorrect published results invalidation workflow\n- Improved re-testing workflow\n- Adjustment factors on worksheets\n- Using '< n' and '> n' results values\n- Sample Storage locations\n- Sample Categories\n- Analysis Prioritisation\n- Bulk AR creation from file\n- Results reports inclusion of relevant QC results\n- Supply Inventory and Orders\n- JSON interface\n- Management Reports export to CSV\n- Enhancements to AR Batching\n- Enhancements to Results Reports\n- Instrument management module\n    - Calibration certificates, maintenance, Instrument QC\n    - Method, Instrument and Analysis integrity\n- Instrument interfaces\n   - Agilent MS 'Masshunter Quant'\n   - Thermo Gallery\n   - Foss Winescan FT 120, Auto\n- Invoices\n   - Per AR, Analysis per Invoice line.\n   - Per Supply Order, inventory item per Invoice line\n   - Invoices by email\n   - Invoice 'batches' for selected time period, ARs aand Orders per Invoice line\n   - Invoice batch export to accounts systems\n   - #ice lists. Analysis Services and Supplies\n\n\n3.1.3036 (2014-05-30)\n---------------------\n\n- Added two checboxes in BikaSetup > Security:\n- Allow access to worksheets only to assigned analysts (Y/N)\n- Only lab managers can create and amange new worksheets (Y/N)\n\n** IMPORTANT NOTES **\n\nThe 3036 upgrade sets the above options to true by default, so after\nbeing upgraded, only the labmanagers will be able to manage WS and the\nanalysts will only have access to the worksheets to which they are\nassigned. These defaults can be changed in BikaSetup > Security.\n\n\n3.0 (2014-03-15)\n----------------\n\n- Fix some out-dated dependencies that prevented the app from loading.\n- Development of the current bika 3.0 code has slowed, and our efforts have been focused on\n  the 3.01a branch for some time.\n\n\n3.0rc3.5.1 (2013-10-25)\n-----------------------\n\n- Fix CSS AR Publication error\n- Fix error displaying client sample views\n\n\n3.0rc3.5 (2013-10-24)\n---------------------\n\n- Requires Plone 4.3.  For information on upgrading Plone, visit\n  http://plone.org/documentation/manual/upgrade-guide\n- Fix a serious error saving Analysis results.\n- Improve upgrade handling in genericsetup profile\n- Fix errors in setupdata loader\n- Force UTF-8 encoding of usernames (imported client contacts can now login)\n- Removed outdated test setup data\n- Handle duplicate request values in bika_listing\n- ID server handles changes in ID schemes without error\n- Remove folder-full-view from front-page view\n- Updated workflow and permissions to prevent some silly errors\n- Add robot tests\n- Add default robots.txt\n\n\n3.0rc3.2 (2013-06-28)\n---------------------\n\n- Fix site-error displaying upgraded instruments\n- Fix spinner (KSS is not always enabled)\n- Add extra save button in ar_add\n- Label Printing: \"Return to list\" uses browser history\n- Bold worksheet position indicators\n- Remove version.txt (use only setup.py for version)\n\n\n3.0rc3.1 (2013-06-27)\n---------------------\n\n- Fix permission name in upgrade step\n\n\n3.0rc3 (2013-06-25)\n-------------------\n\n- Many instrument management improvements! (Merge branch 'imm')\n- Removed ReferenceManufacturer (use of generic Manufacturer instead)\n- Removed ReferenceSupplier (use Supplier instead)\n- Improve service/calculation interim field widgets\n  Allows service to include custom fields (without calculation selected)\n- Fix services display table categorisation in Analysis Specification views\n- Stop focusing the search gadget input when page load completes. (revert)\n- Limit access to Import tab (BIKA: Manage Bika)\n- New permission: \"BIKA: Import Instrument Results\"\n- New permission: \"BIKA: Manage Login Details\" - edit contact login details\n- Some late changes to better handle the updates to ID creation\n- Plone 4.3 compatibility (incomplete)\n- Use Collections as a base for Queries (incomplete)\n- Many many bugfixes.\n\n\n3.0rc2.3 (2013-01-29)\n---------------------\n\n- Fix bad HTML\n\n\n3.0rc2.2 (2013-01-28)\n---------------------\n\n- Fix an error during AR Publish\n\n\n3.0rc2.1 (2013-01-21)\n---------------------\n\n- Fix bad HTML\n- Pin collective.js.jqueryui version to 1.8.16.9\n\n\n3.0rc2 (2013-01-21)\n-------------------\n\n- Updated all translations and added Brazilian Portuguese\n- RecordsWidget: subfield_types include \"date\"\n- RecordsWidget: Automatic combogrid lookups\n- Added all bika types to Search and Live Search\n- Transition SamplePartition IDs to new format (SampleType-000?-P?\n- Always handle non-ASCII characters: UTF-8 encoding everywhere\n- Accept un-floatable (text) results for analyses\n- Hidden InterimFields in Calculations\n- Added InterimFields on AnalysisServices for overriding Calculation Interimfields.\n- Disable KSS inline-validation\n- Categorized analyses in AR views\n- Added remarks for individual analyses\n- Improved Javascript i18n handling\n- Improved default permissions\n- New reports\n    - Added 'Analysis summary per department' (merge of 'Analyses lab department weekly' and 'Analyses request summary by date range'\n    - Added 'Analyses performed as % of total' report\n    - Added Analyses per lab department report\n    - Added 'Samples received vs. samples reported' report\n    - Added Daily Samples Received report\n- Many many bugfixes.\n\n\n3.0rc1 (2012-10-01)\n-------------------\n\n- Removed Bika Health data from released egg\n- Remove remarks from portal_factory screens\n- Add Month/Year selectors to default datetime widget\n- ClientFolder default sorting.\n- Date formats for jquery datepicker\n- Don't overwrite the Title specified in @@plone-addsite\n- Bug fixes\n\n\n3.0rc1 (2012-09-25)\n-------------------\n\n- Requires Python 2.7 (Plone 4.2)\n- Add GNUPlot dependency\n- Added client sample points\n- Added Sampling Deviation selections\n- Added Ad-Hoc sample flag\n- Added Sample Matrices (Sampletype categorisation)\n- Added custom ResultsFooter field in bika setup\n- Added PDF Attachments to published results\n- Electronic signature included in Results and Reports\n- Login details form to create users for LabContacts\n- Sampling workflow is disabled by default\n- Methods are versioned by default\n- Methods are publicly accessible by default\n- Queries WIP\n- Reports WIP\n- Modified label layouts for easier customisation\n- Cleaned print styles\n- Use plonelocales for handling Date/Time formats\n- SMS and Fax setup items are disabled by default\n\n\n2012-06-21\n----------\n\n- Partitioning & Preservation automation\n- Reports\n- Sample point & types relations in UI\n- AR template enhancements\n- Sample and AR layout improvements\n- Labels\n- Configuration logs\n- Faster indexing\n- JavaScript optimisation\n- Better IE compatibility\n- Set-up worksheet improvements\n- Updated translations\n- Workflow tweaks\n- Tweaks to Icons, Views & Lists\n\n\n2012-04-23\n----------\n\n- Optional sampling and preservation workflows and roles.\n- Sample partitioning.\n- AR templates - Sample point & Sample type restrictions.\n- Reports - framework only. 'Analysis per service' shows what is planned.\n- Improved i18n handling, and updated strings from Transifex.\n- Numerous performance enhancements\n- Analysis Service & Method associations.\n- An improved Analysis Service pop-up window.\n- Sample Type and Sample Point relationship.\n- Currency selection from zope locales\n- Combined AR View and Edit tabs.\n- Re-factored AR 'Add/Remove Analyses' screen\n- Store the date of capture for analysis results\n- Append only remarks fields on more objects.\n\n\n2012-01-23\n----------\n\n- Made Bika compatible with Plone 4.1\n- Sampler and Preserver roles, users and permissions\n- Sampling and Preservation workflows\n- Inactive and Cancellation Workflows\n- #e-preserved Containers\n- Automatic versioning for some bika_setup types\n- Analyst and Instrument on Worksheet templates\n- XLSX setup data loader\n- Sample disposal date based on date sampled, not date received.\n- Internal ID Server by default\n- user defined calculations and interim fields\n- Dry Matter results option does not appear until enabled in Site Setup\n- Accreditation portlet disabled until enabled in Site Setup\n- BikaListingView\n- New icons\n- (mostly) usable at 800x600\n- Column display toggles\n- Future dated samples and ARs\n- Accreditation template: i18n in locales/manual.pot/accreditation_*\n- intermediate workflow state for analyses requiring attachments\n- Labmanager has Site Administrator role (not Manager)\n- 'Indeterminate' results\n- use portal_factory everywhere\n- working test suite\n- static resource directories\n- Merged BikaMembers types\n- CoordinateField/Widget\n- DurationField/Widget\n- CustomRecordsWidget\n\n\n2.3.3 Bug fix release\n---------------------\n\n - Inclusion of BikaMembers 0.0.3. No changes to bika code, version bumped\n   to facilitate release of new BikaMembers version.\n\n\n2.3\n---\n\n- Analysis categories introduced\n- Analysis service result restrictions - specification of possible results\n- Allow site and client specification of email and fax subject line content\n- Additional instrument/export formats:\n  WinescanFT120, WinescanAuto, FIAStar and Bartelt's data-collector\n- Export worksheet analyses to instruments\n- PDF as a result output option\n- SMS result output option\n- Result publication options synchronized and signatures added to emails\n- Email batching of query results conforms to result mailing\n- IDServer batching of unique id request\n- Optmization of worksheet searching on selection criteria\n- Extract tab added with extract for analysis services or profiles\n- Batch update of analysis service prices\n- German translation module added\n- Added a light query form which excludes analysis category and service\n- Batch size setting in analysis request lists\n- BikaMembers replaces UpfrontContacts\n- ATSchemaEditor removed\n- Significant performance improvements\n- Resolve client action conflicts\n- Sampled date validation\n- Drymatter formatting on output corrected\n- Correct default none workflows\n- Review portlet optimization\n- #icelist prints blank for analysis service with price not defined\n\n\n2.2\n---\n\n- Attachments permitted on analysis requests and analyses\n- Worksheet resequencing, and sort order for worksheet analysis selection\n- Worksheet deletion only available for open worksheets\n- Portlet to provide export of analysis services and analysis profiles\n- Requirement for unique analysis service names, analysis service keywords,\n- instrument import keywords and analysis profile keywords enforced.\n- Report headings and formats standardized accross different reports\n- AR import alternative layout provided with selection, including profiles\n- #ogress bar introduced for long running processes\n\n\n2.1.1\n-----\n\n- Disposal Date for Samples and Retention Period per Sample Type added.\n- Various new search criteria added.\n- Standard Manufacturers introduced.\n- Labels for Standard Samples introduced.\n- \"Print\" and \"Email\" facilities introduced for lists of Standard Samples and Standard Stocks.\n- \"Duplicate\" facility for Analysis Services introduced.\n- Addresses added to top of emailed query results.\n- Labels for Samples and Analysis Requests changed.\n- Analysis Services can have multiple Methods.\n- Change log introduced for Methods.\n- Methods added to left navigation bar.\n- List of Methods included in pop-up for Analyses.\n- Documents may be uploaded for Methods.\n\n\n2.1\n---\n\n- Sample object and workflow introduced\n- Results specifications, lab and per client\n- Analysis profiles\n- Worksheet template engine\n- Interface to Bika Calendar\n- Import of analysisrequests from csv file\n- Export of results to csv file\n- #int as publication option\n- Lab Departments, lab contacts, and department manager introduced\n- Quality Control calculations. Control, blank and duplicate analyses.\n- QC graphs, normal distribution, trends and duplicate variation\n- Various analysis calculations allowed. Described by Calculation Type\n- Dependant Calcs introduced. Where an analysis result is calculated from\n-  other analyses: e.g. AnalysisX = AnalysisY - Analysis Z\n- Dry matter result reporting. Results are reported on sample as received,\n  and also as dry matter result on dried sample\n- Re-publication, Pre publication of individual results and per Client\n- Many reports including Turn around, analyses repeated and out of spec\n\n\n1.2.1\n-----\n\n- Removed invoice line item descriptions from core code to allow skin integration\n- Create dummy titration values for analyses imported from instrument\n- More language translations\n\n\n1.2.0\n-----\n\n- Statements renamed to Invoices\n- Jobcards renamed to Worksheets\n- New identification fields added to analysis request\n- Client Reference, Sample Type and Sample Point\n- Welcome page introduced\n- Late analyses list linked from late analyses portlet\n- Icon changes\n- Accreditation body logo and details added to laboratory info\n- Accreditation logo, disclaimers added throughout web site\n- Laboratory confidence level value data driven from laboratory info\n- Analyses methods provided as pop-up where analyses are listed\n- Titration factors and titration volumes added to analyses and worksheets\n- Measure of uncertainties introduced per analysis and intercept\n- Two new specialist roles created - verifier and publisher\n- Sample test data load script - load_sample_data.py\n- Implement generic instrument data import tool\n- Login portlet added\n- Modifications required to support interlab\n  Permit analysis parent (sample) to be in 'released' state.\n  Reference SampleID on AnalysisRequest-\n- 1566324: Logged in page redirected to welcome page.\n- 1573299: LiveSearch - Added permissions to InvoiceLineItem.\n- 1573083: Status Drop Down - Invoicing\n- 1551957: Contacts not visible to other contacts. Correct local owner role\n- 1566334: position of 'add new ar' button changed to conform to other forms\n- 1532008: query results sort order most recent first\n- 1532770: Order default listing correction\n- 1558458: Member discount data driven in messages on AR forms\n- 1538354: SubTotal and VAT calculation on edit AR\n- 1532796: AR edit - allow change of contact\n\n\n1.1.3\n-----\n\nThis is a bug fix release. Migration from older versions has also been improved\ngreatly.\n\nPlease note that AnalysisRequest now has a custom mutator that expects the\ntitle of the Cultivar, not the UID. This will impact anybode that customised\nthe *analysisrequed_add.cpy* controller script and the\n*validate_analysisrequest_add_form.vpy* validation script.\n\n\n- 1423182: IndexError on surfing to LIMS pages without being logged on\n- 1423238: Orders - Dispatch date\n- 1429992: AR edit tab - Cultivar uneditable\n- 1429996: Cultivar names to allow numbers\n- 1429999: Late analysis alert - 'More...' URL\n- 1430002: Sample due alerts - 'More...' URL\n- 1433787: Security - Clients\n- 1434100: Search - Index & Attribute errors\n- 1418473: Updated start-id-server.bat for Win2K & Win XP\n\n\n1.1.2\n-----\n\n- 1423205: Show logs to labmanager set-up\n- 1291750: Added default ID prefixes for Order and Statement\n- 1424589: Late analysis alert to be calulated on date received\n\n\n1.1.1\n-----\n\n- Updated portlets with Plone 2.1 style definition list markup\n- 1423179: Clients must not see JobCard links on Analysis Requests\n- 1423182: IndexError on surfing to LIMS pages without being logged on\n- 1423188: Site map - Clients should not have access to ...\n- 1423191: Link rot - 'logged in' page\n- 1423193: Groups folder should not be shown\n- 1423194: No 'More...' if there are less than 5\n- 1423204: AR view - Missing tabs and status drop down\n- 1423209: Schema Editor - Drop Down List Issue (Select)\n- 1423234: Late Analysis alert shows for anonymous visitors\n- 1423363: Report Analysis Totals\n- 1423386: Email publication error\n\n\n1.1.0\n-----\n\n- Made Bika compatibable with Plone 2.1\n- Added Spanish translation contributed by Luis Espinoza\n- Added Italian translation contributed by Pierpaolo Baldan\n- Added Dutch translation contributed by Joris Goudriaan\n- Added Portugese translation contributed by Nuno R. Pinhão\n- The schemas of Client, Contact, AnalysisRequest and Order can be\n  edited in the through-the-web schema editor, ATSchemaEditorNG.\n- The maximum time allowed for the publication of results can now be\n  set per analysis service. The portlet\n  'skins/bika/portlet_late_analysis.pt' has been added to alert lab\n  users when analyses are late.\n- Analyses on an AnalysisRequest have a reference to a Jobcard,\n  rendered as a hyperlink on the AnalysisRequest view.\n- A bug has been fixed where 'not_requested' analyses were checked\n  on the AnalysisRequest edit form.\n- Enabled 'changed_state' folder button globally and disabled on\n  AnalysisRequest and Jobcard.\n\n\n1.0.1\n-----\n\n- Updated 'skins/bika/date_components_support.py' with latest\n  version of script in Plone 2.0.5\n- Modified access to transitions in workflow scripts, normal\n  attribute access seems to guarded since Zope 2.7.5.\n- Added CHANGES.txt and README.txt\n- Added windows batch script for ID server\n  (scripts/start-id-server.bat)",
    "docs_url": null,
    "download_url": "",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "https://github.com/senaite/senaite.core",
    "keywords": "senaite,lims,opensource",
    "license": "GPLv2",
    "maintainer": "",
    "maintainer_email": "",
    "name": "senaite.core",
    "platform": "",
    "project_url": "https://pypi.org/project/senaite.core/",
    "release_url": "https://pypi.org/project/senaite.core/1.2.1/",
    "requires_dist": [],
    "requires_python": "",
    "summary": "SENAITE Core",
    "version": "1.2.1"
  },
  "releases": {
    "1.2.0": [
      {
        "comment_text": "",
        "digests": {
          "md5": "7404c57e6f002b40c5e36abf6abc33ee",
          "sha256": "5da02471244e008575f518ceea6645518a0d7972f7db48796410b72fdf0984ac"
        },
        "downloads": -1,
        "filename": "senaite.core-1.2.0.zip",
        "has_sig": false,
        "md5_digest": "7404c57e6f002b40c5e36abf6abc33ee",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 8297804,
        "upload_time": "2018-01-03T20:17:49",
        "url": "https://files.pythonhosted.org/packages/06/84/f937e2a14290dac1f476462809685131a9c0bc86f7fca07a5407eafb3ab1/senaite.core-1.2.0.zip"
      }
    ],
    "1.2.1": [
      {
        "comment_text": "",
        "digests": {
          "md5": "994bdc4b7b67b6244f286a80aa11f0d6",
          "sha256": "b5daf590e0ae5bdc8ee9c6d9377305604af8e879173422041622d39e13c941e3"
        },
        "downloads": -1,
        "filename": "senaite.core-1.2.1.zip",
        "has_sig": false,
        "md5_digest": "994bdc4b7b67b6244f286a80aa11f0d6",
        "packagetype": "sdist",
        "python_version": "source",
        "size": 8320052,
        "upload_time": "2018-01-26T16:51:02",
        "url": "https://files.pythonhosted.org/packages/c5/97/d985d950b1765cdccd8496cedd93ecd0c9b59e3768664f715a08690b7613/senaite.core-1.2.1.zip"
      }
    ]
  },
  "urls": [
    {
      "comment_text": "",
      "digests": {
        "md5": "994bdc4b7b67b6244f286a80aa11f0d6",
        "sha256": "b5daf590e0ae5bdc8ee9c6d9377305604af8e879173422041622d39e13c941e3"
      },
      "downloads": -1,
      "filename": "senaite.core-1.2.1.zip",
      "has_sig": false,
      "md5_digest": "994bdc4b7b67b6244f286a80aa11f0d6",
      "packagetype": "sdist",
      "python_version": "source",
      "size": 8320052,
      "upload_time": "2018-01-26T16:51:02",
      "url": "https://files.pythonhosted.org/packages/c5/97/d985d950b1765cdccd8496cedd93ecd0c9b59e3768664f715a08690b7613/senaite.core-1.2.1.zip"
    }
  ]
}