{
  "info": {
    "author": "Federico Ambrogi, Sabine Kraml, Suchita Kulkarni, Ursula Laa, Andre Lessa, Veronika Magerl, Wolfgang Magerl, Doris Proschofsky, Michael Traub, Jory Sonneveld, Wolfgang Waltenberger",
    "author_email": "smodels-developers@lists.oeaw.ac.at",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 5 - Production/Stable",
      "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
      "Topic :: Scientific/Engineering :: Physics"
    ],
    "description": "==============\nSModelS v1.1\n==============\n\nSModelS -- A tool for interpreting simplified-model results from the LHC.\n\nSModelS is an automatic, public tool for interpreting simplified-model results\nfrom the LHC. It is based on a general procedure to decompose Beyond the\nStandard Model (BSM) collider signatures presenting a Z2 symmetry into\nSimplified Model Spectrum (SMS) topologies. Our method provides a way to cast\nBSM predictions for the LHC in a model independent framework, which can be\ndirectly confronted with the relevant experimental constraints. Our concrete\nimplementation currently focusses on supersymmetry searches with missing\nenergy, for which a large variety of SMS results from ATLAS and CMS are\navailable. \n\n\nFor instructions on how to install SModelS, see INSTALLATION.\n\n\nRunning SModelS\n===============\n\nSModelS provides a command-line tool (runSModelS.py) for the basic functionalities,\nwhich can be executed as:\n\n./runSModelS.py -p <parameter file> -f <input file or directory> -o <output directory>\n\nFor help instructions:\n\n./runSModelS.py -h\n\nAn example file on how to call the SModelS libraries from your own\nPython code can be found in Example.py.\n\nDetailed explanations on how to use SModelS, including explanations of the\noutput, can be found in the section ''Running SModelS'' of the SModelS manual\n(docs/Manual.html).\n\nA few example input files are provided in the inputFiles folder and can be\nused to test runSModelS.py.\n\n\nCitation\n========\n\nIf you use this software please cite SModelS v1.1 as well as the programs\nit makes use of (Pythia8.223/Pythia6.4.27, NLL-fast and PySLHA). \nFor your convenience, the relevant\ncitations are provided in bibtex format in references.bib.\n\nFor citing the experimental analyses in the database, you can use\nsmodels-database/database.bib",
    "docs_url": null,
    "download_url": "UNKNOWN",
    "downloads": {
      "last_day": 0,
      "last_month": 0,
      "last_week": 0
    },
    "home_page": "http://smodels.hephy.at/",
    "keywords": "simplified models LHC BSM theories interpretation supersymmetry UEDs",
    "license": "GPLv3",
    "maintainer": null,
    "maintainer_email": null,
    "name": "smodels",
    "platform": "UNKNOWN",
    "project_url": "https://pypi.org/project/smodels/",
    "release_url": "https://pypi.org/project/smodels/1.1.1/",
    "requires_python": null,
    "summary": "A tool for interpreting simplified-model results from the LHC",
    "version": "1.1.1"
  },
  "releases": {
    "1.1.1": []
  },
  "urls": []
}